Repository: w3techy/WordPress-YR
Catalog: meta-plugins-v3-yor.po
Languages: yo_ng

source: At this time, we are not accepting this plugin. While the directory is open for all secure, GPLv2 (or later) compatible plugins, we reserve the right to reject any plugin on any grounds we feel are reasonable, whether or not they are explicitly noted in the guidelines. <strong>What to do next</strong> We know that being told we won't host your code is hurtful, and we ask you please read this email in full. If, at the end, you feel this decision was in error, please reply to this email with your plugin attached as a zip and explain why you feel your plugin should be accepted. <strong>Why this plugin was not accepted</strong> This Plugin seems to be associated in some way with a previously banned author. The Plugin Directory is open to everyone who can and will comply with guidelines. When people demonstrate they cannot, or will not, they are no longer welcome as their actions are detrimental to the community and the volunteers who maintain. This extends to people hired to act in their name (i.e. employees, consultants, etc). Banned authors are no longer permitted to host their code on WordPress.org, they are certainly welcome to host their code via other venues and services. We strongly recommend them to invest in software to manage self-updates. There are multiple options available to them outside of our hosting. <strong>Any attempts to circumvent this suspension will be seen as intentionally hostile, and result in further restrictions. Do not make a new account, do not attempt to get around this ban, do not try to hide your identity and resubmit.</strong> If you've gotten all the way down here and still think we should be hosting your code, we ask you not resubmit the plugin, and reply to this email instead.
yo_ng: A ti kọ plugin rẹ nítorí pé a kò gba àwọn ìlapa, àwọn àpẹẹrẹ, àti àwọn ilé-ìkàwé mọ́ bíi àwọn plugin tí ó dá dúró. <strong>Ohun tó yẹ kí o ṣe</strong> Tí o bá rò pé àṣìṣe ni èyí, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ìdí tí o fi rò pé plugin rẹ kì í ṣe ilé-ìkàwé tàbí àpẹẹrẹ. Kí o tó ṣe bẹ́ẹ̀, a rọ̀ ọ́ láti lo àkókò láti ka lẹ́tà sọ̀nrọ̀sọ̀ yìí lẹ́kùn-únrẹ́rẹ́. A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ, àti pé ọ̀rọ̀ pàtó yìí lè fa ìyapa, pàápàá jùlọ nítorí pé a máa ń gba koodu ilé-ìkàwé láàyè tẹ́lẹ̀. A ti yàn láti má ṣe pa gbogbo àwọn ilé-ìkàwé tó ti wà tẹ́lẹ̀ rẹ́ kí á má baà ba àwọn ojúlé àwọn ènìyàn jẹ́. Síbẹ̀síbẹ̀, nítorí ọ̀pọ̀lọpọ̀ ìdí (èyí tí a ó ṣàlàyé ní ìsàlẹ̀) a kò gba èyíkéyìí <strong>tuntun</strong>. Èyí kò níṣe pẹ̀lú dídára tàbí ète koodu rẹ. Ọ̀pọ̀ nínú wa nínú ẹgbẹ́ náà jẹ́ olólùfẹ́ àwọn ilé-ìkàwé àti àwọn ìlapa. <strong>Ìdí tí a kò fi gba irú àwọn plugin wọ̀nyí</strong> Láti ṣàlàyé àwọn ọ̀rọ̀ ìtumọ̀ níbí: - <strong>Ìlapa/Àpẹẹrẹ:</strong> àpẹẹrẹ kan láti inú èyí tí a lè kọ́ koodu síwájú sí i - <strong>Ilé-ìkàwé:</strong> nílò àwọn plugin tàbí àwọn àkòrí mìíràn láti ṣe àtúnṣe ara wọn kí á tó lè lò wọ́n A nílò pé kí àwọn plugin wúlò fúnra wọn (kódà bí ó bá jẹ́ pé ọ̀nà sí iṣẹ́ ìta nìkan ni). Èyí túmọ̀ sí pé plugin kan yẹ kí ó jẹ́ èyí tí a fi sílẹ̀ kí ó sì ṣiṣẹ́ ní kíkún, tàbí kí ó ní àjọ̀ ìṣàkóso kan. https://make.wordpress.org/plugins/2016/03/01/please-do-not-submit-frameworks/ Nígbà tí plugin kan bá nílò yálà kí a ṣe àtúnṣe plugin náà fúnra rẹ̀ kí ó tó ṣiṣẹ́, tàbí tí a lè lò ó nìkan nípa kíkọ koodu sí ibòmíràn, ó πάwọ́ láti ní àǹfààní tó pọ̀ tó bẹ́ẹ̀ fún àwọn olùṣamúlò ìkẹyìn, ó sì dàbí irinṣẹ́ olùgbéejáde síwájú sí i. Bí ó tilẹ̀ jẹ́ pé ọ̀pọ̀lọpọ̀ àǹfààní wà fún àwọn ìlapa àti àwọn ilé-ìkàwé, WordPress kò ní àtìlẹ́yìn ìgbáradì plugin kankan lásìkò yìí, èyí sì n fa ọ̀pọ̀lọpọ̀ ọ̀ràn. Ìtòlẹ́sẹẹsẹ àwọn ọ̀ràn àtìlẹ́yìn tí ó ṣeé ṣe kan (ṣùgbọ́n kò ní ààlà sí): - àìdámọ̀ àìní fún ilé-ìkàwé tàbí ríronú pé a ti gbégun tì wọ́n - àìṣe àtúnpín àpẹẹrẹ náà dáradára àti ṣíṣe àtúnṣe rẹ̀ níbẹ̀, èyí tó n yọrí sí àwọn ìgbàgbọ́hùn tí wọ́n n pa koodu rẹ́ - àìdámọ̀ àìní fún plugin ilé-ìkàwé, àti nítorí náà pípa á rẹ́ (tó n fa kí àwọn mìíràn bàjẹ́) - ṣíṣe àtúnṣe plugin ilé-ìkàwé lọ́tọ̀ọ̀tọ̀ sí àwọn plugin tó gbára lé e, tó n yọrí sí ìbàjẹ́ - ṣíṣe àtúnṣe plugin tó gbára lé e láìṣe àtúnṣe ilé-ìkàwé, tó n yọrí sí ìbàjẹ́ - àwọn plugin ọ̀tọ̀ọ̀tọ̀ tí wọ́n n nílò àwọn ẹ̀yà ọ̀tọ̀ọ̀tọ̀ ti plugin ilé-ìkàwé kan láìsí àyẹ̀wò if-exists tó tọ́ - A rò pé ó yẹ kí a ṣàkópọ̀ àwọn ilé-ìkàwé pẹ̀lú plugin kọ̀ọ̀kan (ní ìrètí ní ọ̀nà tí kò ní tako àwọn plugin mìíràn tí wọ́n n lo àwọn ilé-ìkàwé náà). Ó kéré tán títí di ìgbà tí kókó bá ti ní àtìlẹ́yìn fún àwọn ìgbáradì plugin. Àwọn ìlapa, fúnra wọn, kò ní ààyè nínú ìwé àkójọ wa nítorí pé wọ́n jẹ́ àwọn àpẹẹrẹ tí kò ṣiṣẹ́. Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o má ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.Lákòókò yìí, a kò gba àwọn plugin irúfẹ́ yìí. Bí ó tilẹ̀ jẹ́ pé ìwé àkójọ náà wà ní ṣíṣí sílẹ̀ fún gbogbo àwọn plugin tó lágbára, tó bá GPLv2 (tàbí ti ìgbà tó tẹ̀le) mu, a ní ẹ̀tọ́ láti kọ plugin èyíkéyìí lórí ìdí èyíkéyìí tí a bá rò pé ó tọ̀nà, yálà a mẹ́nu bà á ní pàtó nínú àwọn ìlànà tàbí bẹ́ẹ̀ kọ́. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ, a sì rọ̀ ọ́ pé kí o ka lẹ́tà sọ̀nrọ̀sọ̀ yìí lẹ́kùn-únrẹ́rẹ́. Tí ó bá jẹ́ pé ní ìparí, o rò pé àṣìṣe ni ìpinnu yìí, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ìdí tí o fi rò pé ó yẹ kí a gba plugin rẹ. <strong>Ìdí tí a kò fi gba irú àwọn plugin wọ̀nyí</strong> A kò ní gba àwọn plugin tí wọ́n n ṣe àfarawé àwọn àṣàyàn tí ó ti wà nínú WordPress tẹ́lẹ̀, láìsí àfikún kankan tí ó hàn gbangba, bíi (ṣùgbọ́n kò ní ààlà sí) àtúnpò àwọn koodu kúkúrú tó ti wà tẹ́lẹ̀ ( [embed] àti [gallery] ), àwọn widget (àfihàn ìjẹun rss), tàbí iṣẹ́ ṣíṣe (fífikún àwọn olùṣamúlò). A kò gba àwọn plugin tí a rò pé kò tọ̀nà níwà, bíi SEO àṣehàn dúdú tàbí eérú (pẹ̀lú àwọn plugin tí wọ́n n fi àkóónú sílẹ̀ ládàáṣiṣẹ́). A ó kọ plugin èyíkéyìí tó jẹmọ́ àwọn ìkéde bíi 'Plugin wa yóò ràn ọ́ lọ́wọ́ láti jèrè ẹgbẹẹgbẹ̀rún dọ́là', nítorí pé ìwà yẹn burúkú a kò sì fẹ́ ẹ. A kò tún gba àwọn plugin 'ìtúmọ̀', tàbí àwọn ẹ̀dà àwọn plugin tí ó wà ní èdè mìíràn, nítorí pé ó dára jùlọ láti bá plugin àkọ́kọ́ sọ̀rọ̀ fún ìyẹn. Jọ̀wọ́ kàn sí wọn kí o sì pèsè ìtúmọ̀ dáradára. A kò ní gba àwọn plugin pẹ̀lú koodu tí a fi pamọ́ (f.a. tí a fi pamọ́ tàbí tí a fi koodu pa á) rárá. Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o má ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.A ti kọ plugin rẹ nítorí pé a kò gba àwọn plugin ojú ilé ìtajà lọ́wọ́lọ́wọ́. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ níbí. Ìpinnu yìí kò níṣe pẹ̀lú dídára tàbí ète koodu rẹ, ó sì jẹmọ́ pátápátá sí òtítọ́ náà pé, ní ti tòótọ́, ojú ilé ìtajà ni. A gbà ọ́ nímọ̀ràn láti gbàlejò èyí lórí iṣẹ́ tirẹ̀, kí o sì lo àwọn ìgbàgbọ́hùn tí o darí fúnra rẹ fún àtìlẹ́yìn àti ìtọ́jú rẹ tó n lọ lọ́wọ́. Tí o bá rò pé àṣìṣe ni èyí, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ìdí tí o fi rò pé ó yẹ kí a gbàlejò plugin rẹ níbí. Kí o tó ṣe bẹ́ẹ̀, a rọ̀ ọ́ láti lo àkókò láti ka lẹ́tà sọ̀nrọ̀sọ̀ yìí lẹ́kùn-únrẹ́rẹ́. <strong>Ìdí tí a kò fi gba irú àwọn plugin wọ̀nyí</strong> A kò gba àwọn plugin tí wọ́n n ṣiṣẹ́ láti fi àwọn plugin àti àwọn àkòrí sílẹ̀ láti ibòmíràn yàtọ̀ sí WordPress.org nítorí àbò àti ìdàrújẹ olùṣamúlò. Ní ìtàn, wọ́n ti yọrí sí àwọn olùṣamúlò tí kò mọ ibi tí wọ́n ti gba plugin kan, àti ibi tí ó yẹ kí wọ́n lọ fún ìrànlọ́wọ́. Ní àfikún, tí a bá ti ìgbàgbọ́hùn búburú kan jáde, a rí WordPress bíi ẹni tí ó jẹ́ onídùúró fún àbájáde búburú èyíkéyìí. Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o má ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.Lákòókò yìí, a kò gba plugin yìí. Bí ó tilẹ̀ jẹ́ pé ìwé àkójọ náà wà ní ṣíṣí sílẹ̀ fún gbogbo àwọn plugin tó lágbára, tó bá GPLv2 (tàbí ti ìgbà tó tẹ̀le) mu, a ní ẹ̀tọ́ láti kọ plugin èyíkéyìí lórí ìdí èyíkéyìí tí a bá rò pé ó tọ̀nà, yálà a mẹ́nu bà á ní pàtó nínú àwọn ìlànà tàbí bẹ́ẹ̀ kọ́. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ, a sì rọ̀ ọ́ pé kí o ka lẹ́tà sọ̀nrọ̀sọ̀ yìí lẹ́kùn-únrẹ́rẹ́. Tí ó bá jẹ́ pé ní ìparí, o rò pé àṣìṣe ni ìpinnu yìí, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ìdí tí o fi rò pé ó yẹ kí a gba plugin rẹ. <strong>Ìdí tí a kò fi gba plugin yìí</strong> Ó dàbí pé Plugin yìí ní ìbáṣepọ̀ kan ní ọ̀nà kan pẹ̀lú òǹkọ̀wé tí a ti fòfin dè tẹ́lẹ̀. Ìwé Àkójọ Plugin wà ní ṣíṣí sílẹ̀ fún gbogbo ẹni tí ó lè àti tí yóò tẹ̀lé àwọn ìlànà. Nígbà tí àwọn ènìyàn bá fi hàn pé wọn kò lè, tàbí wọn kò ní, a kò gbà wọ́n mọ́ nítorí pé àwọn ìgbésẹ̀ wọn ṣe ìpalára fún àwùjọ àti àwọn olùyọ̀ǹda ara ẹni tí wọ́n n tọ́jú rẹ̀. Èyí kan àwọn ènìyàn tí a gbà síṣẹ́ láti ṣojú wọn (f.a. àwọn òṣìṣẹ́, àwọn olùdámọ̀ràn, àti bẹ́ẹ̀ bẹ́ẹ̀ lọ). A kò gba àwọn òǹkọ̀wé tí a fòfin dè láàyè láti gbàlejò koodu wọn lórí WordPress.org mọ́, wọ́n lè gbàlejò koodu wọn nípasẹ̀ àwọn ibòmíràn àti àwọn iṣẹ́. A gbà wọ́n nímọ̀ràn gidigidi láti náwó sí ètò ìṣàmúlò láti ṣàkóso àwọn ìgbàgbọ́hùn ara ẹni. Ọ̀pọ̀lọpọ̀ àṣàyàn wà fún wọn ní ìta ìgbàlejò wa. <strong>Ìgbìyànjú èyíkéyìí láti yẹra fún ìdádúró yìí ni a ó rí bíi ìwà ọ̀tá àmọ̀ọ́mọ̀, yóò sì yọrí sí àwọn ìdíwọ́ síwájú sí i. Má ṣe ṣẹ̀dá àkópamọ́ tuntun, má ṣe gbìyànjú láti yẹra fún ìfòfindè yìí, má ṣe gbìyànjú láti fi ìdánimọ̀ rẹ pamọ́ kí o sì tún un fi sílẹ̀.</strong> Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o má ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.

source: We have rejected this submission because we do not accept submissions that are new or translated versions of existing plugins. <strong>What to do next</strong> We understand the desire to make a plugin work in multiple languages, you should not be submitting this as a new plugin. The correct way to handle this would be to make your plugin translatable, so the multiple languages are handled via our system. Some helpful links for you: - https://translate.wordpress.org/projects/meta/plugins/ - https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/ - https://make.wordpress.org/polyglots/handbook/frequently-asked-questions/#as-a-plugintheme-author-how-can-my-translators-get-validation-rights If, after reading this, you feel we have made this judgement in error, please <strong>reply</strong> to this email and explain why.
yo_ng: A ti kọ ìgbéwọlẹ̀ yìí nítorí pé a kò gba àwọn ìgbéwọlẹ̀ tí ó jẹ́ tuntun tàbí àwọn ẹ̀yà tí a túmọ̀ ti àwọn plugin tó ti wà tẹ́lẹ̀. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ ìfẹ́ láti jẹ́ kí plugin ṣiṣẹ́ ní èdè púpọ̀, kò yẹ kí o máa fi èyí sílẹ̀ bíi plugin tuntun. Ọ̀nà tó tọ́ láti ṣe èyí ni láti jẹ́ kí plugin rẹ ṣeé túmọ̀, kí àwọn èdè púpọ̀ lè ṣeé ṣàkóso nípasẹ̀ ètò wa. Àwọn ìjápọ̀ ìrànlọ́wọ́ díẹ̀ fún ọ: - https://translate.wordpress.org/projects/meta/plugins/ - https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/ - https://make.wordpress.org/polyglots/handbook/frequently-asked-questions/#as-a-plugintheme-author-how-can-my-translators-get-validation-rights Tí ó bá jẹ́ pé lẹ́yìn kíkà èyí, o rò pé a ti ṣe ìdájọ́ yìí ní àṣìṣe, jọ̀wọ́ <strong>dáhùn</strong> sí lẹ́tà sọ̀nrọ̀sọ̀ yìí kí o sì ṣàlàyé ìdí rẹ̀.

source: We have rejected your plugin submission because this does not appear to be your own, original, work. The WordPress plugin submission form is meant for you to host your own, original, plugins on WordPress.org, not to upload plugins to your own blog. Instead, it looks like you tried to upload an existing plugin as if this was your website. <strong>What to do next</strong> Don't panic! It's okay to make this kind of mistake. However, we cannot fix it for you. You have to upload the code to your site, on your own. The good news is we have some documentation to help you: - https://wordpress.org/support/article/managing-plugins/ - http://www.wpbeginner.com/beginners-guide/step-by-step-guide-to-install-a-wordpress-plugin-for-beginners/ Please <strong>do not</strong> resubmit the plugin, even if you believe we are incorrect. Instead, reply to this email and explain the situation so we can properly direct you forward. If you resubmit this plugin without replying and communicating with us first, your account will be suspended.
yo_ng: A ti kọ ìgbéwọlẹ̀ plugin rẹ nítorí pé èyí kò dàbí iṣẹ́ àpilẹ̀kọ tirẹ̀. Fọ́ọ̀mù ìgbéwọlẹ̀ plugin WordPress jẹ́ fún ọ láti gbàlejò àwọn plugin àpilẹ̀kọ tirẹ̀ lórí WordPress.org, kì í ṣe láti gbé àwọn plugin sí orí búlọ́ọ̀gì tirẹ̀. Dípò bẹ́ẹ̀, ó dàbí pé o gbìyànjú láti gbé plugin tó ti wà tẹ́lẹ̀ sí ayélujára bíi pé ojúlé rẹ ni èyí. <strong>Ohun tó yẹ kí o ṣe</strong> Má paníyà! Ó dára láti ṣe irú àṣìṣe yìí. Síbẹ̀síbẹ̀, a kò lè ṣatúnṣe rẹ̀ fún ọ. O ní láti gbé koodu náà sí orí ojúlé rẹ, fúnra rẹ. Ìròyìn ayọ̀ ni pé a ní àwọn àkọsílẹ̀ díẹ̀ láti ràn ọ́ lọ́wọ́: - https://wordpress.org/support/article/managing-plugins/ - http://www.wpbeginner.com/beginners-guide/step-by-step-guide-to-install-a-wordpress-plugin-for-beginners/ Jọ̀wọ́ <strong>má ṣe</strong> tún plugin náà fi sílẹ̀, kódà tí o bá gbàgbọ́ pé a ṣàṣìṣe. Dípò bẹ́ẹ̀, dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí kí o sì ṣàlàyé ipò náà kí á lè tọ́ ọ síwájú dáradára. Tí o bá tún plugin yìí fi sílẹ̀ láìdáhùn àti láìbá wa sọ̀rọ̀ ní àkọ́kọ́, a ó dá àkópamọ́ rẹ dúró.

source: We have rejected this submission because we do not accept submissions that are new or renamed versions of existing plugins. <strong>What to do next</strong> We understand the desire to rename or rebrand a plugin however there are serious logistical issues involved. 1. Read this entire email. There is a lot of information, however it is all important. 2. If, after reading this email, you feel your plugin rename should be allowed, please reply to this email and explain your situation. Under <strong>no</strong> circumstances should you resubmit the plugin with the new name. If your situation is approved, we will give you explicit directions on how to proceed. Please do not try to jump ahead. We need you to follow the directions carefully. <strong>If you DID NOT mean to rename…</strong> There is always a possibility you weren't trying to rename, and instead wanted to update your existing plugin. If that's the case, then you can ignore the rest of this email and instead just go ahead and update your plugin using Subversion (AKA SVN) https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/ We don't have the ability to do this for you, so you will have to re-learn SVN if you've forgotten <strong>Why Renames Are Problematic</strong> It's important you understand that we do not have the technical ability to rename plugin URLs once they've been approved. That's why, since 2017, we have made every reasonable effort to inform developers as to their plugin permalink before the review. This means the only way to enact something like a rename would be to close your plugin and have you submit a new one. There are significant costs in doing this: - Visitors will see your plugin is closed "by author request" and cannot be redirected to the new plugin. - All existing links will point to the closed plugin. You will not have access to update ones outside your control, harming your SEO. - Existing users cannot be automatically updated to the new plugin - the more users you have, the worse this will be. - Users will leave angry 1-star reviews, feeling they've been abused/abandoned, and those reviews will not be removed. - In addition, by asking for a re-submission of an existing plugin your account would be flagged in our system and all future requests will be refused. This would be your one and only chance to rename something. Due to those reasons, we recommend you instead change the plugin Display Name. The majority of users do not care what your permalink is, if they even notice. We do not require your plugin display name match your plugin permalink, so it would be perfectly acceptable to have the permalink 'jumprabbit-apis' but the display name "Everyone Loves APIs." <strong>Accepted Reasons for renames</strong> Of course there are some perfectly valid reasons to ask for a rename, they include but are not limited to: - Trademark owners have come to light and demanded you change the permalink - There is an egregious misspelling in your permalink that fundamentally changes the nature of the plugin - A vulgarity exists in your plugin permalink - Previously unknown legal issues require the change - If your plugin does not meet any of those reasons, then you will have to explain why you should be an exception to policy. If, after reading this, you've decided you don't want to rename the permalink, you don't have to reply to this email. It's fine to just go back to your existing plugin and update it. On the other hand, if you do think your plugin should be renmamed, please reply to this email and explain your situation. Again, <strong>do not</strong> resubmit this plugin. Doing so will result in your account being suspended until you do talk to us about this.
yo_ng: A ti kọ ìgbéwọlẹ̀ yìí nítorí pé a kò gba àwọn ìgbéwọlẹ̀ tí ó jẹ́ tuntun tàbí àwọn ẹ̀yà tí a tún sọ lórúkọ ti àwọn plugin tó ti wà tẹ́lẹ̀. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ ìfẹ́ láti tún plugin sọ lórúkọ tàbí láti tún un ṣe, ṣùgbọ́n àwọn ọ̀ràn ìṣètò tó ṣe pàtàkì wà níbẹ̀. 1. Ka gbogbo lẹ́tà sọ̀nrọ̀sọ̀ yìí. Ọ̀pọ̀lọpọ̀ ìwífún wà níbẹ̀, ṣùgbọ́n gbogbo wọn ṣe pàtàkì. 2. Tí ó bá jẹ́ pé lẹ́yìn kíkà lẹ́tà sọ̀nrọ̀sọ̀ yìí, o rò pé ó yẹ kí a gba àtúnsọlórúkọ plugin rẹ láàyè, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí kí o sì ṣàlàyé ipò rẹ. Lábẹ́ ipò <strong>kankan</strong> kò yẹ kí o tún plugin náà fi sílẹ̀ pẹ̀lú orúkọ tuntun. Tí a bá fọwọ́sí ipò rẹ, a ó fún ọ ní àwọn ìtọ́nisọ́nà pàtó lórí bí o ṣe lè tẹ̀síwájú. Jọ̀wọ́ má ṣe gbìyànjú láti fò kọjá. A nílò kí o tẹ̀lé àwọn ìtọ́nisọ́nà náà dáradára. <strong>Tí o kò bá ní èrò láti tún un sọ lórúkọ…</strong> Ó ṣeé ṣe nígbà gbogbo pé o kò gbìyànjú láti tún un sọ lórúkọ, àti pé dípò bẹ́ẹ̀ o fẹ́ ṣe àtúnṣe plugin rẹ tó ti wà tẹ́lẹ̀. Tí ó bá rí bẹ́ẹ̀, nígbà náà o lè fojú fo ìyókù lẹ́tà sọ̀nrọ̀sọ̀ yìí kí o sì kàn tẹ̀síwájú láti ṣe àtúnṣe plugin rẹ nípa lílo Subversion (AKA SVN) https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/ A kò ní agbára láti ṣe èyí fún ọ, nítorí náà o ní láti tún kọ́ SVN tí o bá ti gbàgbé <strong>Ìdí Tí Àwọn Àtúnsọlórúkọ Fi Jẹ́ Ìṣòro</strong> Ó ṣe pàtàkì pé kí o mọ̀ pé a kò ní agbára ìmọ̀-ẹ̀rọ láti tún àwọn URL plugin sọ lórúkọ lẹ́yìn tí a bá ti fọwọ́sí wọn. Ìdí nìyẹn, láti ọdún 2017, a ti ṣe gbogbo ìsapá tó tọ́ láti sọ fún àwọn olùgbéejáde nípa ìjápọ̀ ayérayé plugin wọn kí á tó ṣe àgbéyẹ̀wò. Èyí túmọ̀ sí pé ọ̀nà kan ṣoṣo láti ṣe nǹkan bíi àtúnsọlórúkọ ni láti ti plugin rẹ kí o sì fi tuntun sílẹ̀. Àwọn owó pàtàkì wà nínú ṣíṣe èyí: - Àwọn àlejò yóò rí i pé a ti ti plugin rẹ "nípasẹ̀ ìbéèrè òǹkọ̀wé" a kò sì lè darí wọn sí plugin tuntun. - Gbogbo àwọn ìjápọ̀ tó ti wà tẹ́lẹ̀ yóò tọ́ka sí plugin tí a ti tì. O kò ní ní àṣẹ láti ṣe àtúnṣe àwọn tí kò sí lábẹ́ ìṣàkóso rẹ, èyí yóò sì pa SEO rẹ lára. - A kò lè ṣe àtúnṣe àwọn olùṣamúlò tó ti wà tẹ́lẹ̀ sí plugin tuntun ládàáṣiṣẹ́ - bí àwọn olùṣamúlò rẹ bá ṣe pọ̀ tó, bẹ́ẹ̀ ni èyí yóò ṣe burú tó. - Àwọn olùṣamúlò yóò fi àwọn àgbéyẹ̀wò ìràwọ̀ 1 sílẹ̀ pẹ̀lú ìbínú, wọ́n á rò pé a ti lò wọ́n ní ìlòkulò/a ti kọ̀ wọ́n sílẹ̀, a kò sì ní yọ àwọn àgbéyẹ̀wò wọ̀nyẹn kúrò. - Ní àfikún, nípa bíbéèrè fún àtúntò plugin tó ti wà tẹ́lẹ̀, a ó sàmì sí àkópamọ́ rẹ nínú ètò wa, a ó sì kọ gbogbo àwọn ìbéèrè ọjọ́ iwájú. Èyí yóò jẹ́ ànfàní kan ṣoṣo rẹ láti tún nǹkan kan sọ lórúkọ. Nítorí àwọn ìdí wọ̀nyẹn, a gbà ọ́ nímọ̀ràn láti yí Orúkọ Àfihàn plugin padà dípò. Ọ̀pọ̀ jùlọ àwọn olùṣamúlò kò bìkítà nípa ìjápọ̀ ayérayé rẹ, tí wọ́n bá tilẹ̀ kíyèsí i. A kò nílò kí orúkọ àfihàn plugin rẹ bá ìjápọ̀ ayérayé plugin rẹ mu, nítorí náà yóò jẹ́ ìtẹ́wọ́gbà pátápátá láti ní ìjápọ̀ ayérayé 'jumprabbit-apis' ṣùgbọ́n kí orúkọ àfihàn jẹ́ "Gbogbo Ènìyàn Fẹ́ràn APIs." <strong>Àwọn Ìdí Tí A Fi Gba Àtúnsọlórúkọ</strong> Dájúdájú, àwọn ìdí kan tó tọ̀nà pátápátá wà láti béèrè fún àtúnsọlórúkọ, wọ́n kan ṣùgbọ́n wọn kò ní ààlà sí: - Àwọn oní-àmì ìṣòwò ti fara hàn, wọ́n sì ti ní kí o yí ìjápọ̀ ayérayé padà - Àṣìṣe àkọtọ́ ńlá wà nínú ìjápọ̀ ayérayé rẹ tó yí ìrísí plugin náà padà pátápátá - Ọ̀rọ̀ àìdára wà nínú ìjápọ̀ ayérayé plugin rẹ - Àwọn ọ̀ràn òfin tí a kò mọ̀ tẹ́lẹ̀ nílò àyípadà náà - Tí plugin rẹ kò bá bá èyíkéyìí nínú àwọn ìdí wọ̀nyẹn mu, nígbà náà o ní láti ṣàlàyé ìdí tí ó fi yẹ kí o jẹ́ àyàfi sí ìlànà. Tí ó bá jẹ́ pé lẹ́yìn kíkà èyí, o ti pinnu pé o kò fẹ́ tún ìjápọ̀ ayérayé sọ lórúkọ, o kò ní láti dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí. Ó dára láti kàn padà sí plugin rẹ tó ti wà tẹ́lẹ̀ kí o sì ṣe àtúnṣe rẹ̀. Ní ọwọ́ kejì ẹ̀wẹ̀, tí o bá rò pé ó yẹ kí a tún plugin rẹ sọ lórúkọ, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí kí o sì ṣàlàyé ipò rẹ. Lẹ́ẹ̀kansíi, <strong>má ṣe</strong> tún plugin yìí fi sílẹ̀. Ṣíṣe bẹ́ẹ̀ yóò yọrí sí dídá àkópamọ́ rẹ dúró títí tí o ó fi bá wa sọ̀rọ̀ nípa èyí.

source: Your plugin has been rejected because it is a duplicate of another plugin, already hosted on WordPress.org Despite the fact that all plugins in our directory are licensed under the GPL or compatible licenses, we do not allow direct copies of other plugins to be re-listed under somebody else's name. "Forking" is acceptable only when the resulting fork is of a substantial nature, or when the original plugin is no longer updated or supported. When this is not the case, the plugin is rejected. <strong>What to do next</strong> We know it can be hurtful to be told we will not host your code, and we ask you consider the following options: - contribute back to the original plugin and improve it - create an add-on to the existing plugin - contribute a translation via the polyglots team - https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/ - If you feel this rejection was in error, please <strong>reply to this email</strong> with a copy of your code attached and let us know. We will re-review your code and proceed from there. Remember, <strong>do not</strong> resubmit the plugin. If you resubmit the plugin without replying to this email, your account will be suspended.
yo_ng: A ti kọ plugin rẹ nítorí pé ó jẹ́ ẹ̀dà plugin mìíràn, tí a ti gbàlejò tẹ́lẹ̀ lórí WordPress.org Láìka òtítọ́ náà sí pé gbogbo àwọn plugin nínú ìwé àkójọ wa ni a fún ní ìwé-àṣẹ lábẹ́ GPL tàbí àwọn ìwé-àṣẹ tó bá a mu, a kò gba àwọn ẹ̀dà tààrà ti àwọn plugin mìíràn láàyè láti tún ṣe àtòjọ wọn lábẹ́ orúkọ ẹlòmíràn. "Forking" jẹ́ ìtẹ́wọ́gbà nìkan nígbà tí àbájáde fork náà bá jẹ́ ti irúfẹ́ pàtàkì, tàbí nígbà tí a kò bá ṣe àtúnṣe tàbí àtìlẹ́yìn fún plugin àkọ́kọ́ mọ́. Nígbà tí èyí kò bá rí bẹ́ẹ̀, a máa ń kọ plugin náà. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó lè dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ, a sì rọ̀ ọ́ pé kí o ronú nípa àwọn àṣàyàn wọ̀nyí: - ṣe ìkópa padà sí plugin àkọ́kọ́ kí o sì mú un dára sí i - ṣẹ̀dá àfikún sí plugin tó ti wà tẹ́lẹ̀ - ṣe ìkópa ìtúmọ̀ nípasẹ̀ ẹgbẹ́ polyglots - https://make.wordpress.org/polyglots/handbook/rosetta/theme-plugin-directories/ - Tí o bá rò pé àṣìṣe ni ìkọ̀sílẹ̀ yìí, jọ̀wọ́ <strong>dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí</strong> pẹ̀lú ẹ̀dà koodu rẹ tí a so mọ́ kí o sì jẹ́ kí á mọ̀. A ó tún ṣe àgbéyẹ̀wò koodu rẹ kí á sì tẹ̀síwájú láti ibẹ̀. Rántí, <strong>má ṣe</strong> tún plugin náà fi sílẹ̀. Tí o bá tún plugin náà fi sílẹ̀ láìdáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí, a ó dá àkópamọ́ rẹ dúró.
