Repository: w3techy/WordPress-YR
Catalog: meta-plugins-v3-yor.po
Languages: yo_ng

source: Plugin Check
yo_ng: Àyẹ̀wò Plugin

source: Trademarked terms
yo_ng: Àwọn ọ̀rọ̀ tí a fi àmì ìṣòwò sí

source: This tool allows the generation of a one-time-use token to allow a plugin author to upload a plugin bypassing certain checks.
yo_ng: Irinsẹ́ yìí gba ṣíṣẹ̀dá àmì ìdánimọ̀ lílo-lẹ́ẹ̀kanṣoṣo láàyè láti gba òǹkọ̀wé plugin láàyè láti gbé plugin sí ayélujára nípa yíyẹra fún àwọn àyẹ̀wò kan.

source: Upload Token
yo_ng: Àmì Ìdánimọ̀ Ìgbéwọlẹ̀

source: Plugin Tools
yo_ng: Àwọn Irinsẹ́ Plugin

source: A note from the Plugin Review team, visible only to the plugin author &amp; committers.
yo_ng: Àkíyèsí láti ọ̀dọ̀ ẹgbẹ́ Àgbéyẹ̀wò Plugin, tí ó hàn sí òǹkọ̀wé plugin &amp; àwọn olùfìṣọwọ́sí nìkan.

source: Last edited by %s <time title="%s">%s ago</a>
yo_ng: Àtúnṣe tó kẹ́yìn láti ọwọ́ %s <time title="%s">%s sẹ́yìn</a>

source: Error
yo_ng: Àṣìṣe

source: Warning
yo_ng: Ìkìlọ̀

source: Info / Notice
yo_ng: Ìwífún / Ìfitónilétí

source: Notice types
yo_ng: Àwọn irúfẹ́ ìfitónilétí

source: Do not show
yo_ng: Má ṣe fi hàn

source: Author Notice (Displayed on the plugins page to Plugin Authors)
yo_ng: Ìfitónilétí Òǹkọ̀wé (Tí a fi hàn ní ojú ìwé àwọn plugin sí Àwọn Òǹkọ̀wé Plugin)

source: Plugin Commits
yo_ng: Àwọn Ìtẹ́wọ́gbà Plugin

source: Optional. The URL for plugin support, other than its support forum on wordpress.org.
yo_ng: Àṣàyàn. URL fún ìrànlọ́wọ́ plugin, yàtọ̀ sí àpéjọ ìrànlọ́wọ́ rẹ̀ lórí wordpress.org.

source: Commercial support URL
yo_ng: URL ìrànlọ́wọ́ ìṣòwò

source: This plugin is free but offers paid upgrades, support, and/or add-ons.
yo_ng: Plugin yìí jẹ́ ọ̀fẹ́ ṣùgbọ́n ó n pèsè àwọn ìgbàgbọ́hùn tí a sanwó fún, ìrànlọ́wọ́, àti/tàbí àwọn àfikún.

source: Commercial Options
yo_ng: Àwọn Àṣàyàn Ìṣòwò

source: Saved!
yo_ng: Ti fipamọ́!

source: Save
yo_ng: Fipamọ́

source: Optional. The URL where development happens, such as at github.com.
yo_ng: Àṣàyàn. URL níbi tí ìdàgbàsókè ti n ṣẹlẹ̀, bíi ní github.com.

source: Development repository URL
yo_ng: URL ibi ìpamọ́ ìdàgbàsókè

source: Community Options
yo_ng: Àwọn Àṣàyàn Àwùjọ

source: This plugin is developed and supported by a community.
yo_ng: Àwùjọ ni ó ṣe ìdàgbàsókè àti àtìlẹ́yìn fún plugin yìí.

source: Community plugins
yo_ng: Àwọn plugin àwùjọ

source: This plugin is free but offers additional paid commercial upgrades or support.
yo_ng: Plugin yìí jẹ́ ọ̀fẹ́ ṣùgbọ́n ó n pèsè àwọn ìgbàgbọ́hùn ìṣòwò tí a sanwó fún tàbí ìrànlọ́wọ́ àfikún.

source: Commercial plugins
yo_ng: Àwọn plugin ìṣòwò

source: Displays plugin categorization information.
yo_ng: Ṣe àfihàn ìwífún ìpín sí ọ̀wọ́ plugin.

source: Plugin Categorization
yo_ng: Ìpín sí Ọ̀wọ́ Plugin

source: %s reply
yo_ng: %s ìdáhùn

source: Howdy %1$s, %2$s has enabled release confirmations for the following plugin: %3$s %4$s A new email will be sent to all committers when a new pending release exists for %5$s with a link to the Release Management dashboard. You, or another committer to the plugin, will be required to confirm the release on that dashboard before WordPress.org processes the newly committed plugin update. For more information, please read the following handbook article: %6$s
yo_ng: Báwo ni %1$s, %2$s ti tan àwọn ìfìdíìmúlẹ̀ ìtújáde fún plugin wọ̀nyí: %3$s %4$s A ó fi lẹ́tà sọ̀nrọ̀sọ̀ tuntun ránṣẹ́ sí gbogbo àwọn olùfìṣọwọ́sí nígbà tí ìtújáde ndúródé tuntun bá wà fún %5$s pẹ̀lú ìjápọ̀ sí ojú ìwé ìṣàkóso Ìtújáde. Ìwọ, tàbí olùfìṣọwọ́sí mìíràn sí plugin náà, yóò ní láti fìdí ìtújáde náà múlẹ̀ lórí ojú ìwé ìṣàkóso yẹn kí WordPress.org tó ṣe àtúnṣe ìgbàgbọ́hùn plugin tí a ti tẹ́wọ́gbà tuntun. Fún ìwífún síwájú sí i, jọ̀wọ́ ka àpilẹ̀kọ ìwé ìtọ́nisọ́nà wọ̀nyí: %6$s

source: README Error: The plugin has already been submitted.
yo_ng: Àṣìṣe README: A ti fi plugin náà sílẹ̀ tẹ́lẹ̀.

source: We&rsquo;ve sent you an email verifying this submission. Make sure you set all emails from wordpress.org to never go to spam (i.e. via email filters or approval lists). That will ensure you won&rsquo;t miss any of our messages.
yo_ng: A ti fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí ọ láti fìdí ìgbéwọlẹ̀ yìí múlẹ̀. Ríi dájú pé o ṣètò gbogbo àwọn lẹ́tà sọ̀nrọ̀sọ̀ láti wordpress.org kí wọ́n má ṣe lọ sí abẹ́ ìwé àìfẹ́ (f.a. nípasẹ̀ àwọn asẹ́ lẹ́tà sọ̀nrọ̀sọ̀ tàbí àwọn àkójọpọ̀ ìfọwọ́sí). Èyí yóò ríi dájú pé o kò ní pàdánù ìránṣẹ́ wa kankan.

source: Sorry, you cannot remove the owner of the plugin as a committer.
yo_ng: Má bínú, o kò lè yọ oní-plugin kúrò gẹ́gẹ́ bíi olùfìṣọwọ́sí.

source: Management of this plugin has been limited for security reasons. Please contact the plugins team for assistance to add/remove committers, or to perform other actions that are unavailable.
yo_ng: A ti fi ààlà sí ìṣàkóso plugin yìí fún àwọn ìdí àbò. Jọ̀wọ́ kàn sí ẹgbẹ́ àwọn plugin fún ìrànlọ́wọ́ láti fi kún/yọ àwọn olùfìṣọwọ́sí, tàbí láti ṣe àwọn ìgbésẹ̀ mìíràn tí kò sí.

source: Help Scout Queue Stats
yo_ng: Àwọn ìṣirò Ìtòlọ́wọ̀ọ̀wọ́ Help Scout

source: Plugin Repository and email Stats Report
yo_ng: Ìròyìn Àwọn ìṣirò Ibi Ìpamọ́ Plugin àti Lẹ́tà Sọ̀nrọ̀sọ̀

source: Plugins are rejected after three months (90 days) when there has not been significant progress made on the review. If this is not the case for your plugin, you will receive a followup email explaining the reason for this decision within the next 24 hours. Please wait for that email before requesting further details. If you believe this to be in error, please email us with your plugin attached as a zip and explain why you feel your plugin should not have been rejected. If you're still working on your code, don't panic. You can reply to the original review (or even this email) with your updated code for as long as needed. Even years. All we ask is you do not resubmit your plugin until asked to do so.
yo_ng: A máa ń kọ àwọn plugin lẹ́yìn oṣù mẹ́ta (ọjọ́ 90) nígbà tí kò bá sí ìlọsíwájú pàtàkì lórí àgbéyẹ̀wò. Tí èyí kò bá rí bẹ́ẹ̀ fún plugin rẹ, o ó gba lẹ́tà sọ̀nrọ̀sọ̀ àtẹ̀lé tí yóò ṣàlàyé ìdí fún ìpinnu yìí láàrin wákàtí mẹ́rìnlélógún tó ń bọ̀. Jọ̀wọ́ dúró de lẹ́tà sọ̀nrọ̀sọ̀ náà kí o tó béèrè fún àlàyé síwájú sí i. Tí o bá gbàgbọ́ pé àṣìṣe ni èyí, jọ̀wọ́ fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí wa pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ìdí tí o fi rò pé kò yẹ kí a kọ plugin rẹ. Tí o bá ṣì n ṣiṣẹ́ lórí koodu rẹ, má paníyà. O lè dáhùn sí àgbéyẹ̀wò àkọ́kọ́ (tàbí lẹ́tà sọ̀nrọ̀sọ̀ yìí pàápàá) pẹ̀lú koodu rẹ tí a ti ṣe àtúnṣe fún ìgbàkúgbà tó bá pẹ́ tó. Àní ọdún mélòó kan. Gbogbo ohun tí a béèrè ni pé kí o má ṣe tún plugin rẹ fi sílẹ̀ títí di ìgbà tí a bá ní kí o ṣe bẹ́ẹ̀.

source: block.json[script] At least one of the following properties must be present: %s
yo_ng: block.json[script] Ó kéré tán ọ̀kan nínú àwọn ohun ìní wọ̀nyí gbọ́dọ̀ wà níbẹ̀: %s

source: This plugin, all included libraries, and any other included assets are licenced as GPL or are under a GPL compatible license.
yo_ng: Plugin yìí, gbogbo àwọn ilé-ìkàwé tí ó wà nínú rẹ̀, àti àwọn ohun ìní mìíràn tí ó wà nínú rẹ̀ jẹ́ èyí tí a fún ní ìwé-àṣẹ bíi GPL tàbí lábẹ́ ìwé-àṣẹ tó bá GPL mu.

source: I have permission to upload this plugin to WordPress.org for others to use and share.
yo_ng: Mo ní àṣẹ láti gbé plugin yìí sí ayélujára lórí WordPress.org fún àwọn mìíràn láti lò ó àti láti pín ín.

source: This plugin complies with all of the <a href="%s">Plugin Developer Guidelines</a>.
yo_ng: Plugin yìí tẹ̀lé gbogbo <a href="%s">Àwọn Ìlànà Olùgbéejáde Plugin</a>.

source: I have read the <a href="%s">Frequently Asked Questions</a>.
yo_ng: Mo ti ka <a href="%s">Àwọn Ìbéèrè Tí Wọ́n Máa Ń Béèrè Léraléra</a>.

source: If there are any errors in your submission, such as having submitted via the wrong account, please don't resubmit! Instead, email us as soon as possible (you can reply to the automated email we sent you). We can correct most issues before approval.
yo_ng: Tí àṣìṣe kankan bá wà nínú ìgbéwọlẹ̀ rẹ, bíi fífi sílẹ̀ nípasẹ̀ àkópamọ́ tí kò tọ̀nà, jọ̀wọ́ má ṣe tún un fi sílẹ̀! Dípò bẹ́ẹ̀, fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí wa ní kíákíá bí ó bá ti ṣeé ṣe (o lè dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ aládàáṣiṣẹ́ tí a fi ránṣẹ́ sí ọ). A lè ṣatúnṣe ọ̀pọ̀lọpọ̀ àwọn ọ̀ràn kí á tó fọwọ́sí i.

source: To disable release confirmations, please contact the plugins team by emailing %s.
yo_ng: Láti pa àwọn ìfìdíìmúlẹ̀ ìtújáde, jọ̀wọ́ kàn sí ẹgbẹ́ àwọn plugin nípa fífi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí %s.

source: I understand, please enable release confirmations.
yo_ng: Mo yé mi, jọ̀wọ́ tan àwọn ìfìdíìmúlẹ̀ ìtújáde.

source: Release confirmations currently require tagged releases, as you're releasing from trunk they cannot be enabled.
yo_ng: Àwọn ìfìdíìmúlẹ̀ ìtújáde nílò àwọn ìtújáde tí a fi àmì sí lọ́wọ́lọ́wọ́, bí o ṣe n ṣe ìtújáde láti inú ẹhin igi, a kò lè tan wọ́n.

source: Release confirmations for this plugin are <strong>disabled</strong>
yo_ng: Àwọn ìfìdíìmúlẹ̀ ìtújáde fún plugin yìí ti wà ní <strong>dídílọ́wọ́</strong>

source: Release confirmations for this plugin are <strong>enabled</strong>.
yo_ng: Àwọn ìfìdíìmúlẹ̀ ìtújáde fún plugin yìí ti wà ní <strong>títàn</strong>.

source: Release Confirmation
yo_ng: Ìfìdíìmúlẹ̀ Ìtújáde

source: This plugin has <a href="%s">a pending release that requires confirmation</a>.
yo_ng: Plugin yìí ní <a href="%s">ìtújáde ndúródé tí ó nílò ìfìdíìmúlẹ̀</a>.

source: Pending release for %s
yo_ng: Ìtújáde ndúródé fún %s

source: Release confirmation now required for %s
yo_ng: Ìfìdíìmúlẹ̀ ìtújáde nílò nísinsìnyí fún %s

source: Howdy %1$s, %2$s has been added as a support rep to %3$s by %4$s. The following people are now support representatives for %3$s: %5$s You can manage your plugin support representatives here: %6$s If you believe this to be in error, please contact %7$s.
yo_ng: Báwo ni %1$s, A ti fi %2$s kún bíi olùfìṣọwọ́sí sí %3$s láti ọwọ́ %4$s. Àwọn ènìyàn wọ̀nyí ni wọ́n ní àṣẹ àkọsílẹ̀ sí %3$s nísinsìnyí: %5$s O lè ṣàkóso àwọn olùfìṣọwọ́sí plugin rẹ níbí: %6$s Tí o bá gbàgbọ́ pé àṣìṣe ni èyí, jọ̀wọ́ kàn sí %7$s.Báwo ni %1$s, A ti fi %2$s kún bíi aṣojú ìrànlọ́wọ́ sí %3$s láti ọwọ́ %4$s. Àwọn ènìyàn wọ̀nyí ni wọ́n jẹ́ aṣojú ìrànlọ́wọ́ fún %3$s nísinsìnyí: %5$s O lè ṣàkóso àwọn aṣojú ìrànlọ́wọ́ plugin rẹ níbí: %6$s Tí o bá gbàgbọ́ pé àṣìṣe ni èyí, jọ̀wọ́ kàn sí %7$s.

source: New support rep added to %s
yo_ng: A ti fi aṣojú ìrànlọ́wọ́ tuntun kún %s

source: %s has been transferred
yo_ng: A ti gbé %s

source: %s has been rejected
yo_ng: A ti kọ %s

source: JSON Parser: %s
yo_ng: Olùtúmọ̀ JSON: %s

source: Could not get the contents of the file.
yo_ng: A kò lè gba àwọn àkóónú fáìlì náà.

source: The file could not be read.
yo_ng: A kò lè ka fáìlì náà.

source: File must be named %s!
yo_ng: Orúkọ fáìlì gbọ́dọ̀ jẹ́ %s!

source: URL returned an unexpected status code.
yo_ng: URL dá koodu ipò àìròtẹ́lẹ̀ padà.

source: No valid resource type was given.
yo_ng: A kò fún ni irúfẹ́ ohun èlò tó tọ̀nà.

source: You are the current owner of this plugin. You may transfer those rights to another person at any time, provided they have commit access to this plugin.
yo_ng: Ìwọ ni oní-plugin yìí lọ́wọ́lọ́wọ́. O lè gbé àwọn ẹ̀tọ́ wọ̀nyẹn fún ẹlòmíràn nígbàkigbà, níwọ̀n ìgbà tí wọ́n bá ní àṣẹ ìtẹ́wọ́gbà sí plugin yìí.

source: Please transfer %s.
yo_ng: Jọ̀wọ́ gbé %s.

source: New Owner
yo_ng: Onílé Tuntun

source: To transfer a plugin, you must first add the new owner as a committer.
yo_ng: Láti gbé plugin kan, o gbọ́dọ̀ kọ́kọ́ fi onílé tuntun kún bíi olùfìṣọwọ́sí.

source: <strong>Warning:</strong> Transferring a plugin is intended to be <em>permanent</em>. There is no way to get plugin ownership back without contacting the plugin team.
yo_ng: <strong>Ìkìlọ̀:</strong> Gbígbé plugin kan jẹ́ èyí tí a fẹ́ kó jẹ́ <em>títí láé</em>. Kò sí ọ̀nà láti gba ohun ìní plugin padà láìkàn sí ẹgbẹ́ plugin.

source: Transfer This Plugin
yo_ng: Gbé Plugin Yìí

source: These features often cannot be undone without intervention. Please do not attempt to use them unless you are absolutely certain. When in doubt, contact the plugins team for assistance.
yo_ng: Àwọn àṣàyàn wọ̀nyí sábà máa ń ṣòro láti pa rẹ́ láìsí ìdásí. Jọ̀wọ́ má ṣe gbìyànjú láti lò wọ́n àyàfi tí o bá dá ọ lójú pátápátá. Nígbà tí o bá n ṣe iyèméjì, kàn sí ẹgbẹ́ àwọn plugin fún ìrànlọ́wọ́.

source: The following features are restricted to plugin committers only. They exist to allow plugin developers more control over their work.
yo_ng: Àwọn àṣàyàn wọ̀nyí jẹ́ fún àwọn olùfìṣọwọ́sí plugin nìkan. Wọ́n wà láti gba àwọn olùgbéejáde plugin láàyè láti ní ìṣàkóso síwájú sí i lórí iṣẹ́ wọn.

source: The Danger Zone
yo_ng: Agbègbè Èwu

source: This section is intended for advanced users and developers only. They are presented here for testing and educational purposes.
yo_ng: Apá yìí jẹ́ fún àwọn olùṣamúlò tó gbọ́gi dáadáa àti àwọn olùgbéejáde nìkan. A fi wọ́n hàn níbí fún ìdánwò àti àwọn ète ẹ̀kọ́.

source: Advanced Options
yo_ng: Àwọn Àṣàyàn Tó Péye

source: <strong>Warning:</strong> Closing a plugin is intended to be a <em>permanent</em> action. There is no way to reopen a plugin without contacting the plugins team.
yo_ng: <strong>Ìkìlọ̀:</strong> Pípa plugin kan jẹ́ ìgbésẹ̀ tí a fẹ́ kó jẹ́ <em>títí láé</em>. Kò sí ọ̀nà láti tún plugin ṣí láìkàn sí ẹgbẹ́ àwọn plugin.

source: <strong>Notice:</strong> Due to the high volume of users for this plugin it cannot be closed without speaking directly to the plugins team. Please contact <a href="mailto:%1$s">%1$s</a> with a link to the plugin and explanation as to why it should be closed.
yo_ng: <strong>Ìfitónilétí:</strong> Nítorí iye àwọn olùṣamúlò fún plugin yìí, a kò lè tì í láìbá ẹgbẹ́ àwọn plugin sọ̀rọ̀ tààrà. Jọ̀wọ́ kàn sí <a href="mailto:%1$s">%1$s</a> pẹ̀lú ìjápọ̀ sí plugin náà àti àlàyé ìdí tí ó fi yẹ kí a tì í.

source: This plugin is currently open. All developers have the ability to close their own plugins at any time.
yo_ng: Plugin yìí wà ní ṣíṣí lọ́wọ́lọ́wọ́. Gbogbo àwọn olùgbéejáde ní agbára láti ti àwọn plugin tiwọn nígbàkigbà.

source: Please select a specific version to download.
yo_ng: Jọ̀wọ́ yan ẹ̀yà kan pàtó láti ṣe ìgbàsílẹ̀.

source: Previous versions of plugins may not be secure or stable. They are not recommended for use on production websites.
yo_ng: Àwọn ẹ̀yà àtijọ́ ti àwọn plugin lè má jẹ́ àbò tàbí ìdúróṣinṣin. A kò gbà wọ́n nímọ̀ràn fún lílò lórí àwọn ojúlé ìṣelọ́pọ̀.

source: I understand, please close %s.
yo_ng: Mo yé mi, jọ̀wọ́ pa %s.

source: Close This Plugin
yo_ng: Pa Plugin Yìí

source: This closure is temporary, pending a full review.
yo_ng: Pípa yìí jẹ́ fún ìgbà díẹ̀, ní ndúródé fún àgbéyẹ̀wò kíkún.

source: This closure is permanent.
yo_ng: Pípa yìí jẹ́ títí láé.

source: This plugin has been closed as of %s and is not available for download.
yo_ng: A ti ti plugin yìí ní %s, kò sì sí fún ìgbàsílẹ̀.

source: This plugin has been disabled as of %s -- this means it is closed, but actively serving updates.
yo_ng: A ti dí plugin yìí lọ́wọ́ ní %s -- èyí túmọ̀ sí pé a ti tì í, ṣùgbọ́n ó ṣì n pèsè àwọn ìgbàgbọ́hùn lọ́wọ́lọ́wọ́.

source: Certain plugin names are prohibited due to trademark abuse. Similarly, we prevent their use in plugin slugs entirely for your protection.
yo_ng: A ti fi òfin de àwọn orúkọ plugin kan nítorí ìlòkulò àmì ìṣòwò. Bákan náà, a ṣe ìdíwọ́ lílò wọn nínú àwọn slug plugin pátápátá fún ààbò rẹ.

source: Frequently Asked Questions
yo_ng: Àwọn Ìbéèrè Tí Wọ́n Máa Ń Béèrè Léraléra

source: Thank you for uploading %1$s to the WordPress Plugin Directory. Your plugin has been given the initial slug of %2$s, however that is subject to change based on the results of your code review. If this slug is incorrect, please change it below. Remember, a plugin slug cannot be changed once your plugin is approved.
yo_ng: A dúpẹ́ fún gbígbé %1$s sí inú Ìwé Àkójọ Plugin WordPress. A ti fún plugin rẹ ní slug àkọ́kọ́ ti %2$s, ṣùgbọ́n èyí lè yípadà ní ìbámu pẹ̀lú àwọn àbájáde àgbéyẹ̀wò koodu rẹ. Tí slug yìí bá jẹ́ àṣìṣe, jọ̀wọ́ yí i padà ní ìsàlẹ̀. Rántí, a kò lè yí slug plugin padà lẹ́yìn tí a bá ti fọwọ́sí plugin rẹ.

source: Favorites: %s
yo_ng: Àwọn ààyò: %s

# Plugin Section Description
source: Plugins that offer blocks for the block-based editor.
yo_ng: Àwọn plugin tí ó n pèsè àwọn ìdí fún olóòtú orísun ìdí.

source: Sorry, you must have at least one committer.
yo_ng: Má bínú, o gbọ́dọ̀ ní ó kéré tán olùfìṣọwọ́sí kan.

source: Get this plugin
yo_ng: Gba plugin yìí

source: User is blocked/banned and cannot be granted commit.
yo_ng: A ti dí/dẹ́sẹ̀ olùṣamúlò lọ́wọ́ kò sì lè ṣe ìtẹ́wọ́gbà.

source: One or more contributors listed were ignored. The %s field should only contain WordPress.org usernames.
yo_ng: A kò ka ọ̀kan tàbí jù bẹ́ẹ̀ lọ àwọn olùkópa tí a ṣe àtòjọ wọn sí. Ààyè %s yẹ kí ó ní àwọn orúkọ olùṣamúlò WordPress.org nìkan.

source: Reason: %s.
yo_ng: Ìdí: %s.

source: Plugin screenshots.
yo_ng: Àwọn àwòrán ìbòjú Plugin.

source: Plugin rating.
yo_ng: Ìbò Plugin.

source: Plugin icon.
yo_ng: Àmì Plugin.

source: Plugin banner.
yo_ng: Pákó ìpolongo Plugin.

source: If you did not request this change, please contact <a href="mailto:%1$s">%1$s</a> for a status. All developers with commit access are contacted when a plugin is closed, with the reasons why, so check your spam email too.
yo_ng: Tí kì í bá ṣe ìwọ lo béèrè fún àyípadà yìí, jọ̀wọ́ kàn sí <a href="mailto:%1$s">%1$s</a> fún ipò. A máa ń kàn sí gbogbo àwọn olùgbéejáde tí wọ́n ní àṣẹ ìtẹ́wọ́gbà nígbà tí a bá ti plugin kan, pẹ̀lú àwọn ìdí rẹ̀, nítorí náà ṣàyẹ̀wò lẹ́tà sọ̀nrọ̀sọ̀ àìfẹ́ rẹ pẹ̀lú.

source: This plugin is also available in %1$s. <a href="%2$s">Help improve the translation!</a>
yo_ng: Plugin yìí tún wà ní %1$s. <a href="%2$s">Ṣe ìrànlọ́wọ́ láti mú ìtúmọ̀ náà dára sí i!</a>

source: Support Rep
yo_ng: Aṣojú Ìrànlọ́wọ́

source: The minimum version of PHP the plugin needs to run.
yo_ng: Ẹ̀yà PHP tó kéré jùlọ tí plugin nílò láti ṣiṣẹ́.

# Plugin Section Description
source: The below plugins have been marked as favorites.
yo_ng: Àwọn plugin ìsàlẹ̀ wọ̀nyí ni a ti sàmì sí bíi àwọn ààyò.

# Plugin Section Description
source: Beta plugins are in development for possible inclusion in a future version of WordPress.
yo_ng: Àwọn plugin Bétà wà ní ìdàgbàsókè fún ìgbéwọlẹ̀ tí ó ṣeé ṣe nínú ẹ̀yà WordPress ọjọ́ iwájú.

# Plugin Section Description
source: Plugins that have been offered for adoption by others.
yo_ng: Àwọn plugin tí a ti pèsè fún gbígbàṣọmọ láti ọwọ́ àwọn mìíràn.

source: Contributor
yo_ng: Olùkópa

source: Pending Initial Review <span class="count">(%s)</span>
yo_ng: Ndurodè Àgbéyẹ̀wò Àkọ́kọ́ <span class="count">(%s)</span>

# plugin status
source: Pending Initial Review
yo_ng: Ndurodè Àgbéyẹ̀wò Àkọ́kọ́

source: Development Version
yo_ng: Ẹ̀yà Ìdàgbàsókè

source: Previous Versions
yo_ng: Àwọn Ẹ̀yà Àtijọ́

source: Amount of resolved support threads for the plugin.
yo_ng: Iye àwọn okùn ìrànlọ́wọ́ tí a ti yanjú fún plugin.

source: Amount of support threads for the plugin.
yo_ng: Iye àwọn okùn ìrànlọ́wọ́ fún plugin.

source: Fallback color for the plugin.
yo_ng: Àwọ̀ àtìlẹ́yìn fún plugin.

source: Icon images of the plugin.
yo_ng: Àwọn àwòrán àmì ti plugin.

source: Description of the plugin.
yo_ng: Àpèjúwe plugin.

source: URL to the homepage of the author.
yo_ng: URL sí ojúlé àkọ́kọ́ ti òǹkọ̀wé.

source: Name of the plugin author.
yo_ng: Orúkọ òǹkọ̀wé plugin.

source: URL to the homepage of the plugin.
yo_ng: URL sí ojúlé àkọ́kọ́ ti plugin.

source: Name of the plugin.
yo_ng: Orúkọ plugin.

source: Current stable version.
yo_ng: Ẹ̀yà ìdúróṣinṣin lọ́wọ́lọ́wọ́.

source: Link to donate to the plugin.
yo_ng: Ìjápọ̀ láti ṣe ìtọrẹ sí plugin.

source: Stable version of the plugin.
yo_ng: Ẹ̀yà ìdúróṣinṣin ti plugin.

source: The minimum version of WordPress the plugin needs to run.
yo_ng: Ẹ̀yà WordPress tó kéré jùlọ tí plugin nílò láti ṣiṣẹ́.

source: The version of WordPress the plugin was tested with.
yo_ng: Ẹ̀yà WordPress tí a fi dán plugin wò.

source: Number of downloads.
yo_ng: Iye àwọn ìgbàsílẹ̀.

source: Number of installations.
yo_ng: Iye àwọn ìgbéwọlẹ̀.

source: Overall rating of the plugin.
yo_ng: Ìbò àpapọ̀ ti plugin.

source: Unfavorite %s
yo_ng: Yọ %s kúrò nínú ààyò

source: Favorite %s
yo_ng: Fi %s sí ààyò

source: Tested with %s
yo_ng: Dánwò pẹ̀lú %s

source: Repo Plugin
yo_ng: Plugin Ibi Ìpamọ́

source: Repo Plugins
yo_ng: Àwọn Plugin Ibi Ìpamọ́

source: Your plugin must be compatible with the <a href="%s">GNU General Public License v2</a>, or any later version. We strongly recommend using the same license as WordPress — &#8220;GPLv2 or later.&#8221;
yo_ng: Plugin rẹ gbọ́dọ̀ bá <a href="%s">Ìwé-àṣẹ Gbígbogbòò Gbogbogbòò GNU v2</a> mu, tàbí ẹ̀yà èyíkéyìí tó tẹ̀le. A gbà ọ́ nímọ̀ràn gidigidi láti lo ìwé-àṣẹ kan náà bíi ti WordPress — &#8220;GPLv2 tàbí ti ìgbà tó tẹ̀le.&#8221;

source: The operation failed. Please try again.
yo_ng: Iṣẹ́ náà kùnà. Jọ̀wọ́ gbìyànjú lẹ́ẹ̀kansíi.

source: The provided user could not be found.
yo_ng: A kò rí olùṣamúlò tí a pèsè.

source: Committer
yo_ng: Olùfìṣọwọ́sí

source: This plugin is approved and awaiting data upload but not visible to the public yet. Once you make your first commit, the plugin will become public.
yo_ng: A ti fọwọ́sí plugin yìí, ó sì n dúró de gbígbé dátà sí ayélujára ṣùgbọ́n kò tíì hàn sí gbogbo ènìyàn. Lẹ́yìn tí o bá ti ṣe ìtẹ́wọ́gbà àkọ́kọ́ rẹ, plugin náà yóò di ti gbogbo ènìyàn.

source: This plugin is requested and not visible to the public yet. Please be patient as your plugin gets reviewed.
yo_ng: A ti béèrè fún plugin yìí, kò sì tíì hàn sí gbogbo ènìyàn. Jọ̀wọ́ ní sùúrù bí a ṣe n ṣe àgbéyẹ̀wò plugin rẹ.

source: Search Tags
yo_ng: Ṣàwárí Àwọn Àmì

source: New Tag Name
yo_ng: Orúkọ Àmì Tuntun

source: Add New Tag
yo_ng: Fi Àmì Tuntun Kún

source: Update Tag
yo_ng: Ṣe Àtúnṣe Àmì

source: Edit Tag
yo_ng: Ṣe Àtúnṣe Àmì

source: Plugin Tag
yo_ng: Àmì Plugin

source: Plugin Tags
yo_ng: Àwọn Àmì Plugin

source: The plugin directory is also available in %s.
yo_ng: Ìwé àkójọ plugin tún wà ní %s.

source: <a href="%s">Login to WordPress.org</a> to mark plugins as favorites.
yo_ng: <a href="%s">Wọlé sí WordPress.org</a> láti sàmì sí àwọn plugin bíi àwọn ààyò.

source: Your favorite plugins are also shared on <a href="%s">your profile</a>.
yo_ng: Àwọn plugin ààyò rẹ tún wà ní pínpín lórí <a href="%s">prófáìlì rẹ</a>.

source: Find a plugin and mark it as a favorite to see it here.
yo_ng: Wá plugin kan kí o sì sàmì sí i bíi ààyò láti rí i níbí.

source: No favorites have been added, yet.
yo_ng: A kò tíì fi àwọn ààyò kankan kún, síbẹ̀.

source: This plugin is not translated into %1$s yet. <a href="%2$s">Help translate it!</a>
yo_ng: A kò tíì túmọ̀ plugin yìí sí %1$s síbẹ̀. <a href="%2$s">Ṣe ìrànlọ́wọ́ láti túmọ̀ rẹ̀!</a>

# Plugin Section Name
source: My favorites
yo_ng: Àwọn ààyò mi

# Plugin Section Name
source: Adopt me
yo_ng: Gba mí ṣọmọ

source: URL must end in %s!
yo_ng: URL gbọ́dọ̀ parí pẹ̀lú %s!

source: Once your plugin is approved, it <em>cannot</em> be renamed.
yo_ng: Lẹ́yìn tí a bá ti fọwọ́sí plugin rẹ, a <em>kò</em> lè tún un sọ lórúkọ.
