Repository: w3techy/WordPress-YR
Catalog: meta-plugins-v3-yor.po
Languages: yo_ng

source: (advanced view)
yo_ng: (ìwòye tó péye)

source: All future releases will require email confirmation before being made available. This increases security and ensures that plugin releases are only made when intended.
yo_ng: Gbogbo àwọn ìtújáde ọjọ́ iwájú yóò nílò ìfìdíìmúlẹ̀ lẹ́tà sọ̀nrọ̀sọ̀ kí ó tó wà fún ìlò. Èyí mú àbò pọ̀ si àti láti ríi dájú pé àwọn ìtújáde plugin wà nígbà tí a fẹ́.

source: This plugin is currently owned by %s, they can choose to transfer ownership rights of the plugin to you.
yo_ng: %s ni ó ni plugin yìí lọ́wọ́lọ́wọ́, wọ́n lè yàn láti gbé àṣẹ ohun ìní plugin náà fún ọ.

source: Statistics
yo_ng: Àwọn ìṣirò

source: Log in to submit a review.
yo_ng: Wọlé láti fi àgbéyẹ̀wò rẹ sílẹ̀.

source: Log in to WordPress.org
yo_ng: Wọlé sí WordPress.org

source: There are no reviews for this plugin.
yo_ng: Kò sí àwọn àgbéyẹ̀wò fún plugin yìí.

source: This plugin is seeking new, active, developers. Are you interested in assuming that responsibility?
yo_ng: Plugin yìí n wá àwọn olùgbéejáde tuntun, tí wọ́n nífẹ̀ẹ́ sí. Ṣé o nífẹ̀ẹ́ láti gba ojúṣe yẹn?

source: Adopt this plugin
yo_ng: Gba plugin yìí ṣọmọ

source: Displays an adopt me panel.
yo_ng: Ṣe àfihàn àjọ̀ Gba Mí Ṣọmọ.

source: Plugin Adopt Me
yo_ng: Plugin Gba Mí Ṣọmọ

source: Page %1$s of %2$s
yo_ng: Ojú ìwé %1$s ti %2$s

source: Plugins categorized as %s
yo_ng: Àwọn plugin tí a pín sí ọ̀wọ́ bí %s

source: This plugin provides %d block.
yo_ng: Plugin yìí pèsè %d ìdí.

# plugin tab title
source: Blocks
yo_ng: Àwọn ìdí

source: WordPress plugin
yo_ng: Plugin WordPress

source: PHP version
yo_ng: Ẹ̀yà PHP

source: %s or higher
yo_ng: %s tàbí ju bẹ́ẹ̀ lọ

source: WordPress version
yo_ng: Ẹ̀yà WordPress

source: Choose from thousands of free plugins to build, customize, and enhance your WordPress website.
yo_ng: Yan láti inú ẹgbẹẹgbẹ̀rún àwọn plugin ọ̀fẹ́ láti kọ́, ṣe àtúnṣe, àti mú oju opo wẹẹbu WordPress rẹ dára si.

source: Last 7 Days
yo_ng: Ọjọ́ méje tó kọjá

source: Screenshots
yo_ng: Àwọn àwòrán ìbòjú

source: Plugin ratings.
yo_ng: Àwọn ìbò plugin.

source: Unused
yo_ng: Àìlò

# unknown close reason
source: Unknown
yo_ng: Àìmọ̀

source: Merged into Core
yo_ng: Wọ inú Kókó

source: Licensing/Trademark Violation
yo_ng: Ìrúfin ìwé-àṣẹ/Àmì-ìṣòwò

source: Guideline Violation
yo_ng: Ìrúfin ìlànà

source: Author Request
yo_ng: Ìbéèrè òǹkọ̀wé

source: Security Issue
yo_ng: Ọ̀ràn àbò

source: Translate into your language
yo_ng: Túmọ̀ sí èdè rẹ

source: Active installations %s
yo_ng: Àwọn ìgbéwọlẹ̀ tó ṣiṣẹ́ %s

source: %s active installations
yo_ng: %s àwọn ìgbéwọlẹ̀ tó ṣiṣẹ́

source: <a href="%1$s">Browse the code</a>, check out the <a href="%2$s">SVN repository</a>, or subscribe to the <a href="%3$s">development log</a> by <a href="%4$s">RSS</a>.
yo_ng: <a href="%1$s">Ṣàwárí koodu</a>, ṣàyẹ̀wò <a href="%2$s">ibi ìpamọ́ SVN</a>, tàbí ṣe àgbékalẹ̀ sí <a href="%3$s">àkọsílẹ̀ ìdàgbàsókè</a> nípasẹ̀ <a href="%4$s">RSS</a>.

source: Displays support rep information.
yo_ng: Ṣe àfihàn ìwífún aṣojú ìrànlọ́wọ́.

source: Support Reps
yo_ng: Àwọn Aṣojú Ìrànlọ́wọ́

source: Close this popover
yo_ng: Pa agbejade yìí

# languages
source: See all %s
yo_ng: Wo gbogbo %s

source: Languages
yo_ng: Àwọn èdè

source: &#8220;%1$s&#8221; has been translated into %2$d locale.
yo_ng: A ti túmọ̀ &#8220;%1$s&#8221; sí èdè agbègbè %2$d kan.

source: Fewer than 10
yo_ng: Tó kéré sí 10

source: Development
yo_ng: Ìdàgbàsókè

source: Installation
yo_ng: Ìgbéwọlẹ̀

source: Reviews
yo_ng: Àwọn àgbéyẹ̀wò

source: Details
yo_ng: Àwọn àlàyé

source: Translate &#8220;%s&#8221; into your language.
yo_ng: Túmọ̀ &#8220;%s&#8221; sí èdè rẹ.

source: N/A
yo_ng: Kò sí

source: <a href="%1$s">Browse the code</a>, check out the <a href="%2$s">SVN repository</a>, or subscribe to the <a href="%3$s">development log</a> by <a href="%4$s">email</a> or <a href="%5$s">RSS</a>.
yo_ng: <a href="%1$s">Ṣàwárí koodu</a>, ṣàyẹ̀wò <a href="%2$s">ibi ìpamọ́ SVN</a>, tàbí ṣe àgbékalẹ̀ sí <a href="%3$s">àkọsílẹ̀ ìdàgbàsókè</a> nípasẹ̀ <a href="%4$s">lẹ́tà sọ̀nrọ̀sọ̀</a> tàbí <a href="%5$s">RSS</a>.

source: Stat reflects activity only within the 'recentdays' from today
yo_ng: Ìṣirò ṣe àfihàn ìgbòkègbodò nìkan láàrin 'ọjọ́ àìpẹ́' láti òní

source: Stat reflects current size of queue and does not take into account 'date' or 'day' interval
yo_ng: Ìṣirò ṣe àfihàn ìwọ̀n ìtòlọ́wọ̀ọ̀wọ́ lọ́wọ́lọ́wọ́ kò sì ṣe àkọsílẹ̀ ààrin 'ọjọ́' tàbí 'òní'

source: Plugin Status Change Stats
yo_ng: Àwọn ìṣirò ìyípadà ipò Plugin

source: Displaying stats for the %1$d days preceding %2$s (and other stats for the %3$d most recent days).
yo_ng: Àfihàn àwọn ìṣirò fún %1$d ọjọ́ ṣáájú %2$s (àti àwọn ìṣirò mìíràn fún %3$d ọjọ́ àìpẹ́ jùlọ).

source: Stats
yo_ng: Àwọn ìṣirò

source: The number of days before today to consider as being "recent" (stats marked with **). Default is %d.
yo_ng: Iye ọjọ́ ṣáájú òní láti kà sí "àìpẹ́" (àwọn ìṣirò tí a fi àmì ** sí). Èyí tó wà níbẹ̀ ni %d.

source: The number of days before "Date" to include in stats. Default is %d.
yo_ng: Iye ọjọ́ ṣáájú "Ọjọ́" láti fi kún àwọn ìṣirò. Èyí tó wà níbẹ̀ ni %d.

source: The day up to which stats are to be gathered. In YYYY-MM-DD format. Defaults to today (%s).
yo_ng: Ọjọ́ tí àwọn ìṣirò yóò fi parí. Ní ọ̀nà YYYY-MM-DD. Èyí tó wà níbẹ̀ ni òní (%s).

source: Stats Report
yo_ng: Ìròyìn Àwọn ìṣirò

source: Advanced View
yo_ng: Ìwòye Tó Péye

source: Interested in development?
yo_ng: Ṣe o nífẹ̀ẹ́ sí ìdàgbàsókè?

source: Thank you to <a href="%s">the translators</a> for their contributions.
yo_ng: Ọpẹ́lọpẹ́ fún <a href="%s">àwọn atúmọ̀ èdè</a> fún àwọn ìkópa wọn.

source: WordPress Plugins
yo_ng: Àwọn Plugin WordPress

# locale slug
source: en
yo_ng: yo

# language (fr, fr_CA)
source: en
yo_ng: yo

source: &#8220;%s&#8221; is open source software. The following people have contributed to this plugin.
yo_ng: &#8220;%s&#8221; jẹ́ ètò ìṣàmúlò orísun ṣíṣí sílẹ̀. Àwọn ènìyàn wọ̀nyí ti ṣe ìkópa sí plugin yìí.

source: Login, Slug, or Email.
yo_ng: Ìwọlé, Slug, tàbí Lẹ́tà Sọ̀nrọ̀sọ̀.

source: Contributors
yo_ng: Àwọn Olùkópa

source: Add
yo_ng: Fi kún

source: Displays contributor information.
yo_ng: Ṣe àfihàn ìwífún olùkópa.

source: Displays committer information.
yo_ng: Ṣe àfihàn ìwífún olùfìṣọwọ́sí.

source: Committers
yo_ng: Àwọn Olùfìṣọwọ́sí

source: Plugin Contributors
yo_ng: Àwọn Olùkópa Plugin

source: Tag %s
yo_ng: Àmì %s

source: Search plugins
yo_ng: Ṣàwárí àwọn plugin

source: Meta
yo_ng: Àkójọpọ̀ Meta

source: %1$s<span class="screen-reader-text"> total ratings</span>
yo_ng: %1$s<span class="screen-reader-text"> àpapọ̀ àwọn ìbò</span>

source: Plugin development is constantly changing with each new WordPress release. Keep up with the latest changes by following the <a href="%s">Plugin Review Team&#8217;s blog</a>.
yo_ng: Ìdàgbàsókè Plugin n yípadà nígbà gbogbo pẹ̀lú ìtújáde WordPress tuntun kọ̀ọ̀kan. Tẹ̀lé àwọn àyípadà tuntun nípa títẹ̀lé <a href="%s">búlọ́ọ̀gì Ẹgbẹ́ Àgbéyẹ̀wò Plugin</a>.

source: Stay Up-to-Date
yo_ng: Máa Gba Ìwífún Tó Kẹ́yìn

source: Building a plugin has never been easier. Read through the <a href="%s">Plugin Developer Handbook</a> to learn all about WordPress plugin development.
yo_ng: Kíkọ́ plugin kò rọrùn rí. Ka <a href="%s">Ìwé Ìtọ́nisọ́nà Olùgbéejáde Plugin</a> láti kọ́ gbogbo nǹkan nípa ìdàgbàsókè plugin WordPress.

source: The WordPress Plugin Directory is the largest directory of free and open source WordPress plugins. Find out how to <a href="%s">host your plugin</a> on WordPress.org.
yo_ng: Ìwé Àkójọ Plugin WordPress ni ìwé àkójọ tó tóbi jùlọ fún àwọn plugin WordPress ọ̀fẹ́ àti orísun ṣíṣí sílẹ̀. Wá bí o ṣe lè <a href="%s">gbalejo plugin rẹ</a> lórí WordPress.org.

source: Create a Plugin
yo_ng: Ṣe Plugin kan

source: Add my review
yo_ng: Fi àgbéyẹ̀wò mi kún

source: Tested up to %s
yo_ng: Dánwò dé %s

# plugin tab title
source: Contributors &amp; Developers
yo_ng: Àwọn Olùkópa &amp; Olùgbéejáde

source: Read all %s review
yo_ng: Ka gbogbo àgbéyẹ̀wò %s

source: %1$s out of %2$s
yo_ng: %1$s nínú %2$s

source: Issues resolved in last two months:
yo_ng: Àwọn ọ̀ràn tí a yanjú ní oṣù méjì tó kọjá:

# reviews
source: See all
yo_ng: Wo gbogbo rẹ̀

source: %s ago
yo_ng: %s sẹ́yìn

source: Last updated %s
yo_ng: Ìgbàgbọ́hùn tó kẹ́yìn %s

source: Version: %s
yo_ng: Ẹ̀yà: %s

source: Donate to this plugin
yo_ng: Ṣe ìtọrẹ sí plugin yìí

source: Would you like to support the advancement of this plugin?
yo_ng: Ṣé o fẹ́ ṣe àtìlẹ́yìn fún ìlọsíwájú plugin yìí?

source: Donate
yo_ng: Ṣe ìtọrẹ

source: Displays a donate link.
yo_ng: Ṣe àfihàn ìjápọ̀ ìtọrẹ.

source: Plugin Donate
yo_ng: Ìtọrẹ Plugin

source: Add Your Plugin
yo_ng: Fi Plugin Rẹ Kún

source: Read more
yo_ng: Ka siwaju

# post author
source: By %s
yo_ng: Láti ọwọ́ %s

source: Download
yo_ng: Ṣe ìgbàsílẹ̀

# plugins
source: See all %s
yo_ng: Wo gbogbo %s

source: View support forum
yo_ng: Wo àpéjọ ìrànlọ́wọ́

source: Got something to say? Need help?
yo_ng: Nǹkan wà tí o fẹ́ sọ? Ṣé o nílò ìrànlọ́wọ́?

source: Displays plugin support information.
yo_ng: Ṣe àfihàn ìwífún ìrànlọ́wọ́ plugin.

source: Plugin Support
yo_ng: Ìrànlọ́wọ́ Plugin

source: This plugin has not been rated yet.
yo_ng: A kò tíì fún plugin yìí ní ìbò kankan.

source: %d star
yo_ng: Ìràwọ̀ %d

source: Ratings
yo_ng: Àwọn ìbò

source: Displays the plugin ratings.
yo_ng: Ṣe àfihàn àwọn ìbò plugin.

source: Plugin Ratings
yo_ng: Àwọn Ìbò Plugin

source: Designed to work with: %s
yo_ng: Ṣe láti ṣiṣẹ́ pẹ̀lú: %s

source: Displays plugin meta information.
yo_ng: Ṣe àfihàn ìwífún meta plugin.

source: All Time
yo_ng: Gbogbo Àsìkò

source: Yesterday
yo_ng: Àná

source: Today
yo_ng: Òní

source: Downloads history
yo_ng: Ìtàn àwọn ìgbàsílẹ̀

source: Downloads Per Day
yo_ng: Àwọn ìgbàsílẹ̀ Lójojúmọ́

source: Active versions
yo_ng: Àwọn ẹ́yà tó ṣiṣẹ́

source: No data yet
yo_ng: Kò sí dátà kankan fún àkókò yìí

source: %s out of 5 stars
yo_ng: %s nínú ìràwọ̀ 5

# plugin tab title
source: Other Notes
yo_ng: Àwọn àkíyèsí Mìíràn

# plugin tab title
source: Reviews
yo_ng: Àwọn àgbéyẹ̀wò

# plugin tab title
source: Support
yo_ng: Ìrànlọ́wọ́

# plugin tab title
source: Stats
yo_ng: Àwọn ìṣirò

# plugin tab title
source: Changelog
yo_ng: Àkọsílẹ̀ àwọn àyípadà

# plugin tab title
source: Screenshots
yo_ng: Àwọn àwòrán ìbòjú

# plugin tab title
source: Installation
yo_ng: Ìgbéwọlẹ̀

# plugin tab title
source: Description
yo_ng: Àpèjúwe

source: %d+ million
yo_ng: %d+ mílíọ̀nù

source: Date
yo_ng: Ọjọ́

source: Support
yo_ng: Ìrànlọ́wọ́

source: Downloads
yo_ng: Àwọn ìgbàsílẹ̀

source: Only users with Two-Factor authentication enabled can be selected.
yo_ng: Àwọn alábàáṣiṣẹ́ tí wọ́n ti tan ìfásẹẹ̀yìn Méjì-Factor nìkan ni a lè yàn.

source: New plugin submissions are currently disabled. Please check back after the <a href="%s">holiday break.</a>
yo_ng: Àwọn ìgbéwọlẹ̀ plugin tuntun ti wà ní dídílọ́wọ́ lọ́wọ́lọ́wọ́. Jọ̀wọ́ ṣàyẹ̀wò padà lẹ́yìn <a href="%s">ìsinmi ọdún.</a>

source: The ZIP files for this release have not yet been built by WordPress.org.
yo_ng: WordPress.org kò tíì kọ́ àwọn fáìlì ZIP fún ìtújáde yìí.

source: Release confirmed, waiting for processing.
yo_ng: Ìtújáde ti fìdíìmúlẹ̀, ndúródé fún ṣíṣe.

source: Confirm your Two-Factor Authentication to discard the release %1$s for %2$s.
yo_ng: Fìdíìmúlẹ̀ Ìfásẹẹ̀yìn Méjì-Factor rẹ láti pa ìtújáde %1$s fún %2$s rẹ́.

source: Confirm your Two-Factor Authentication to release version %1$s of %2$s.
yo_ng: Fìdíìmúlẹ̀ Ìfásẹẹ̀yìn Méjì-Factor rẹ láti ṣe ìtújáde ẹ́yà %1$s ti %2$s.

source: Your account has elevated privileges and requires extra security before you can manage plugin releases. Please <a href="%s">enable two-factor authentication now</a>.
yo_ng: Àkópamọ́ rẹ ní àwọn ànfàní tó ga jùlọ ó sì nílò àbò àfikún kí o tó lè ṣàkóso àwọn ìtújáde plugin. Jọ̀wọ́ <a href="%s">tan ìfásẹẹ̀yìn méjì-factor nísinsìnyí</a>.

source: Submitted:
yo_ng: Fi Sílẹ̀:

source: Undo Discard
yo_ng: Pa Ìparẹ́ rẹ́

source: The above may contain false-positives. If you believe an error or warning is incorrect or a false-positive, please do not work around it. A reviewer will manually confirm this during the review process.
yo_ng: Àwọn tó wà lókè yìí lè ní àwọn àṣìṣe èrò. Tí o bá gbàgbọ́ pé àṣìṣe tàbí ìkìlọ̀ kan kò tọ̀nà tàbí pé ó jẹ́ àṣìṣe èrò, jọ̀wọ́ má ṣe yí i ká. Olùgbéyẹ̀wò yóò fìdí rẹ̀ múlẹ̀ pẹ̀lú ọwọ́ lásìkò ìgbéyẹ̀wò.

source: This may be a false-positive, and will be manually checked by a reviewer.
yo_ng: Èyí lè jẹ́ àṣìṣe èrò, olùgbéyẹ̀wò yóò sì ṣàyẹ̀wò rẹ̀ pẹ̀lú ọwọ́.

source: Before you can upload a new plugin, <a href="%s">please enable two-factor authentication</a>.
yo_ng: Kí o tó lè gbé plugin tuntun sí ayélujára, <a href="%s">jọ̀wọ́ tan ìfásẹẹ̀yìn méjì-factor</a>.

source: Log in
yo_ng: Wọlé

source: Your plugin has been rejected because it has been roughly 90 days without significant progress being made on the review we sent to the email address on record at the beginning of the review. https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/#why-was-my-plugin-rejected-after-three-months <strong>What to do next</strong> If you no longer wish to have your plugin reviewed you can simply delete this message. No harm, no foul. If you want to finish your review, please do the following: - <strong>First</strong>, find the last email we sent you with our latest review, read that email thoroughly and <strong>fix the issues mentioned</strong>. - Once your plugin is corrected, you are ready to <a href='https://wordpress.org/plugins/developers/add/'>resubmit it</a> and <strong>reply to this email</strong> so we know you want to continue. - You will then have to <strong>wait</strong> your turn for the team to review your plugin again. We understand that sometimes emails get lost or mistakenly filed as spam, and it's entirely possible that you never received or seen our previous emails. If you can't find it, let us know and we'll send it to you again. <strong>Why this happens</strong> In order to keep the plugin queue manageable, we reject plugins that are not making progress after 3 months (90 days). Even with this policy, we have more than 500 plugins waiting for developers to complete their review at any given time. Thankfully, a rejection does not mean we can't go forward. If you want to continue, please just update your plugin, submit it and reply to let us know.
yo_ng: Wọ́n ti kọ plugin rẹ nítorí pé ó ti tó nǹkan bíi ọjọ́ àádọ́rùn-ún (90) tí kò sí ìlọsíwájú pàtàkì lórí àgbéyẹ̀wò tí a fi ránṣẹ́ sí àdírẹ́sì lẹ́tà sọ̀nrọ̀sọ̀ tí ó wà nínú àkọsílẹ̀ ní ìbẹ̀rẹ̀ àgbéyẹ̀wò. https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/#why-was-my-plugin-rejected-after-three-months <strong>Ohun tó yẹ kí o ṣe</strong> Tí o kò bá fẹ́ kí á ṣe àgbéyẹ̀wò plugin rẹ mọ́, o lè pa ìránṣẹ́ yìí rẹ́. Kò sí ìpalára, kò sí àṣìṣe. Tí o bá fẹ́ parí àgbéyẹ̀wò rẹ, jọ̀wọ́ ṣe àwọn nǹkan wọ̀nyí: - <strong>Lákọ̀ọ́kọ́</strong>, wá lẹ́tà sọ̀nrọ̀sọ̀ tó kẹ́yìn tí a fi ránṣẹ́ sí ọ pẹ̀lú àgbéyẹ̀wò wa tuntun, ka lẹ́tà sọ̀nrọ̀sọ̀ náà dáadáa kí o sì <strong>ṣe àtúnṣe àwọn ọ̀ràn tí a mẹ́nu bà</strong>. - Lẹ́yìn tí o bá ti ṣe àtúnṣe plugin rẹ, o ti ṣe tán láti <a href='https://wordpress.org/plugins/developers/add/'>tún un fi sílẹ̀</a> kí o sì <strong>dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí</strong> kí á lè mọ̀ pé o fẹ́ tẹ̀síwájú. - Lẹ́yìn náà, o ní láti <strong>dúró</strong> de ipò rẹ kí ẹgbẹ́ náà tó tún ṣe àgbéyẹ̀wò plugin rẹ. A mọ̀ pé nígbà mìíràn àwọn lẹ́tà sọ̀nrọ̀sọ̀ máa ń sọnù tàbí kí wọ́n fi í sí abẹ́ ìwé àìfẹ́ ní àṣìṣe, ó sì ṣeé ṣe kí o má rí àwọn lẹ́tà sọ̀nrọ̀sọ̀ wa àtijọ́ gbà rárá. Tí o kò bá rí i, jẹ́ kí á mọ̀, a ó sì tún fi ránṣẹ́ sí ọ. <strong>Ìdí tí èyí fi ń ṣẹlẹ̀</strong> Láti lè jẹ́ kí ìtòlọ́wọ̀ọ̀wọ́ plugin wà ní ìṣàkóso, a máa ń kọ àwọn plugin tí kò bá ń ṣe ìlọsíwájú lẹ́yìn oṣù mẹ́ta (ọjọ́ 90). Pẹ̀lúpẹ̀lú ìlànà yìí, a ní ju plugin 500 lọ tí wọ́n ń dúró de àwọn olùgbéejáde láti parí àgbéyẹ̀wò wọn nígbàkigbà. Ní ìdúpẹ́, ìkọ̀sílẹ̀ kò túmọ̀ sí pé a kò lè tẹ̀síwájú. Tí o bá fẹ́ tẹ̀síwájú, jọ̀wọ́ ṣe àtúnṣe plugin rẹ, fi sílẹ̀ kí o sì dáhùn láti jẹ́ kí á mọ̀.

source: Before you submit your plugin, we ask you to review our <a href="%1$s">Guidelines</a> and read the <a href="%2$s">Frequently Asked Questions</a>. A brief selection of common questions is available below the form.
yo_ng: Kí o tó fi plugin rẹ sílẹ̀, a rọ̀ ọ́ láti ṣe àgbéyẹ̀wò <a href="%1$s">Àwọn Ìlànà</a> wa kí o sì ka <a href="%2$s">Àwọn Ìbéèrè Tí Wọ́n Máa Ń Béèrè Léraléra</a>. Àkójọpọ̀ kúkúrú ti àwọn ìbéèrè tó wọ́pọ̀ wà ní ìsàlẹ̀ fọ́ọ̀mù náà.

source: Howdy %1$s, %2$s has committed a new version of %3$s - %4$s. Action is required before the new version will be released. Follow the link below to login and confirm the release. <%5$s> This notice has been sent to all plugin committers.
yo_ng: Báwo ni %1$s, %2$s ti ṣe ìtújáde ẹ́yà tuntun ti %3$s - %4$s. Ìgbésẹ̀ nílò kí ẹ́yà tuntun tó jáde. Tẹ̀lé ìjápọ̀ ìsàlẹ̀ láti wọlé kí o sì fìdí ìtújáde náà múlẹ̀. <%5$s> A ti fi ìfitónilétí yìí ránṣẹ́ sí gbogbo àwọn olùfìṣọwọ́sí plugin.

source: See all<span class="screen-reader-text"> reviews</span>
yo_ng: Wo gbogbo<span class="screen-reader-text"> àwọn àgbéyẹ̀wò</span>

source: Contribute to this plugin
yo_ng: Ṣe ìkópa sí plugin yìí

source: View support
yo_ng: Wo ìrànlọ́wọ́

source: It depends on what you want to change. If you want to change the plugin <strong>display name</strong> you can update that by updating your plugin files in this page. If what you want to change is the <strong>permalink / slug</strong> of your plugin, you can do that ONCE before we begin with the review (if that&#8217;s available you&#8217;ll see a link to change it on this page). If this is not possible, you will need to contact us at %s, we can change it as long as the plugin has not yet been approved.
yo_ng: Ó sinmi lórí ohun tí o fẹ́ yípadà. Tí o bá fẹ́ yí <strong>orúkọ àfihàn</strong> plugin padà, o lè ṣe àtúnṣe nípa ṣíṣe àtúnṣe àwọn fáìlì plugin rẹ ní ojú ìwé yìí. Tí ohun tí o fẹ́ yípadà bá jẹ́ <strong>ìjápọ̀ ayérayé / slug</strong> plugin rẹ, o lè ṣe bẹ́ẹ̀ LẸ́Ẹ̀KANṢOṢO kí á tó bẹ̀rẹ̀ àgbéyẹ̀wò (tí ó bá wà nílẹ̀, o ó rí ìjápọ̀ láti yí i padà ní ojú ìwé yìí). Tí èyí kò bá ṣeé ṣe, o ní láti kàn sí wa ní %s, a lè yí i padà níwọ̀n ìgbà tí a kò bá tíì fọwọ́sí plugin náà.

source: I made a mistake in my plugin name. Should I update it?
yo_ng: Mo ṣe àṣìṣe nínú orúkọ plugin mi. Ṣé kí n ṣe àtúnṣe rẹ̀?

source: You have %s plugin being actively reviewed and have been sent an email regarding issues. You must complete this review before you can submit another plugin. Please continue the review process by following the steps indicated in that email.
yo_ng: O ní plugin %s kan tí wọ́n n ṣègbéyẹ̀wò lọ́wọ́, wọ́n sì ti fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí ọ nípa àwọn ọ̀ràn. O gbọ́dọ̀ parí àgbéyẹ̀wò yìí kí o tó lè fi plugin mìíràn sílẹ̀. Jọ̀wọ́ tẹ̀síwájú pẹ̀lú ìgbésẹ̀ àgbéyẹ̀wò nípa títẹ̀lé àwọn ìgbésẹ̀ tí a tọ́ka sí nínú lẹ́tà sọ̀nrọ̀sọ̀ náà.

source: Community plugin
yo_ng: Plugin àwùjọ

source: Commercial plugin
yo_ng: Plugin ìṣòwò

source: You can have up to %s plugins in the queue at a time. You may submit an additional plugin for review below.
yo_ng: O lè ní tó %s àwọn plugin nínú ìtòlọ́wọ̀ọ̀wọ́ ní àkókò kan. O lè fi plugin àfikún sílẹ̀ fún àgbéyẹ̀wò ní ìsàlẹ̀.

source: Submission is simple
yo_ng: Ìgbéwọlẹ̀ rọrùn

source: Developer information
yo_ng: Ìwífún olùgbéejáde

source: Stay up-to-date
yo_ng: Máa gba ìwífún tó kẹ́yìn

source: Create a plugin
yo_ng: Ṣe plugin kan

source: Add your plugin
yo_ng: Fi plugin rẹ kún

source: Popular plugins
yo_ng: Àwọn plugin tó gbajúmọ̀

source: My favorites
yo_ng: Àwọn ààyò mi

source: Beta plugins
yo_ng: Àwọn plugin Bétà

source: Featured plugins
yo_ng: Àwọn plugin tí a yàn

source: Block-Enabled plugins
yo_ng: Àwọn plugin tí a ti tan agbára ìdínà fún

source: Language
yo_ng: Èdè

source: Version %s
yo_ng: Ẹ̀yà %s

source: Extend your WordPress experience! Browse over %s free plugin.
yo_ng: Faagun ìrírí WordPress rẹ! Ṣàwárí ju plugin %s ọ̀fẹ́ lọ.

source: commercial
yo_ng: ìṣòwò

source: community
yo_ng: àwùjọ

source: If the code in your plugin falls into one of the above categories, <strong>your plugin will not be approved</strong>. The plugin review team will refer you back to these Handbook pages, adding further delay to the review process.
yo_ng: Tí koodu nínú plugin rẹ bá bọ́ sí ọ̀kan nínú àwọn ọ̀wọ́ òkè wọ̀nyí, <strong>a kò ní fọwọ́sí plugin rẹ</strong>. Ẹgbẹ́ àgbéyẹ̀wò plugin yóò tọ́ka rẹ padà sí àwọn ojú ìwé Ìwé Ìtọ́nisọ́nà wọ̀nyí, èyí yóò fa ìdádúró síwájú sí i nínú ìgbésẹ̀ àgbéyẹ̀wò.

source: The plugin processes form data without a nonce: <a href="%s">Learn about Nonces</a>
yo_ng: Plugin náà n ṣiṣẹ́ lórí dátà fọ́ọ̀mù láìsí nonce: <a href="%s">Kọ́ nípa Nonces</a>

source: The plugin accepts unsanitized data: <a href="%s">Learn about Sanitizing Data</a>
yo_ng: Plugin náà gba dátà tí a kò sọ di mímọ́: <a href="%s">Kọ́ nípa Sísọ Dátà Di Mímọ́</a>

source: The plugin contains unescaped output: <a href="%s">Learn about Escaping Data</a>
yo_ng: Plugin náà ní ìtújáde tí a kò yọ kúrò: <a href="%s">Kọ́ nípa Yíyọ Dátà Kúrò</a>

source: Our three most common reasons for not approving a plugin are:
yo_ng: Àwọn ìdí mẹ́ta wa tó wọ́pọ̀ jùlọ fún àìfọwọ́sí plugin ni:

source: Your plugin review cannot be prioritized over others, to help us approve your plugin sooner, please ensure that you have read the <a href="%s">Security chapter</a> of the Plugin Handbook.
yo_ng: A kò lè ṣe àgbéyẹ̀wò plugin rẹ ní àkọ́kọ́ ju àwọn mìíràn lọ, láti ràn wá lọ́wọ́ láti fọwọ́sí plugin rẹ ní kíákíá, jọ̀wọ́ ríi dájú pé o ti ka <a href="%s">orí Àbò</a> ti Ìwé Ìtọ́nisọ́nà Plugin.

source: How can I expedite my plugin review?
yo_ng: Báwo ni mo ṣe lè yára ṣe àgbéyẹ̀wò plugin mi?

source: The %1$s field is invalid, the specified SVN tag %2$s does not exist. %3$s will be used instead.
yo_ng: Ààyè %1$s kò tọ̀nà, àmì SVN %2$s tí a tọ́ka sí kò sí. %3$s ni a ó lò dípò.

source: Category
yo_ng: Ẹ̀ka

source: Categories <span>%s</span>
yo_ng: Àwọn ẹ̀ka <span>%s</span>

source: If you have any questions, please contact <a href="mailto:%1$s">%1$s</a> before proceeding with a link to your plugin and your questions.
yo_ng: Tí o bá ní ìbéèrè kankan, jọ̀wọ́ kàn sí <a href="mailto:%1$s">%1$s</a> kí o tó tẹ̀síwájú pẹ̀lú ìjápọ̀ sí plugin rẹ àti àwọn ìbéèrè rẹ.

source: Please enter the plugin slug %s below.
yo_ng: Jọ̀wọ́ tẹ slug plugin %s sí ìsàlẹ̀.

source: I am not working on a newer version to submit to the plugin directory.
yo_ng: N kò ṣiṣẹ́ lórí ẹ̀yà tuntun láti fi sílẹ̀ sí ìwé àkójọ plugin.

source: Yes, I understand that this is permanent.
yo_ng: Bẹ́ẹ̀ ni, mo yé mi pé títí láé ni èyí.

source: Yes, I wish to close %s.
yo_ng: Bẹ́ẹ̀ ni, mo fẹ́ pa %s.

source: Close your plugin?
yo_ng: Pa plugin rẹ?

source: The %1$s field could not be validated. <a href="%2$s">A GPLv2 or later compatible license</a> should be specified. The specified license may be compatible.
yo_ng: A kò lè fìdí ààyè %1$s múlẹ̀. <a href="%2$s">Ìwé-àṣẹ tó bá GPLv2 mu tàbí ti ìgbà tó tẹ̀le</a> ni ó yẹ kí a tọ́ka sí. Ìwé-àṣẹ tí a tọ́ka sí lè bá a mu.

source: The %1$s field appears to be invalid. <a href="%2$s">A GPLv2 or later compatible license</a> should be specified.
yo_ng: Ó dàbí pé ààyè %1$s kò tọ̀nà. <a href="%2$s">Ìwé-àṣẹ tó bá GPLv2 mu tàbí ti ìgbà tó tẹ̀le</a> ni ó yẹ kí a tọ́ka sí.

source: Additional Information
yo_ng: Ìwífún Àfikún

source: Mark as Pending Initial Review
yo_ng: Sàmì sí bíi Ndurodè Àgbéyẹ̀wò Àkọ́kọ́

source: If you feel this is in error, such as you legally own the trademark for the term, please email us at %1$s and explain your situation.
yo_ng: Tí o bá rò pé àṣìṣe ni èyí, bíi pé o jẹ́ ẹni tí ó ni àmì ìṣòwò fún ọ̀rọ̀ náà nípa òfin, jọ̀wọ́ fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí wa ní %1$s kí o sì ṣàlàyé ipò rẹ.
