Repository: w3techy/WordPress-YR
Catalog: meta-rosetta-yor.po
Languages: yo_ng

# Menu title
source: News
yo_ng: Iroyin

# Menu title
source: Documentation
yo_ng: Akosile

# Menu title
source: Get WordPress
yo_ng: Gba WordPress

# Menu title
source: Support
yo_ng: Atilẹyin

# Menu title
source: About
yo_ng: Nipa

# Menu title
source: Team
yo_ng: Omo Egbe

# Menu title
source: Get Involved
yo_ng: Kopa

# Menu title
source: Home
yo_ng: Ile

source: Show all releases
yo_ng: Ṣe afihan gbogbo awọn ifiloole

source: <strong>Hint:</strong> You can delete all builds which are not intended for release.
yo_ng: <strong>Imọran:</strong> O le pa gbogbo awọn "builds" ti o ko pinnu funi dasilẹ rẹ.

source: &mdash; Select &mdash;
yo_ng: &mdash; Yan &mdash;

source: Resources for translation contributors
yo_ng: Awọn ohun elo fun awọn oluranlọwọ itumọ

source: The locale does not exist yet.
yo_ng: Locale yii ko ti sii bayi

source: Locale Manager
yo_ng: Alakoso Locale

source: Use as website screenshot
yo_ng: Lo bi screenshot wẹẹbu

source: Remove website screenshot
yo_ng: Yọ screenshot wẹẹbu kuro

source: Set website screenshot
yo_ng: Yan screenshot wẹẹbu

source: Website Screenshot
yo_ng: Screenshot wẹẹbu

source: &#8220;%s&#8221; (Edit)
yo_ng: &#8220;%s&#8221; (Ṣatunkọ)

source: Share this:
yo_ng: Pin eyi:

source: Site Stats
yo_ng: Awọn iṣiro Saiti

source: General Translation Editor
yo_ng: Olootu Itumọ Gbogbogbo

source: If the WordPress version you want to use isn&#8217;t tagged enter <a href="%s">a revision number</a> here to get the right files.
yo_ng: Ti version WordPress ti o fẹ lati lo ko ba ni taagi, tẹ <a href="%s">nọmba atunyẹwo</a> nibi lati gba awọn faili to tọ.

source: Previous post:
yo_ng: Abala to koja

source: Previous
yo_ng: Padà sẹ́yìn

source: Next post:
yo_ng: Abala to kan

source: Next
yo_ng: Padà sẹ́yìn

source: Read on for more &raquo;
yo_ng: Ka siwaju fun diẹ ẹ sii & raquo;

source: Categories
yo_ng: Awọn ẹka

source: Older Posts &raquo;
yo_ng: Àwọn àtẹ̀jáde àtijọ́ &raquo;

source: &laquo; Newer Posts
yo_ng: &laquo; Àwọn àtẹ̀jáde tuntun

source: Sorry, no posts matched your criteria.
yo_ng: Má bínú, kò sí àtẹ̀jáde kankan tí ó bá àwárí rẹ mu.

source: Filed under %s.
yo_ng: Ti fi pamọ́ sábẹ́ %s.

source: Posted on %1$s by %2$s.
yo_ng: Fi Jade ni %1$s by %2$s.

source: Featured
yo_ng: Ere ifihan

source: There are no releases, yet.
yo_ng: Ko si release kankan bayi

source: Comments are closed.
yo_ng: Àtìpa ìdáásí de

# comments title
source: One thought on &ldquo;%2$s&rdquo;
yo_ng: Èrò kàn lórí &ldquo;%2$s&rdquo;

source: The page you were looking for could not be found. I&#8217;m sorry, it&#8217;s not your fault&hellip; probably.
yo_ng: Oju-iwe ti o n wa ko ṣee ri. Ma binu, kii ṣe ẹbi rẹ &hellip; jasi.

source: Page Not Found
yo_ng: A ko ri Oju-iwe naa

source: Translation Editor
yo_ng: Olootu Itumọ

source: Translation of default themes:
yo_ng: Ìtumọ̀ àwọn themes àkọ́kọ́:

source: Release Packages
yo_ng: Àwọn Release Package

source: Theme translation will be taken from the theme projects inside the translate.wordpress.org project you chose.
yo_ng: Ìtumọ̀ theme ni a óò gba láti inú àwọn iṣẹ́ theme nínú iṣẹ́ translate.wordpress.org tí o yàn.

source: Website
yo_ng: Wẹẹbu

source: Image
yo_ng: Aworan

source: Description
yo_ng: Apejuwe

source: Description and URL
yo_ng: Apejuwe ati URL

source: Nothing found in Trash
yo_ng: Ko si ohun ti a ri ni Trash

source: Nothing found
yo_ng: Ko si nkankan

source: Search Showcase
yo_ng: Wa Afihan

source: View Site
yo_ng: Wo Saiti

source: New Site
yo_ng: Saiti Titun

source: Edit Site
yo_ng: Ṣatunkọ Saiti

source: Add New Site
yo_ng: Se afikun Saiti titun

# showcase item
source: Add New
yo_ng: Se afikun

# post type singular name
source: Showcase Site
yo_ng: Fi Saiti han

# post type general name
source: Showcase
yo_ng: Afihan

# locales
source: All
yo_ng: Lapapo

source: This page shows the <a href="%s">Download Counter</a> number &mdash; total downloads of WordPress %s &mdash; broken down by locale.
yo_ng: Oju-iwe yii ṣe afihan nọmba <a href="%s">downloodu</a> & mdash; lapapọ awọn downloadu WordPress %s & mdash; nipa locale.

source: Download Stats
yo_ng: Àwọn iṣiro Download

source: Error in exporting iis branch from locale repository.
yo_ng: Àṣìṣe ní fífi iis branch ránṣẹ́ láti ibi ìpamọ́ locale.

source: Default theme translation will be taken from <code>messages/theme-name/%s.po</code> in your locale branch.
yo_ng: Ìtumọ̀ theme àkọ́kọ́ ni a óò gba láti inú <code>messages/theme-name/%s.po</code> nínú locale branch rẹ.

source: This number will appear in the filename of your release. Doesn&#8217;t determine which version of WordPress you will get.
yo_ng: Nọ́mbà yìí yóò hàn nínú orúkọ fáìlì release rẹ. Kò ní ṣe ìpinnu irú version WordPress tí ìwọ yóò gbà.

source: Project name at translate.wordpress.org. Determines which version of WordPress you will get.
yo_ng: Orúkọ iṣẹ́ ní translate.wordpress.org. Èyí yóò ṣe ìpinnu irú version WordPress tí ìwọ yóò gbà.

source: Blog Archives
yo_ng: Àwọn àpamọ́ Blog

source: Permanent Link to %s
yo_ng: Ìjápọ̀ tíkòyípadà sí %s

source: Visit the site &rarr;
yo_ng: Lọ sí ìkànnì &rarr;

source: Code is Poetry.
yo_ng: Koodu jẹ Ewi.

source: %s Branch
yo_ng: %s Ẹka

source: Latest release
yo_ng: Release titun

source: For help with installing or using WordPress, consult our documentation in your language.
yo_ng: Fun iranlọwọ pẹlu instalation tabi lilo WordPress, kan si awọn akosile wa ni ede rẹ.

source: Resources
yo_ng: Ohun elo

source: Download .tar.gz &mdash; %s MB
yo_ng: Gba .tar.gz &mdash; %s MB

source: Download WordPress %s
yo_ng: Gba WordPress %s

source: Submit Contact Form
yo_ng: Fi Fọọmù ranse

source: Tell us something:
yo_ng: Sọ fun wa nkankan:

source: (required)
yo_ng: (dandan)

source: <strong>Please, do not post support requests here!</strong> They will probably be ignored.
yo_ng: <strong>Jọwọ, maṣe fi awọn ibeere fun atilẹyin ranṣẹ si ibi!</strong> A ki yo da o lohun.

source: You can contact translators and this site administrators via this form:
yo_ng: O le kan si awọn onitumọ ati awọn alakoso saiti yii nipasẹ fọọmu yii:

source: Thank you!
yo_ng: A dupe!

source: Submitted!
yo_ng: Ti fi sowo!

source: Submit Form Again
yo_ng: Fi Fọọmu na sowo Lẹẹkansi

source: Say something!
yo_ng: So nkankan!

source: Your Message:
yo_ng: Ifiranṣẹ rẹ:

source: Write something!
yo_ng: Kọ nkankan!

source: What&rsquo;s this about?
yo_ng: Kíni èyí dá lé lórí?

source: URI of your blog:
yo_ng: URI blog rẹ:

source: Your email address did not appear to be valid. Please check it.
yo_ng: Adirẹsi imeeli rẹ ko han pe o je ojulowo. Jọwọ ṣayẹwo.

source: Your Email:
yo_ng: Imeeli rẹ:

source: Let us know your name.
yo_ng: Jẹ ki a mọ orukọ rẹ.

source: Your Name:
yo_ng: Orukọ rẹ:

source: There seems to have been a problem with the information you entered. Please fix the field indicated and resubmit.
yo_ng: O dabi ẹni pe iṣoro ti wa pẹlu alaye ti o tẹ sii. Jọwọ ṣe atunṣe aaye ti a tọka si

source: Error
yo_ng: Asise

source: &laquo; Back to blog
yo_ng: &laquo; Pada si bulọọgi

source: Blog
yo_ng: Bulọọgi

source: WordPress revision:
yo_ng: Atunyẹwo WordPress:

source: The directory from the WordPress repository, from which the package will be built.
yo_ng: Atọ́ka láti ibi ìpamọ́ WordPress, níbi tí package yóò ti wá.

source: Project:
yo_ng: Iṣẹ́:

source: The directory from your repository, from which the dist files will be taken.
yo_ng: Atọ́ka láti ibi ìpamọ́ rẹ, níbi tí àwọn fáìlì dist yóò ti wá.

source: The directory from your repository, from which the package will be built.
yo_ng: Atọ́ka láti ibi ìpamọ́ rẹ, níbi tí package yóò ti wá.

source: Locale branch for dist files:
yo_ng: Locale branch fún àwọn fáìlì dist:

source: (<code>dist/</code> files will still be taken from Subversion)
yo_ng: (<code>dist/</code> àwọn fáìlì ni a óò ṣì máa gbà láti Subversion)

source: Where should we get your translations from:
yo_ng: Níbo ni kí á ti gba àwọn ìtumọ̀ rẹ:

source: Build New Package
yo_ng: Build Package Tuntun

source: No Releases
yo_ng: Kò sí Releases

source: Released On
yo_ng: Release ní

source: Releases
yo_ng: Àwọn Release

source: Go and build a localized version &raquo;
yo_ng: Lọ kí o sì build version agbègbè &raquo;

source: Built On
yo_ng: Build Ní

source: Links
yo_ng: Àwọn ìjápọ̀

source: Main Menu
yo_ng: Akoojọ aṣayan akọkọ

source: Action
yo_ng: Ìgbésẹ̀

source: Couldn&#8217;t delete release file %s
yo_ng: Kò lè pa fáìlì release %s rẹ́

source: Couldn&#8217;t delete build file %s
yo_ng: Kò lè pa fáìlì build %s rẹ́

source: Couldn&#8217;t copy %1$s to release dir %2$s
yo_ng: Kò lè ṣàdàkọ %1$s sí release dir %2$s

source: Couldn&#8217;t move %s to %s.
yo_ng: Kò lè gbé %s sí %s.

source: Invalid source %s.
yo_ng: Orísun %s àìtọ́.

source: Invalid revision %s.
yo_ng: Àtúnyẹ̀wò %s àìtọ́.

source: Invalid version %s.
yo_ng: Version %s àìtọ́.

source: Couldn&#8217;t create mo file %s from po file %s!
yo_ng: Kò lè ṣẹ̀dá fáìlì mo %s láti inú fáìlì po %s!

source: Po file %s doesn&#8217;t exist!
yo_ng: Fáìlì po %s kò sí!

source: Couldn&#8217;t copy %s to %s!
yo_ng: Kò lè ṣàdàkọ %s sí %s!

source: Couldn&#8217;t create directory %s!
yo_ng: Kò lè ṣẹ̀dá atọ́ka %s!

source: Couldn&#8217;t open directory %s for reading!
yo_ng: Kò lè ṣí atọ́ka %s fún kíkà!

source: Error moving iis files to build directory.
yo_ng: Àṣìṣe ní gbígbé àwọn fáìlì iis sí atọ́ka build.

source: Error in exporting theme/%s. Probably this branch/tag doesn&#8217;t exist.
yo_ng: Àṣìṣe ní fífi theme/%s ránṣẹ́. Ó ṣeé ṣe kí branch/tag yìí má sí.

source: Couldn&#8217;t create temporary directory %s!
yo_ng: Kò lè ṣẹ̀dá atọ́ka %s fún ìgbà díẹ̀!

source: Couldn&#8217;t delete temporary file %s!
yo_ng: Kò lè pa fáìlì %s fún ìgbà díẹ̀ rẹ́!

source: Couldn&#8217;t create a temporary file!
yo_ng: Kò lè ṣẹ̀dá fáìlì fún ìgbà díẹ̀!

source: The default key in dist/wp-config-sample.php does&#8217;t match $wp_default_secret_key in %1$s.php. The one in the sample config is:<p><code>%2$s</code></p><p>and the one in %1$s.php is:</p><p><code>%3$s</code></p>
yo_ng: Kọ́kọ́rọ́ àkọ́kọ́ nínú dist/wp-config-sample.php kò bá $wp_default_secret_key nínú %1$s.php mu. Èyí tó wà nínú àpẹẹrẹ config ni:<p><code>%2$s</code></p><p>àti èyí tó wà nínú %1$s.php ni:</p><p><code>%3$s</code></p>

source: The locale %s doesn&#8217;t have associated locale in GlotPress.
yo_ng: Locale %s kò ní locale tí ó jọmọ́ nínú GlotPress.

source: Couldn&#8217;t write downloaded file to %s
yo_ng: Kò lè kọ fáìlì tí a download sí %s

source: Couldn&#8217;t retrieve the file from: %s
yo_ng: Kò lè gba fáìlì náà láti: %s

source: No svn branch associated with this project.
yo_ng: Kò sí svn branch tí ó jọmọ́ iṣẹ́ yìí.

source: Couldn't write wp-config-sample.php
yo_ng: Kò lè kọ wp-config-sample.php

source: Couldn't open wp-config-sample.php
yo_ng: Kò lè ṣí wp-config-sample.php

source: Couldn't write version.php
yo_ng: Kò lè kọ version.php

source: Couldn't open version.php
yo_ng: Kò lè ṣí version.php

source: Showcase
yo_ng: Àfihàn

source: Are you sure you wish to completely remove CLPTE status for this user?
yo_ng: Ṣé o dá ọ lójú pé o fẹ́ yọ ipò CLPTE kúrò pátápátá fún olùlò yíì?

source: Sites Without Locale Association
yo_ng: Àwọn Site tí kò ní Ìsopọ̀ Locale

source: Manage the locale association for localized sites. Without an association the site&#8217;s front end is not available.
yo_ng: Ṣàkóso ìsopọ̀ locale fún àwọn site agbègbè. Láìsí ìsopọ̀, ojú ìwọ̀n site náà kò ní sí.

source: Latest Release
yo_ng: Release Tuntun

source: Howdy ###USERNAME###, We are happy to inform you that you have been successfully added as a Project Translation Editor for ###LOCALENAME### for the following projects: ###PROJECTLIST### You have been added to these projects either by your own request or by the request of the project author. Before translating, please get to know how the team works by reading the Translators Handbook – https://make.wordpress.org/polyglots/handbook/, a good place to start is the General Expectations page. Your local translation team can be found on https://make.wordpress.org/polyglots/teams/. Make sure you get familiar with the documentation about translating in your language that other contributors from your team have prepared. ###RESOURCESLIST### The Polyglots team connects on Slack. Check out https://make.wordpress.org/meetings/#polyglots for upcoming team meetings. We’d love to have you there if you can make it. Register from https://chat.wordpress.org/. If you have any questions about the processes or need any help, reach the team on Slack or on https://make.wordpress.org/polyglots/. The access has been granted by ###CURRENTUSERNAME###. Welcome to the WordPress Polyglots team and happy translating.
yo_ng: Báwo ni ###USERNAME###, Inú wa dùn láti sọ fun ọ pé a ti fi ọ́ kúnú pẹ̀lú àṣeyọrí gẹ́gẹ́ bíi Olootu Itumọ Iṣẹ-ṣiṣe fún ###LOCALENAME### fún àwọn iṣẹ́ wọ̀nyí: ###PROJECTLIST### A ti fi ọ́ kúnú àwọn iṣẹ́ wọ̀nyí bóyá nípasẹ̀ ìbéèrè rẹ tàbí nípasẹ̀ ìbéèrè olùkọ iṣẹ́ náà. Ṣáájú ìtumọ̀, jọ̀wọ́ mọ bí ẹgbẹ́ náà ṣe n ṣiṣẹ́ nípa kíkà Ìwé Ìtumọ̀ – https://make.wordpress.org/polyglots/handbook/, ibi tí ó dára láti bẹ̀rẹ̀ ni ojú ìwé Àwọn Ohun tí a Retí. Ẹgbẹ́ ìtumọ̀ agbègbè rẹ wà ní https://make.wordpress.org/polyglots/teams/. Ríi dájú pé o mọ àwọn àkọsílẹ̀ nípa ìtumọ̀ ní èdè rẹ tí àwọn olùkópa mìíràn nínú ẹgbẹ́ rẹ ti pèsè. ###RESOURCESLIST### Ẹgbẹ́ Polyglots n so pọ̀ lórí Slack. Ṣàyẹ̀wò https://make.wordpress.org/meetings/#polyglots fún àwọn ìpàdé ẹgbẹ́ tí ó nbọ̀. Inú wa yóò dùn láti ní ọ níbẹ̀ tí o bá lè wá. Forúkọsílẹ̀ láti https://chat.wordpress.org/. Tí o bá ní ìbéèrè kankan nípa àwọn ìlànà tàbí tí o nílò ìrànlọ́wọ́, kan sí ẹgbẹ́ náà lórí Slack tàbí ní https://make.wordpress.org/polyglots/. ###CURRENTUSERNAME### ló fún ọ ní àṣẹ. Kaabọ sí ẹgbẹ́ WordPress Polyglots, ku iṣẹ́ ìtumọ̀.

source: Howdy ###USERNAME###, We are happy to inform you that you have been successfully added as a General Translation Editor of WordPress for ###LOCALENAME###. As a General Translation Editor you have access to submit and approve translations for all projects available at ###LOCALEURL###. Alongside WordPress itself, it’s good to prioritize translating the projects that ship with it first – The default themes like Twenty Seventeen or Twenty Sixteen, and Akismet. Please get to know how the team works by reading the Translators Handbook – https://make.wordpress.org/polyglots/handbook/, a good place to start is the General Expectations page. As a General Translation Editor for the locale, we request that you fill out your WordPress.org profile (https://profiles.wordpress.org/profile/), register on Slack and provide a way for translation contributors to reach you. We also ask all WordPress General Translation Editors to subscribe for notifications for their locales, you can find the notification subscription settings in your profile settings (https://profiles.wordpress.org/profile/notifications/). The Polyglots team connects on Slack. Check out https://make.wordpress.org/meetings/#polyglots for upcoming team meetings. We’d love to have you there if you can make it. Register from https://chat.wordpress.org. If you have any questions about the processes or need any help, reach the team on Slack or on https://make.wordpress.org/polyglots/. The access has been granted by ###CURRENTUSERNAME###. Welcome to the WordPress Polyglots team and happy translating!
yo_ng: Báwo ni ###USERNAME###, Inú wa dùn láti sọ fun ọ pé a ti fi ọ́ kúnú pẹ̀lú àṣeyọrí gẹ́gẹ́ bíi Olootu Itumọ Gbogbogbo ti WordPress fún ###LOCALENAME###. Gẹ́gẹ́ bíi Olootu Itumọ Gbogbogbo, o ní àṣẹ láti fi ìtumọ̀ ránṣẹ́ àti láti fọwọ́sí i fún gbogbo àwọn iṣẹ́ tí ó wà ní ###LOCALEURL###. Pẹ̀lú WordPress fúnra rẹ̀, ó dára láti ṣe àkọ́kọ́ ìtumọ̀ àwọn iṣẹ́ tí ó wá pẹ̀lú rẹ̀ – Àwọn themes àkọ́kọ́ bíi Twenty Seventeen tàbí Twenty Sixteen, àti Akismet. Jọ̀wọ́ mọ bí ẹgbẹ́ náà ṣe n ṣiṣẹ́ nípa kíkà Ìwé Ìtumọ̀ – https://make.wordpress.org/polyglots/handbook/, ibi tí ó dára láti bẹ̀rẹ̀ ni ojú ìwé Àwọn Ohun tí a Retí. Gẹ́gẹ́ bíi Olootu Itumọ Gbogbogbo fún locale, a bèèrè pé kí o kún ìwé àkọọ́lẹ̀ WordPress.org rẹ (https://profiles.wordpress.org/profile/), forúkọsílẹ̀ lórí Slack kí o sì pèsè ọ̀nà fún àwọn olùkópa ìtumọ̀ láti kan sí ọ. A tún bèèrè lọ́wọ́ gbogbo àwọn Olootu Itumọ Gbogbogbo WordPress láti forúkọsílẹ̀ fún àwọn ìwifúnní fún àwọn locale wọn, o lè rí àwọn ètò ìforúkọsílẹ̀ ìwifúnní nínú ètò ìwé àkọọ́lẹ̀ rẹ (https://profiles.wordpress.org/profile/notifications/). Ẹgbẹ́ Polyglots n so pọ̀ lórí Slack. Ṣàyẹ̀wò https://make.wordpress.org/meetings/#polyglots fún àwọn ìpàdé ẹgbẹ́ tí ó nbọ̀. Inú wa yóò dùn láti ní ọ níbẹ̀ tí o bá lè wá. Forúkọsílẹ̀ láti https://chat.wordpress.org. Tí o bá ní ìbéèrè kankan nípa àwọn ìlànà tàbí tí o nílò ìrànlọ́wọ́, kan sí ẹgbẹ́ náà lórí Slack tàbí ní https://make.wordpress.org/polyglots/. ###CURRENTUSERNAME### ló fún ọ ní àṣẹ. Kaabọ sí ẹgbẹ́ WordPress Polyglots, ku iṣẹ́ ìtumọ̀!

source: You have been added to a WordPress project as a translation editor
yo_ng: A ti fi ọ́ kún iṣẹ́ WordPress kan gẹ́gẹ́ bí olóòtú ìtumọ̀

source: Resources for translation editors
yo_ng: Àwọn ohun èlò fún àwọn olóòtú ìtumọ̀

source: Sites
yo_ng: Àwọn Site

source: Existing Associations
yo_ng: Àwọn Ìsopọ̀ Tó Ti Wà

source: Add New Association
yo_ng: Ṣe Àfikún Ìsopọ̀ Tuntun

source: The association has been deleted.
yo_ng: A ti pa ìsopọ̀ náà rẹ́.

source: The ID of the association is missing. Please try again.
yo_ng: ID ìsopọ̀ náà kò sí. Jọ̀wọ́ gbìyànjú lẹ́ẹ̀kansíi.

source: The new association has been added.
yo_ng: A ti ṣe àfikún ìsopọ̀ tuntun.

source: Please provide a locale and a subdomain.
yo_ng: Jọ̀wọ́ pèsè locale àti subdomain kan.

source: An error occurred. Please try again.
yo_ng: Àṣìṣe kan ṣẹlẹ̀. Jọ̀wọ́ gbìyànjú lẹ́ẹ̀kansíi.

source: Locale Associations
yo_ng: Àwọn Ìsopọ̀ Locale

source: Add cross-locale PTE access for:
yo_ng: Ṣe àfikún àṣẹ PTE cross-locale fún:

source: Edit Cross-Locale PTE
yo_ng: Ṣàtúnṣe PTE Cross-Locale

source: Add Cross-Locale PTE
yo_ng: Ṣe Àfikún PTE Cross-Locale

source: This is the list of our current Cross-Locale PTEs.
yo_ng: Èyí ni àtòjọ àwọn PTE Cross-Locale wa lọ́wọ́lọ́wọ́.

source: Cross-Locale PTEs
yo_ng: Àwọn PTE Cross-Locale

source: Cross-Locale PTE
yo_ng: PTE Cross-Locale

source: You are currently editing the user %s.
yo_ng: O n ṣàtúnṣe olùlò %s lọ́wọ́lọ́wọ́.

source: Loading&hellip;
yo_ng: Ó n gbádùn lọ́wọ́&hellip;

source: General Translation Editor <span class="count">(%s)</span>
yo_ng: Olóòtú ìtumọ̀ Gbogbogbo <span class="count">(%s)</span>

source: Translation Editor <span class="count">(%s)</span>
yo_ng: Olóòtú ìtumọ̀ <span class="count">(%s)</span>

# translation editors
source: All <span class="count">(%s)</span>
yo_ng: Gbogbo <span class="count">(%s)</span>

source: The user couldn&#8217;t be added to this site.
yo_ng: Olùmúlò kò ṣe fi kún sí Site yíì &#8211;

source: The translation editor has validation permissions for all projects, including newly-added projects.
yo_ng: Olóòtú ìtumọ̀ ní àwọn ìgbààyè ìfọwọ́sí fún gbogbo àwọn iṣẹ́, pẹ̀lú àwọn iṣẹ́ tuntun tí a ṣẹ̀ṣẹ̀ fi kún.

source: Search...
yo_ng: Ṣàwárí...

source: Custom &ndash; After the user is added you will be redirected to set the projects.
yo_ng: Àdàṣe &ndash; Lẹ́yìn tí a bá ti fi olùlò kún, a ó darí rẹ láti ṣètò àwọn iṣẹ́ náà.

source: E-mail or Username
yo_ng: E-mail tàbí Orúkọ Olùlò

source: Enter the email address or username of an existing user on wordpress.org.
yo_ng: Tẹ àdírẹ́sì e-mail tàbí orúkọ olùlò olùlò kan tó ti wà lórí wordpress.org.

source: Add Translation Editor
yo_ng: Ṣe Àfikún Olóòtú ìtumọ̀

source: Search Translation Editors
yo_ng: Wa Àwọn Olóòtú ìtumọ̀

source: Search results for &#8220;%s&#8221;
yo_ng: Àwọn àbájáde ìwárí fún &#8220;%s&#8221;

# translation editor
source: Update
yo_ng: Ìmúdójúìwọ̀n

source: Each project includes sub projects and newly-added sub projects.
yo_ng: Iṣẹ́ kọ̀ọ̀kan pẹ̀lú àwọn iṣẹ́ abẹ́lẹ̀ àti àwọn iṣẹ́ abẹ́lẹ̀ tuntun tí a ṣẹ̀ṣẹ̀ fi kún.

source: All projects &ndash; If selected, translation editor will have validation permissions for all projects, including newly-added projects.
yo_ng: Gbogbo iṣẹ́ &ndash; Tí a bá yàn án, olóòtú ìtumọ̀ yóò ní àwọn ìgbààyè ìfọwọ́sí fún gbogbo àwọn iṣẹ́, pẹ̀lú àwọn iṣẹ́ tuntun tí a ṣẹ̀ṣẹ̀ fi kún.

source: Add editor access for:
yo_ng: Ṣe àfikún àṣẹ olóòtú fún:

source: Edit Translation Editor
yo_ng: Ṣàtúnṣe Olóòtú ìtumọ̀

source: The user is already a translation editor.
yo_ng: Olùlò náà ti jẹ́ olóòtú ìtumọ̀ tẹ́lẹ̀.

source: The user is not a translation editor.
yo_ng: Olùlò náà kì í ṣe olóòtú ìtumọ̀.

source: The user is not a member of this site.
yo_ng: Olùlò náà kì í ṣe ọmọ ẹgbẹ́ site yíì.

source: The user couldn&#8217;t be found.
yo_ng: A kò rí olùlò náà.

source: %s translation editor removed.
yo_ng: A ti yọ olóòtú ìtumọ̀ %s kúrò.

source: New translation editor added. You can select the projects now.
yo_ng: A ti fi olóòtú ìtumọ̀ tuntun kún. O lè yan àwọn iṣẹ́ náà báyìí.

source: New translation editor added.
yo_ng: A ti fi olóòtú ìtumọ̀ tuntun kún.

source: Translation editor updated.
yo_ng: A ti ṣe àtúnṣe olóòtú ìtumọ̀.

source: Translation Editors
yo_ng: Àwọn Olóòtú ìtumọ̀

source: All projects
yo_ng: Gbogbo iṣẹ́ àgbékalẹ̀

source: No projects
yo_ng: Kò sí iṣẹ́ àgbékalẹ̀

source: Remove
yo_ng: Yọọ́ kúrò

source: Edit
yo_ng: Ṣàtúnṣe

source: Select translation editor
yo_ng: Yan olóòtú ìtumọ̀

# translation editor
source: Remove
yo_ng: Yọọ́ kúrò

source: Projects
yo_ng: Àwọn Iṣẹ́

source: Name
yo_ng: Orúkọ

source: Username
yo_ng: Orúkọ Olùlò

source: No translation editors were found.
yo_ng: A kò rí àwọn olóòtú ìtumọ̀ kankan.

source: Delete
yo_ng: Paarẹ
