Repository: w3techy/WordPress-YR
Catalog: meta-plugins-v3-yor.po
Languages: yo_ng

source: To proceed with this submission you must change your %1$s line in both your main plugin file and readme to abide by these requirements. Once you've finished, you may upload the plugin again. Do not attempt to work around this by removing letters (i.e. WordPess) or using numbers (4 instead of A). Those are seen as intentional actions to avoid our restrictions, and are not permitted.
yo_ng: Láti tẹ̀síwájú pẹ̀lú ìgbéwọlẹ̀ yìí, o gbọ́dọ̀ yí ìlà %1$s rẹ padà nínú fáìlì plugin àkọ́kọ́ rẹ àti ìwé readme láti tẹ̀lé àwọn ìlànà wọ̀nyí. Lẹ́yìn tí o bá parí, o lè tún gbé plugin náà sí ayélujára. Má ṣe gbìyànjú láti yí èyí ká nípa yíyọ àwọn lẹ́tà kúrò (f.a. WordPess) tàbí lílo àwọn nọ́mbà (4 dípò A). Àwọn wọ̀nyẹn ni a rí bíi ìgbésẹ̀ àmọ̀ọ́mọ̀ láti yẹra fún àwọn ìdíwọ́ wa, a kò sì gbà wọ́n láàyè.

source: Invalid plugin dependencies specified. The following dependencies could not be resolved: %s
yo_ng: Àwọn ìgbáradì plugin tí a tọ́ka sí kò tọ̀nà. A kò lè yanjú àwọn ìgbáradì wọ̀nyí: %s

source: The %s specified is invalid. This field should not be used with WordPress.org hosted plugins.
yo_ng: %s tí a tọ́ka sí kò tọ̀nà. Ààyè yìí kò yẹ kí a lò pẹ̀lú àwọn plugin tí WordPress.org gbàlejò.

source: The %1$s field is missing. <a href="%2$s">A GPLv2 or later compatible license</a> should be specified.
yo_ng: Ààyè %1$s kò sí. <a href="%2$s">Ìwé-àṣẹ tó bá GPLv2 mu tàbí ti ìgbà tó tẹ̀le</a> ni ó yẹ kí a tọ́ka sí.

source: One or more tags were ignored: %s. Please limit your plugin to 5 tags.
yo_ng: A kò ka ọ̀kan tàbí jù bẹ́ẹ̀ lọ àwọn àmì sí: %s. Jọ̀wọ́ fi ààlà sí àwọn àmì 5 fún plugin rẹ.

source: The following contributors listed were ignored, as the WordPress.org user could not be found. %1$s. The %2$s field should only contain WordPress.org usernames.
yo_ng: A kò ka àwọn olùkópa wọ̀nyí tí a ṣe àtòjọ wọn sí, nítorí a kò rí olùṣamúlò WordPress.org náà. %1$s. Ààyè %2$s yẹ kí ó ní àwọn orúkọ olùṣamúlò WordPress.org nìkan.

# Plugin Section Name
source: Preview-Enabled plugins
yo_ng: Àwọn plugin tí a ti tan agbára àkọ́kọ́wò fún

# Plugin Section Name
source: Recently updated plugins
yo_ng: Àwọn plugin tí a ṣe àtúnṣe láìpẹ́

source: Why can&#8217;t I submit a plugin with certain display names?
yo_ng: Kí ló dé tí n kò lè fi plugin sílẹ̀ pẹ̀lú àwọn orúkọ àfihàn kan?

source: Type: %s
yo_ng: Irúfẹ́: %s

source: Type
yo_ng: Irúfẹ́

source: Sort: %s
yo_ng: Tò Lẹ́sẹẹsẹ: %s

source: Sort
yo_ng: Tò Lẹ́sẹẹsẹ

source: Newest
yo_ng: Tuntun Jùlọ

source: Recently Updated
yo_ng: Àtúnṣe Láìpẹ́

source: Most Used
yo_ng: Èyí Tí Wọ́n Lò Jùlọ

source: Relevance
yo_ng: Ìbámu

source: Submit a plugin
yo_ng: Fi plugin sílẹ̀

# Plugin Section Description
source: Block Plugins as used in the Block Directory.
yo_ng: Àwọn Plugin Ìdí bí a ṣe lò ó nínú Ìwé Àkójọ Ìdí.

# Plugin Section Name
source: New plugins
yo_ng: Àwọn plugin tuntun

# Plugin Section Name
source: Block plugins
yo_ng: Àwọn plugin ìdí

# Plugin Section Name
source: Popular plugins
yo_ng: Àwọn plugin tó gbajúmọ̀

# Plugin Section Name
source: Featured plugins
yo_ng: Àwọn plugin tí a yàn

# Plugin Section Name
source: Block-Enabled plugins
yo_ng: Àwọn plugin tí a ti tan agbára ìdínà fún

# Plugin Section Name
source: Beta plugins
yo_ng: Àwọn plugin Bétà

source: I confirm that the plugin has been tested with the <a href="%s">Plugin Check</a> plugin, and all indicated issues resolved (apart from what I believe to be false-positives).
yo_ng: Mo fìdí rẹ̀ múlẹ̀ pé a ti ṣe àyẹ̀wò plugin náà pẹ̀lú plugin <a href="%s">Plugin Check</a>, àti pé gbogbo àwọn ọ̀ràn tí a tọ́ka sí ti yanjú (yàtọ̀ sí àwọn tí mo gbàgbọ́ pé ó jẹ́ àṣìṣe èrò).

source: During the last import of your plugin the following warnings were encountered. This message is visible only to the plugin authors &amp; committers.
yo_ng: Lásìkò ìgbéwọlé plugin rẹ tó kẹ́yìn, a bá àwọn ìkìlọ̀ wọ̀nyí pàdé. Ìránṣẹ́ yìí wà fún àwọn òǹkọ̀wé plugin &amp; àwọn olùfìṣọwọ́sí nìkan.

source: The following tags are not widely used: %s
yo_ng: Àwọn àmì wọ̀nyí kò wọ́pọ̀: %s

source: The %s section is too long and was truncated. A maximum of %s words is supported.
yo_ng: Apá %s gùn jù, a sì gé e kúrú. Àpapọ̀ ọ̀rọ̀ %s ni a gbà láàyè.

source: Sorry, but nothing matched your query.
yo_ng: Má bínú, ṣùgbọ́n kò sí ohun tí ó bá ìbéèrè rẹ mu.

source: Check with Plugin Check
yo_ng: Ṣàyẹ̀wò pẹ̀lú Plugin Check

source: Please review the Plugin Check results for your plugin, and fix any significant problems. This will help streamline the preview process and reduce delays by ensuring your plugin already meets the required standards when the plugin review team examines it.
yo_ng: Jọ̀wọ́ ṣe àgbéyẹ̀wò àwọn àbájáde Plugin Check fún plugin rẹ, kí o sì ṣatúnṣe àwọn ìṣòro pàtàkì èyíkéyìí. Èyí yóò ràn lọ́wọ́ láti mú ìgbésẹ̀ àkọ́kọ́wò rọrùn àti láti dínkù àwọn ìdádúró nípa rírí dájú pé plugin rẹ ti bá àwọn ìlànà tí a nílò mu nígbà tí ẹgbẹ́ àgbéyẹ̀wò plugin bá ṣàyẹ̀wò rẹ̀.

source: We have received a request from the author of this plugin not to continue with the submission. Your submission has been successfully rejected. If, at the end, you feel this decision was in error, please <strong>reply</strong> to this email with your plugin attached as a zip and explain what happened.
yo_ng: A ti gba ìbéèrè láti ọ̀dọ̀ òǹkọ̀wé plugin yìí pé kí á má tẹ̀síwájú pẹ̀lú ìgbéwọlẹ̀ náà. A ti kọ ìgbéwọlẹ̀ rẹ ní àṣeyọrí. Tí ó bá jẹ́ pé ní ìparí, o rò pé àṣìṣe ni ìpinnu yìí, jọ̀wọ́ <strong>dáhùn</strong> sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ohun tó ṣẹlẹ̀.

source: Unfortunately your plugin submission for ###NAME### (###SLUG###), submitted on ###SUBMISSION_DATE###, has been rejected from the WordPress Plugin Directory. ###REASON###
yo_ng: Láìṣe àṣeyọrí, a ti kọ ìgbéwọlẹ̀ plugin rẹ fún ###NAME### (###SLUG###), tí a fi sílẹ̀ ní ###SUBMISSION_DATE###, láti inú Ìwé Àkójọ Plugin WordPress. ###REASON###

source: The following files are not permitted in plugins: %s. Please remove them and upload the plugin again.
yo_ng: A kò gba àwọn fáìlì wọ̀nyí láàyè nínú àwọn plugin: %s. Jọ̀wọ́ yọ wọ́n kúrò kí o sì tún gbé plugin náà sí ayélujára.

source: Error: The plugin contains unexpected files.
yo_ng: Àṣìṣe: Plugin náà ní àwọn fáìlì àìròtẹ́lẹ̀.

source: The %s section is too long and was truncated. A maximum of %s characters is supported.
yo_ng: Apá %s gùn jù, a sì gé e kúrú. Àpapọ̀ àwọn lẹ́tà %s ni a gbà láàyè.

source: The %s section is missing. An excerpt was generated from your main plugin description.
yo_ng: Apá %s kò sí. A yọ àkópọ̀ jáde láti inú àpèjúwe plugin àkọ́kọ́ rẹ.

source: One or more tags were ignored. The following tags are not permitted: %s
yo_ng: A kò ka ọ̀kan tàbí jù bẹ́ẹ̀ lọ àwọn àmì sí. A kò gba àwọn àmì wọ̀nyí láàyè: %s

source: One or more tags were ignored. Please limit your plugin to 5 tags.
yo_ng: A kò ka ọ̀kan tàbí jù bẹ́ẹ̀ lọ àwọn àmì sí. Jọ̀wọ́ fi ààlà sí àwọn àmì 5 fún plugin rẹ.

source: Are you sure you want to remove %s as a support rep?
yo_ng: Ṣé o dá ọ lójú pé o fẹ́ yọ %s kúrò gẹ́gẹ́ bíi aṣojú ìrànlọ́wọ́?

source: Are you sure you want to remove %s as a committer?
yo_ng: Ṣé o dá ọ lójú pé o fẹ́ yọ %s kúrò gẹ́gẹ́ bíi olùfìṣọwọ́sí?

source: Thank you for uploading ###NAME### to the WordPress Plugin Directory. We will review your submission as soon as possible and send you a follow up email with the results. **Slug / Permalink** Based on your display name of ###NAME### your plugin has been initially assigned the following permalink: https://wordpress.org/plugins/###SLUG###/ _(please note: This URL will not be operational until your plugin review is approved)_ You can customize this on the [Plugin Submission page](https://wordpress.org/plugins/developers/add/), if you were unable to do this, please reply with the details of what you would like your plugin slug to be. Once your plugin is approved, _we cannot change it_. If the slug listed [on the submission page](https://wordpress.org/plugins/developers/add/) is incorrect, please tell us as soon as possible; if that's correct, you do not need to contact us. Your plugin slug / permalink is subject to change once a human review is completed. **Review Process** Our volunteer team of reviewers endeavors to perform all reviews in a timely manner, we are unable to provide an exact date of when your plugin will be reviewed. We encourage all plugin authors to use [Plugin Check](https://wordpress.org/plugins/plugin-check/) to ensure that most basic issues are resolved first. Please note: Automated tools may have false positives, or may miss issues. Plugin Check and other tools cannot guarantee our reviewers won’t find an issue that requires fixing or clarification. Please refer to the [Plugin Submission page](https://wordpress.org/plugins/developers/add/) for: * Up-to-date details of the currently review queue length and estimated times. * Upload a new version of the plugin: In case you wish to update the files of your plugin submission before we begin with the review. **Guidelines** All plugins are required to abide by our Plugin Guidelines. Please ensure you have read and understand these. https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/ A common issue encountered by plugin authors is that we require your accounts email address to remain operational, not to have autoresponders, and not mark our emails as spam. To reduce the possibility of this affecting you, please ensure you add `plugins@wordpress.org` to your address book / contact list. If you use an email forwarder, alias, or group mailing list, please ensure that address is added to the Allow list. **Other Questions or Concerns?** Please refer to our Frequently Asked Questions list here: https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/ If your question is not covered by this email, the submission page, or the above FAQ, please respond to this email with your question. **Additionally...** Please make sure to follow our official blog, for updates related to the team and review requirement changes: https://make.wordpress.org/plugins/ Reviews are currently in English only. We apologize for the inconvenience. If you have no questions, concerns, or comments, please do not reply to this email.
yo_ng: A dúpẹ́ fún gbígbé ###NAME### sí inú Ìwé Àkójọ Plugin WordPress. A ó ṣe àgbéyẹ̀wò ìgbéwọlẹ̀ rẹ ní kíákíá bí ó bá ti ṣeé ṣe, a ó sì fi lẹ́tà sọ̀nrọ̀sọ̀ àtẹ̀lé ránṣẹ́ sí ọ pẹ̀lú àwọn àbájáde. **Slug / Permalink** Ní ìbámu pẹ̀lú orúkọ àfihàn rẹ ti ###NAME###, a ti kọ́kọ́ fún plugin rẹ ní ìjápọ̀ ayérayé wọ̀nyí: https://wordpress.org/plugins/###SLUG###/ _(jọ̀wọ́ kíyèsí: URL yìí kò ní ṣiṣẹ́ títí di ìgbà tí a bá fọwọ́sí àgbéyẹ̀wò plugin rẹ)_ O lè ṣe àtúnṣe èyí ní [ojú ìwé Ìgbéwọlẹ̀ Plugin](https://wordpress.org/plugins/developers/add/), tí o kò bá lè ṣe èyí, jọ̀wọ́ dáhùn pẹ̀lú àlàyé nípa ohun tí o fẹ́ kí slug plugin rẹ jẹ́. Lẹ́yìn tí a bá ti fọwọ́sí plugin rẹ, _a kò lè yí i padà_. Tí slug tí a ṣe àtòjọ rẹ̀ [ní ojú ìwé ìgbéwọlẹ̀](https://wordpress.org/plugins/developers/add/) bá jẹ́ àṣìṣe, jọ̀wọ́ sọ fún wa ní kíákíá bí ó bá ti ṣeé ṣe; tí ó bá tọ̀nà, o kò nílò láti kàn sí wa. Slug / ìjápọ̀ ayérayé plugin rẹ lè yípadà lẹ́yìn tí ènìyàn bá ti parí àgbéyẹ̀wò. **Ìgbésẹ̀ Àgbéyẹ̀wò** Ẹgbẹ́ àwọn olùyọ̀ǹda ara ẹni wa ti àwọn olùgbéyẹ̀wò n sapá láti ṣe gbogbo àwọn àgbéyẹ̀wò ní àkókò tí ó yẹ, a kò lè fún ọ ní ọjọ́ pàtó tí a ó fi ṣe àgbéyẹ̀wò plugin rẹ. A gba gbogbo àwọn òǹkọ̀wé plugin níyànjú láti lo [Plugin Check](https://wordpress.org/plugins/plugin-check/) láti ríi dájú pé a ti yanjú ọ̀pọ̀lọpọ̀ àwọn ọ̀ràn ìpilẹ̀ṣẹ̀ ní àkọ́kọ́. Jọ̀wọ́ kíyèsí: Àwọn irinṣẹ́ aládàáṣiṣẹ́ lè ní àwọn àṣìṣe èrò, tàbí kí wọ́n má rí àwọn ọ̀ràn. Plugin Check àti àwọn irinṣẹ́ mìíràn kò lè ṣe ìdánilójú pé àwọn olùgbéyẹ̀wò wa kò ní rí ọ̀ràn tí ó nílò àtúnṣe tàbí àlàyé. Jọ̀wọ́ tọ́ka sí [ojú ìwé Ìgbéwọlẹ̀ Plugin](https://wordpress.org/plugins/developers/add/) fún: * Àwọn àlàyé tuntun nípa gígùn ìtòlọ́wọ̀ọ̀wọ́ àgbéyẹ̀wò lọ́wọ́lọ́wọ́ àti àwọn àkókò tí a fojú díwọ̀n. * Gbé ẹ̀yà tuntun ti plugin sí ayélujára: Tí o bá fẹ́ ṣe àtúnṣe àwọn fáìlì ìgbéwọlẹ̀ plugin rẹ kí á tó bẹ̀rẹ̀ àgbéyẹ̀wò. **Àwọn Ìlànà** Gbogbo àwọn plugin ní láti tẹ̀lé Àwọn Ìlànà Plugin wa. Jọ̀wọ́ ríi dájú pé o ti ka àwọn wọ̀nyí kí o sì yé ọ. https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/ Ọ̀ràn tó wọ́pọ̀ tí àwọn òǹkọ̀wé plugin máa ń bá pàdé ni pé a nílò kí àdírẹ́sì lẹ́tà sọ̀nrọ̀sọ̀ àkópamọ́ rẹ máa ṣiṣẹ́, kí ó má ní àwọn olùdáhùn aládàáṣiṣẹ́, kí o má sì sàmì sí àwọn lẹ́tà sọ̀nrọ̀sọ̀ wa bíi ìwé àìfẹ́. Láti dínkù ànfàní kí èyí kan ọ́, jọ̀wọ́ ríi dájú pé o fi `plugins@wordpress.org` kún inú ìwé àdírẹ́sì / àkójọpọ̀ ìfọwọ́ránṣẹ́ rẹ. Tí o bá lo olùtúmọ̀ lẹ́tà sọ̀nrọ̀sọ̀, orúkọ mìíràn, tàbí àkójọpọ̀ ìfiránṣẹ́ ẹgbẹ́, jọ̀wọ́ ríi dájú pé a fi àdírẹ́sì náà kún inú àkójọpọ̀ àwọn tí a gbà láàyè. **Àwọn Ìbéèrè Tàbí Ohun Àníyàn Mìíràn?** Jọ̀wọ́ tọ́ka sí àkójọpọ̀ Àwọn Ìbéèrè Tí Wọ́n Máa Ń Béèrè Léraléra wa níbí: https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/ Tí ìbéèrè rẹ kò bá sí nínú lẹ́tà sọ̀nrọ̀sọ̀ yìí, ojú ìwé ìgbéwọlẹ̀, tàbí FAQ òkè, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú ìbéèrè rẹ. **Ní Àfikún...** Jọ̀wọ́ ríi dájú pé o tẹ̀lé búlọ́ọ̀gì wa gbogbogbòò, fún àwọn àtúnṣe nípa ẹgbẹ́ àti àwọn àyípadà ìlànà àgbéyẹ̀wò: https://make.wordpress.org/plugins/ Àwọn àgbéyẹ̀wò wà ní èdè Gẹ̀ẹ́sì nìkan lọ́wọ́lọ́wọ́. A tọrọ àforíjì fún ìdààmú náà. Tí o kò bá ní ìbéèrè, ohun àníyàn, tàbí àbá kankan, jọ̀wọ́ má ṣe dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí.

source: Successful Plugin Submission - %s
yo_ng: Ìgbéwọlẹ̀ Plugin Tó Yọrí sí rere - %s

source: Being Reviewed &#8212; We've got your email. This plugin is currently waiting on action from our review team.
yo_ng: Ní Ṣíṣe Àgbéyẹ̀wò &#8212; A ti gba lẹ́tà sọ̀nrọ̀sọ̀ rẹ. Plugin yìí n dúró de ìgbésẹ̀ láti ọ̀dọ̀ ẹgbẹ́ àgbéyẹ̀wò wa lọ́wọ́lọ́wọ́.

source: Please respond to the review email to let us know, and address any feedback that was given to you.
yo_ng: Jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ àgbéyẹ̀wò láti jẹ́ kí á mọ̀, kí o sì yanjú àwọn àbá èsì tí a fún ọ.

source: Upload new version of %s for review.
yo_ng: Gbé ẹ̀yà tuntun ti %s sí ayélujára fún àgbéyẹ̀wò.

source: Upload Date: %s
yo_ng: Ọjọ́ Ìgbéwọlẹ̀: %s

source: Submitted files:
yo_ng: Àwọn fáìlì tí a fi sílẹ̀:

source: You've already uploaded that ZIP file.
yo_ng: O ti gbé fáìlì ZIP yẹn sí ayélujára tẹ́lẹ̀.

source: New version of %s uploaded for review.
yo_ng: A ti gbé ẹ̀yà tuntun ti %s sí ayélujára fún àgbéyẹ̀wò.

source: This will enable the Preview button for public users.
yo_ng: Èyí yóò tan bọ́tìnnì Àkọ́kọ́wò fún àwọn olùṣamúlò gbogbogbòò.

source: This will disable the Preview button for public users.
yo_ng: Èyí yóò pa bọ́tìnnì Àkọ́kọ́wò fún àwọn olùṣamúlò gbogbogbòò.

source: <strong>Note:</strong> Missing or invalid blueprint.json file.
yo_ng: <strong>Àkíyèsí:</strong> Fáìlì blueprint.json tí kò sí tàbí tí kò tọ̀nà.

source: Rejection Reason: %s
yo_ng: Ìdí Ìkọ̀sílẹ̀: %s

source: Rejection Reason:
yo_ng: Ìdí Ìkọ̀sílẹ̀:

source: &rarr; (pending; waiting on reviewer, email not yet sent)* : %d
yo_ng: &rarr; (ndúródé; ndúródé fún olùgbéyẹ̀wò, a kò tíì fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́)* : %d

source: &rarr; (pending; waiting on reviewer)* : %d
yo_ng: &rarr; (ndúródé; ndúródé fún olùgbéyẹ̀wò)* : %d

source: &rarr; (pending; waiting on author)* : %d
yo_ng: &rarr; (ndúródé; ndúródé fún òǹkọ̀wé)* : %d

source: Test Preview
yo_ng: Dán Àkọ́kọ́wò wò

source: Please toggle the Live Preview link for %s
yo_ng: Jọ̀wọ́ yí ìjápọ̀ Àkọ́kọ́wò Láaye padà fún %s

source: The Live Preview link to Playground is currently disabled. Use the toggle button to enable it.
yo_ng: Ìjápọ̀ Àkọ́kọ́wò Láaye sí Playground ti wà ní dídílọ́wọ́ lọ́wọ́lọ́wọ́. Lo bọ́tìnnì ìyípadà láti tan án.

source: The Live Preview link to Playground is currently enabled. Use the toggle button to disable it.
yo_ng: Ìjápọ̀ Àkọ́kọ́wò Láaye sí Playground ti wà ní títàn lọ́wọ́lọ́wọ́. Lo bọ́tìnnì ìyípadà láti pa á.

source: Toggle Live Preview
yo_ng: Yí Àkọ́kọ́wò Láaye Padà

source: Live Preview
yo_ng: Àkọ́kọ́wò Láaye

source: Discard
yo_ng: Pa rẹ́

source: Discarded by %1$s, %2$s ago.
yo_ng: %1$s ti pa á rẹ́, ní %2$s sẹ́yìn.

source: Release discarded.
yo_ng: Ìtújáde ti parẹ́.

source: Commercial
yo_ng: Ìṣòwò

source: Community
yo_ng: Àwùjọ

source: All
yo_ng: Gbogbo

source: These plugins are free, but also have paid versions available.
yo_ng: Àwọn plugin wọ̀nyí jẹ́ ọ̀fẹ́, ṣùgbọ́n wọ́n tún ní àwọn ẹ̀yà tí a sanwó fún.

source: These plugins are developed and supported by a community.
yo_ng: Àwùjọ ni ó ṣe ìdàgbàsókè àti àtìlẹ́yìn fún àwọn plugin wọ̀nyí.

source: Request
yo_ng: Ìbéèrè

source: I confirm that my slug choice <a href="%s">meets the guidelines for plugin slugs</a>.
yo_ng: Mo fìdí rẹ̀ múlẹ̀ pé yíyàn slug mi <a href="%s">bá àwọn ìlànà fún àwọn slug plugin mu</a>.

source: Desired Slug
yo_ng: Slug Tí A Fẹ́

source: Plugin Name
yo_ng: Orúkọ Plugin

source: Your slug (aka permalink) cannot be changed once your review is completed. Please choose carefully.
yo_ng: A kò lè yí slug rẹ (tí a tún mọ̀ sí ìjápọ̀ ayérayé) padà lẹ́yìn tí àgbéyẹ̀wò rẹ bá ti parí. Jọ̀wọ́ yàn pẹ̀lú àkíyèsí.

source: Your slug is used to generate your plugins URL. Currently it's %s
yo_ng: A n lo slug rẹ láti ṣe URL àwọn plugin rẹ. Lọ́wọ́lọ́wọ́ ó jẹ́ %s

source: Your chosen slug cannot be guaranteed, and is subject to change based on the results of your review.
yo_ng: A kò lè ṣe ìdánilójú slug tí o yàn, ó sì lè yípadà ní ìbámu pẹ̀lú àwọn àbájáde àgbéyẹ̀wò rẹ.

source: Request to change your plugin slug
yo_ng: Ìbéèrè láti yí slug plugin rẹ padà

source: change
yo_ng: yípadà

source: Current assigned slug: %s
yo_ng: Slug tí a yàn lọ́wọ́lọ́wọ́: %s

source: Review status: %s
yo_ng: Ipò àgbéyẹ̀wò: %s

source: Approved &#8212; Please check your email for instructions on uploading your plugin.
yo_ng: Fọwọ́sí &#8212; Jọ̀wọ́ ṣàyẹ̀wò lẹ́tà sọ̀nrọ̀sọ̀ rẹ fún àwọn ìtọ́nisọ́nà lórí gbígbé plugin rẹ sí ayélujára.

source: Being Reviewed &#8212; This plugin is currently waiting on action from you. Please check your email for details.
yo_ng: Ní Ṣíṣe Àgbéyẹ̀wò &#8212; Plugin yìí n dúró de ìgbésẹ̀ láti ọ̀dọ̀ rẹ lọ́wọ́lọ́wọ́. Jọ̀wọ́ ṣàyẹ̀wò lẹ́tà sọ̀nrọ̀sọ̀ rẹ fún àlàyé.

source: Awaiting Review &#8212; This plugin has not yet been reviewed.
yo_ng: Ndurodè Àgbéyẹ̀wò &#8212; A kò tíì ṣe àgbéyẹ̀wò plugin yìí.

source: Your request to change your plugin slug to %1$s has been received and will be reviewed by our team. We will contact you when your plugin has been approved or if we have any questions. -- The WordPress Plugin Directory Team https://make.wordpress.org/plugins
yo_ng: Lẹ́tà sọ̀nrọ̀sọ̀ yìí wà láti jẹ́ kí o mọ̀ pé a ti fi plugin rẹ %1$s kún Ìwé Àkójọ Ìdí níbí: https://wordpress.org/plugins/browse/block/. A ṣì n ṣiṣẹ́ lórí mímú àwárí Ìwé Àkójọ Ìdí àti ìṣàwárí àwọn ìdí ládàáṣiṣẹ́ dára sí i, nítorí náà má ṣe jáyà tí ìdí rẹ kò bá hàn níbẹ̀ lẹ́sẹ̀kẹsẹ̀. A ti ṣẹ̀dá irinṣẹ́ tuntun láti ran àwọn olùgbéejáde lọ́wọ́ láti ṣe ìdánimọ̀ àwọn ìṣòro àti àwọn ìlọsíwájú tí ó ṣeé ṣe sí àwọn plugin ìdí, èyí tí o ó rí níbí: https://wordpress.org/plugins/developers/block-plugin-validator/. Tí o kò bá mọ̀, Ìwé Àkójọ Ìdí jẹ́ àṣàyàn tuntun tó ń bọ̀ sí WordPress 5.5 ní August. Nípa níní plugin rẹ tí a fi kún níbí ládàáṣiṣẹ́, àwọn olùṣamúlò WordPress yóò lè ṣàwárí plugin ìdí rẹ kí wọ́n sì fi í sílẹ̀ tààrà láti inú olóòtú nígbà tí wọ́n bá n ṣàwárí àwọn ìdí. Tí o bá ní àbá èsì kankan (àṣìṣe, ìlọsíwájú, àti bẹ́ẹ̀ bẹ́ẹ̀ lọ) nípa àṣàyàn tuntun yìí, jọ̀wọ́ ṣí ọ̀ràn kan níbí: https://github.com/wordpress/gutenberg/. Tí o bá fẹ́ yọ plugin rẹ kúrò nínú Ìwé Àkójọ Ìdí, o lè ṣe bẹ́ẹ̀ níbí: https://wordpress.org/plugins/developers/block-plugin-validator/?plugin_url=%2$s Bí bẹ́ẹ̀ kọ́, o ti ṣe tán! -- Ẹgbẹ́ Ìwé Àkójọ Plugin WordPress https://make.wordpress.org/pluginsGẹ́gẹ́ bí %1$s ṣe béèrè ní %2$s, a ti ti %3$s nínú Ìwé Àkójọ Plugin WordPress. Pípa plugin rẹ jẹ́ ìgbésẹ̀ títí láé. O kò ní lè tún un ṣí láìkàn sí ẹgbẹ́ àwọn plugin. Tí o bá gbàgbọ́ pé àṣìṣe ni pípa yìí, jọ̀wọ́ fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí %4$s kí o sì ṣàlàyé ìdí tí o fi rò pé ó yẹ kí a tún plugin rẹ ṣí. -- Ẹgbẹ́ Ìwé Àkójọ Plugin WordPress https://make.wordpress.org/plugins-- Ẹgbẹ́ Ìwé Àkójọ Plugin WordPress https://make.wordpress.org/pluginsA ti gba ìbéèrè rẹ láti yí slug plugin rẹ padà sí %1$s, ẹgbẹ́ wa yóò sì ṣe àgbéyẹ̀wò rẹ̀. A ó kàn sí ọ nígbà tí a bá ti fọwọ́sí plugin rẹ tàbí tí a bá ní ìbéèrè kankan. -- Ẹgbẹ́ Ìwé Àkójọ Plugin WordPress https://make.wordpress.org/plugins

source: An unknown error occurred.
yo_ng: Àṣìṣe àìmọ̀ kan ṣẹlẹ̀.

source: Your chosen plugin name - %1$s - contains the restricted term "%2$s" which cannot be used to begin your permalink or display name. We disallow the use of certain terms in ways that are abused, or potentially infringe on and/or are misleading with regards to trademarks.
yo_ng: Orúkọ plugin tí o yàn - %1$s - ní ọ̀rọ̀ tí a fi òfin dè "%2$s" èyí tí a kò lè lò láti bẹ̀rẹ̀ ìjápọ̀ ayérayé tàbí orúkọ àfihàn rẹ. A kò gba lílo àwọn ọ̀rọ̀ kan ní àwọn ọ̀nà tí a fi ń ṣe ìlòkulò, tàbí tí ó lè rú òfin àti/tàbí tí ó lè ṣini lọ́nà nípa ti àwọn àmì ìṣòwò.

source: Your chosen plugin name - %1$s - contains the restricted term "%2$s", which cannot be used at all in your plugin permalink nor the display name.
yo_ng: Orúkọ plugin tí o yàn - %1$s - ní ọ̀rọ̀ tí a fi òfin dè "%2$s", èyí tí a kò lè lò rárá nínú ìjápọ̀ ayérayé plugin rẹ tàbí orúkọ àfihàn.

source: That slug is already in use.
yo_ng: Slug yẹn ti wà ní lílò tẹ́lẹ̀.

source: That's already your slug.
yo_ng: Ìyẹn ti jẹ́ slug rẹ tẹ́lẹ̀.

source: Invalid slug. Slugs may only contain the lowercase characters a-z, 0-9, and -.
yo_ng: Slug tí kò tọ̀nà. Àwọn slug lè ní àwọn lẹ́tà kéékèèké a-z, 0-9, àti - nìkan.

source: You can't change the slug of this plugin.
yo_ng: O kò lè yí slug plugin yìí padà.

source: The %1$s field is missing or invalid. Note: We ask you no longer attempt to use %2$s as stable, so that all plugins can be rolled back.
yo_ng: Ààyè %1$s kò sí tàbí kò tọ̀nà. Àkíyèsí: A rọ̀ ọ́ pé kí o má ṣe gbìyànjú láti lo %2$s bíi ìdúróṣinṣin mọ́, kí gbogbo àwọn plugin lè ṣeé yí padà sẹ́yìn.

source: Installs:
yo_ng: Àwọn ìgbéwọlẹ̀:

source: Updated:
yo_ng: Ṣe àtúnṣe:

source: Version:
yo_ng: Ẹ̀yà:

source: Emails
yo_ng: Àwọn lẹ́tà Sọ̀nrọ̀sọ̀

source: Mark as Pending & Assign Review
yo_ng: Sàmì sí bíi Ndurodè & Yan Àgbéyẹ̀wò

source: Assign to me
yo_ng: Yan fún mi

source: Assign Review to ...
yo_ng: Yan Àgbéyẹ̀wò sí...

source: Filter
yo_ng: Ṣàlẹ̀

source: All Reviewers
yo_ng: Gbogbo Àwọn Olùgbéyẹ̀wò

# posts
source: Assigned to Me <span class="count">(%s)</span>
yo_ng: Yíyàn fún Mi <span class="count">(%s)</span>

source: Assigned Reviewer
yo_ng: Olùgbéyẹ̀wò Tí A Yàn

source: Assign reviewer
yo_ng: Yan olùgbéyẹ̀wò

source: Reviewer
yo_ng: Olùgbéyẹ̀wò

source: %s plugin assigned.
yo_ng: %s plugin yíyàn.

source: The current wait for an initial review is at least %s day.
yo_ng: Ìdúródé lọ́wọ́lọ́wọ́ fún àgbéyẹ̀wò àkọ́kọ́ jẹ́ ó kéré tán %s ọjọ́ kan.

source: The review queue is currently longer than normal, we apologize for the delays and ask for patience.
yo_ng: Ìtòlọ́wọ̀ọ̀wọ́ àgbéyẹ̀wò gùn ju ti àtijọ́ lọ lọ́wọ́lọ́wọ́, a tọrọ àforíjì fún àwọn ìdádúró, a sì bẹ̀ yín fún sùúrù.

source: %s plugin disabled.
yo_ng: %s plugin dídílọ́wọ́.

source: %s plugin closed.
yo_ng: %s plugin tí a ti tì.

source: %s plugin opened.
yo_ng: %s plugin tí a ti ṣí.

source: The token provided is invalid for this user.
yo_ng: Àmì ìdánimọ̀ tí a pèsè kò tọ̀nà fún olùṣamúlò yìí.

source: Token created. Please provide the author with the following URL: <a href="%1$s">%1$s</a>
yo_ng: A ti ṣẹ̀dá àmì ìdánimọ̀. Jọ̀wọ́ fún òǹkọ̀wé ní URL wọ̀nyí: <a href="%1$s">%1$s</a>

source: User already had a valid token, replacing it.
yo_ng: Olùṣamúlò ti ní àmì ìdánimọ̀ tó tọ̀nà tẹ́lẹ̀, a n rọ̀pò rẹ̀.

source: User not found.
yo_ng: A kò rí olùṣamúlò.

source: Expiration
yo_ng: Ìparí

source: User
yo_ng: Olùṣàmúlò
