Repository: w3techy/WordPress-YR
Catalog: meta-plugins-v3-yor.po
Languages: yo_ng

source: Your plugin&#8217;s URL will be populated based on the value of <code>Plugin Name</code> in your main plugin file (the one with the plugin headers). If you set yours as <code>Plugin Name: Boaty McBoatface</code> then your URL will be <code>https://wordpress.org/plugins/boaty-mcboatface</code> and your slug will be <code>boaty-mcboatface</code> for example. If there is an existing plugin with your name, then you will be <code>boaty-mcboatface-2</code> and so on. It behaves exactly like WordPress post names.
yo_ng: URL plugin rẹ yóò kún ní ìbámu pẹ̀lú ìníyelórí <code>Orúkọ Plugin</code> nínú fáìlì plugin àkọ́kọ́ rẹ (èyí tó ní àwọn àkọlé plugin). Tí o bá ṣètò tìrẹ bíi <code>Orúkọ Plugin: Boaty McBoatface</code> nígbà náà URL rẹ yóò jẹ́ <code>https://wordpress.org/plugins/boaty-mcboatface</code> slug rẹ yóò sì jẹ́ <code>boaty-mcboatface</code> fún àpẹẹrẹ. Tí plugin kan bá wà pẹ̀lú orúkọ rẹ tẹ́lẹ̀, nígbà náà ìwọ yóò jẹ́ <code>boaty-mcboatface-2</code> àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Ó n hùwà gẹ́gẹ́ bíi àwọn orúkọ àkọsílẹ̀ WordPress.

source: What will my plugin URL be?
yo_ng: Kí ni URL plugin mi yóò jẹ́?

source: This is in the <a href="%s">Developer FAQ</a>. It takes anywhere between 1 and 10 days. We attempt to review all plugins within 5 business days of submission, but the process takes as long as it takes, depending on the complexity of your plugin.
yo_ng: Èyí wà nínú <a href="%s">FAQ Olùgbéejáde</a>. Ó máa ń gbà laarin ọjọ́ 1 sí 10. A máa ń gbìyànjú láti ṣe àgbéyẹ̀wò gbogbo àwọn plugin láàrin ọjọ́ iṣẹ́ 5 lẹ́yìn ìgbéwọlẹ̀, ṣùgbọ́n ìgbésẹ̀ náà máa ń pẹ́ tó bá ṣe pẹ́ tó, ní ìbámu pẹ̀lú bí plugin rẹ ṣe díjú tó.

source: How long will the review process take?
yo_ng: Báwo ni ìgbésẹ̀ àgbéyẹ̀wò yóò ṣe pẹ́ tó?

source: Once submitted, your plugin will be manually reviewed for any common errors as well as ensuring it complies with <a href="%s">all the guidelines</a>.
yo_ng: Lẹ́yìn tí a bá ti fi sílẹ̀, a ó ṣe àgbéyẹ̀wò plugin rẹ pẹ̀lú ọwọ́ fún àwọn àṣìṣe tó wọ́pọ̀, àti láti ríi dájú pé ó bá <a href="%s">gbogbo àwọn ìlànà</a> mu.

source: To make your entry in the plugin browser most useful, each plugin should have a readme file named <code>readme.txt</code> that adheres to the <a href="%1$s">WordPress plugin readme file standard</a>. You can put your readme file through the <a href="%2$s">readme validator</a> to check it.
yo_ng: Láti jẹ́ kí ìwọlé rẹ nínú olùṣàwárí plugin wúlò jùlọ, plugin kọ̀ọ̀kan gbọ́dọ̀ ní fáìlì readme tí orúkọ rẹ̀ jẹ́ <code>readme.txt</code> tó bá <a href="%1$s">ìlànà fáìlì readme plugin WordPress</a> mu. O lè fi fáìlì readme rẹ sí inú <a href="%2$s">olùṣàyẹ̀wò readme</a> láti ṣàyẹ̀wò rẹ̀.

source: Readme files
yo_ng: Àwọn fáìlì Readme

source: Check out the <strong><a href="%s">FAQ</a></strong> for more information.
yo_ng: Ṣàyẹ̀wò <strong><a href="%s">FAQ</a></strong> fún ìwífún síwájú sí i.

source: Shortly after you upload your plugin (and a <a href="%1$s">readme file</a>!) to that repository, it will be automatically displayed in the <a href="%2$s">plugins browser</a>.
yo_ng: Láìpẹ́ lẹ́yìn tí o bá ti gbé plugin rẹ (àti <a href="%1$s">fáìlì readme</a>!) sí ibi ìpamọ́ yẹn, a ó fi hàn ládàáṣiṣẹ́ nínú <a href="%2$s">olùṣàwárí àwọn plugin</a>.

source: Once approved, you&#8217;ll be given access to a <a id="subversion" href="%s">Subversion Repository</a> where you&#8217;ll store your plugin.
yo_ng: Lẹ́yìn tí a bá ti fọwọ́sí i, a ó fún ọ ní àṣẹ sí <a id="subversion" href="%s">Ibi Ìpamọ́ Subversion</a> níbi tí o ó ti pa plugin rẹ mọ́.

source: After your plugin is <a href="%s">manually reviewed</a>, it will either be approved or you will be emailed and asked to provide more information and/or make corrections.
yo_ng: Lẹ́yìn tí a bá ti <a href="%s">ṣe àgbéyẹ̀wò plugin rẹ pẹ̀lú ọwọ́</a>, a ó fọwọ́sí i tàbí kí a fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí ọ láti béèrè fún ìwífún síwájú sí i àti/tàbí láti ṣe àwọn àtúnṣe.

source: <a href="%s">Submit your plugin for review</a>.
yo_ng: <a href="%s">Fi plugin rẹ sílẹ̀ fún àgbéyẹ̀wò</a>.

source: <a href="%s">Sign up</a> for an account on WordPress.org.
yo_ng: <a href="%s">Forúkọsílẹ̀</a> fún àkópamọ́ lórí WordPress.org.

source: Your plugin must abide by our list of <a href="%s">detailed guidelines</a>, which include not being a spammer and not abusing the systems.
yo_ng: Plugin rẹ gbọ́dọ̀ tẹ̀lé àkójọpọ̀ <a href="%s">àwọn ìlànà kíkún</a> wa, èyí tó kan àìjẹ́ olùfiránṣẹ́ àìfẹ́ àti àìṣe ìlòkulò àwọn ètò.

source: The plugin must not embed external links on the public site (like a &#8220;powered by&#8221; link) without explicitly asking the user&#8217;s permission.
yo_ng: Plugin kò gbọ́dọ̀ fi àwọn ìjápọ̀ ìta sí ojúlé gbogbogbòò (bíi ìjápọ̀ &#8220;agbára láti ọwọ́&#8221;) láìgbà àṣẹ olùṣamúlò ní pàtó.

source: You have to actually use the <a href="%s">Subversion</a> repository we give you in order for your plugin to show up on this site. The WordPress Plugin Directory is a hosting site, not a listing site.
yo_ng: O ní láti lo ibi ìpamọ́ <a href="%s">Subversion</a> tí a fún ọ kí plugin rẹ tó lè hàn lórí ojúlé yìí. Ìwé Àkójọ Plugin WordPress jẹ́ ojúlé ìgbàlejò, kì í ṣe ojúlé àtòjọ.

source: The plugin must not do anything illegal or be morally offensive (that&#8217;s subjective, we know).
yo_ng: Plugin kò gbọ́dọ̀ ṣe ohunkóhun tí kò bófin mu tàbí tí ó burú níwà (èyí jẹ́ ti ara ẹni, a mọ̀).

source: There are some restrictions
yo_ng: Àwọn ìdíwọ́ kan wà

source: Give your plugin lots of exposure in this centralized repository.
yo_ng: Fún plugin rẹ ní ọ̀pọ̀lọpọ̀ ìfarahàn nínú ibi ìpamọ́ àárín yìí.

source: Get your plugin rated against all the other cool WordPress plugins.
yo_ng: Gba ìbò fún plugin rẹ ní ìfiwéra pẹ̀lú gbogbo àwọn plugin WordPress tó dára mìíràn.

source: Let people leave comments about your plugin.
yo_ng: Jẹ́ kí àwọn ènìyàn fi àwọn àbá sílẹ̀ nípa plugin rẹ.

source: Keep track of how many people have downloaded it.
yo_ng: Máa tọpinpin iye àwọn ènìyàn tí wọ́n ti ṣe ìgbàsílẹ̀ rẹ̀.

source: You&#8217;ve got a cool new plugin and are hoping to give it some exposure. You&#8217;re in the right place. Just <a href="%s">ask us to host it for you</a>. You&#8217;ll be able to:
yo_ng: O ní plugin tuntun tó dára, o sì n retí láti fún un ní ìfarahàn. O wà ní ibi tó tọ́. Kàn <a href="%s">béèrè lọ́wọ́ wa láti gbà á ní àlejò fún ọ</a>. O ó lè:

source: This plugin <strong>hasn&#146;t been tested with the latest 3 major releases of WordPress</strong>. It may no longer be maintained or supported and may have compatibility issues when used with more recent versions of WordPress.
yo_ng: Plugin yìí <strong>kò tíì ṣe àyẹ̀wò pẹ̀lú àwọn ìtújáde mẹ́ta pàtàkì tó kẹ́yìn ti WordPress</strong>. Ó lè jẹ́ pé a kò tọ́jú tàbí ṣe àtìlẹ́yìn fún un mọ́, ó sì lè ní àwọn ọ̀ràn ìbámu nígbà tí a bá lò ó pẹ̀lú àwọn ẹ̀yà WordPress tuntun.

source: Browse
yo_ng: Ṣàwárí

# Plugin Category Name
source: Utilities & Tools
yo_ng: Àwọn Ohun Èlò & Irinṣẹ́

source: Rejected <span class="count">(%s)</span>
yo_ng: Kíkọ̀sílẹ̀ <span class="count">(%s)</span>

source: Closed <span class="count">(%s)</span>
yo_ng: Títìpa <span class="count">(%s)</span>

source: Approved <span class="count">(%s)</span>
yo_ng: Fífọwọ́sí <span class="count">(%s)</span>

source: Disabled <span class="count">(%s)</span>
yo_ng: Dídílọ́wọ́ <span class="count">(%s)</span>

source: Pending <span class="count">(%s)</span>
yo_ng: Ndurodè <span class="count">(%s)</span>

# plugin status
source: Pending
yo_ng: Ndurodè

source: Business Model
yo_ng: Àpẹẹrẹ Ìṣòwò

source: Built For
yo_ng: Ṣe Fún

source: Search Categories
yo_ng: Ṣàwárí Àwọn Ẹ̀ka

source: New Category Name
yo_ng: Orúkọ Ẹ̀ka Tuntun

source: Add New Category
yo_ng: Fi Ẹ̀ka Tuntun Kún

source: Update Category
yo_ng: Ṣe Àtúnṣe Ẹ̀ka

source: Edit Category
yo_ng: Ṣe Àtúnṣe Ẹ̀ka

source: Plugin Category
yo_ng: Ẹ̀ka Plugin

source: Plugin Categories
yo_ng: Àwọn Ẹ̀ka Plugin

source: A Repo Plugin
yo_ng: Plugin Ibi Ìpamọ́ Kan

source: Edit Plugin
yo_ng: Ṣe Àtúnṣe Plugin

source: Editing Plugin:
yo_ng: Ṣíṣe Àtúnṣe Plugin:

source: No plugins found in Trash
yo_ng: Kò sí àwọn plugin tí a rí nínú Àpótí ìdọ̀tí

source: No plugins found
yo_ng: Kò sí àwọn plugin tí a rí

source: Search Plugins
yo_ng: Ṣàwárí Àwọn Plugin

source: View Plugin
yo_ng: Wo Plugin

source: New Plugin
yo_ng: Plugin Tuntun

source: Add New Plugin
yo_ng: Fi Plugin Tuntun Kún

source: Add New
yo_ng: Fi Tuntun Kún

source: Plugins
yo_ng: Àwọn Plugin

# Plugin Category Name
source: User Management
yo_ng: Ìṣàkóso Olùṣàmúlò

# Plugin Category Name
source: Taxonomy
yo_ng: Ìpínsíọ̀wọ́

# Plugin Category Name
source: Social & Sharing
yo_ng: Àjọṣepọ̀ & Pínpín

# Plugin Category Name
source: SEO & Marketing
yo_ng: SEO & Ìtajà

# Plugin Category Name
source: Security & Spam Protection
yo_ng: Àbò & Ààbò Lọ́wọ́ Ìwé Àìfẹ́

# Plugin Category Name
source: Ratings & Reviews
yo_ng: Àwọn Ìbò & Àgbéyẹ̀wò

# Plugin Category Name
source: Performance
yo_ng: Iṣẹ́ ṣíṣe

# Plugin Category Name
source: Multisite
yo_ng: Ojúlé Púpọ̀

# Plugin Category Name
source: Media
yo_ng: Amóhùnmáwòrán

# Plugin Category Name
source: Maps & Location
yo_ng: Àwọn Maapu & Ibi

# Plugin Category Name
source: Language Tools
yo_ng: Àwọn Irinṣẹ́ Èdè

# Plugin Category Name
source: Education & Support
yo_ng: Ẹ̀kọ́ & Ìrànlọ́wọ́

# Plugin Category Name
source: Editor & Writing
yo_ng: Olóòtú & Ìkọ̀wé

# Plugin Category Name
source: eCommerce
yo_ng: Ìtajà Orí Ayélujára

# Plugin Category Name
source: Discussion & Community
yo_ng: Ìjíròrò & Àwùjọ

# Plugin Category Name
source: Customization
yo_ng: Ìṣeàtúnṣe

# Plugin Category Name
source: Contact Forms
yo_ng: Àwọn Fọ́ọ̀mù Ìfọwọ́kàn

# Plugin Category Name
source: Communication
yo_ng: Ìbánisọ̀rọ̀

# Plugin Category Name
source: Calendar & Events
yo_ng: Kàlẹ́ńdà & Àwọn Ìṣẹ̀lẹ̀

# Plugin Category Name
source: Business
yo_ng: Òwò

# Plugin Category Name
source: Authentication
yo_ng: Ìfásẹẹ̀yìn

# Plugin Category Name
source: Arts & Entertainment
yo_ng: Iṣẹ́ Ọnà & Eré Ìdárayá

# Plugin Category Name
source: Analytics
yo_ng: Àtúpalẹ̀

# Plugin Category Name
source: Advertising
yo_ng: Ìpolongo

# Plugin Category Name
source: Accessibility
yo_ng: Wíwọlérọ̀rùn

source: Sorry! You cannot do that.
yo_ng: Má bínú! O kò lè ṣe ìyẹn.

source: Active Installs
yo_ng: Àwọn Ìgbéwọlẹ̀ Tó Ṣiṣẹ́

source: Rating
yo_ng: Ìbò

source: Tested Up to
yo_ng: Dánwò Dé

# comments
source: %s in moderation
yo_ng: %s nínú ìṣàkóso

source: Your plugin has been rejected because we have serious security concerns regarding this plugin. <strong>What to do next</strong> We understand it is hurtful to be told we will not host your code here and ask you please read this email carefully. You're welcome to submit a different plugin, but we feel that this is a poor choice to submit. If you have any questions, please reply to this email. Otherwise it's okay to just move on to something else. If you feel we've made this decision in error, please reply with a copy of you code attached and explain why you think that is the case. <strong>Why these kinds of plugins are not accepted</strong> Plugins that create, connect users, expose services, allow editing from external platforms and/or enable other types of administrative actions are amazing and powerful. They're also incredibly dangerous and require a high level understanding of sanitization, security, and usage. These are skills that take years to master. To safeguard the security of the WordPress ecosystem, it is best to anticipate and prevent possible attack vectors that could compromise users. Because of those reasons, unless a submission demonstrates a solid understanding of the security and usage issues out of the gate, we reject them. If you've gotten all the way down here and still think we should be hosting your code, we ask you <strong>not</strong> resubmit the plugin, and reply to this email instead.
yo_ng: A ti kọ plugin rẹ nítorí pé a kò gba àwọn plugin tí wọ́n jẹ́ àfikún wp-cli nìkan lọ́wọ́lọ́wọ́. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ níbí. Ìpinnu yìí kò níṣe pẹ̀lú dídára tàbí ète koodu rẹ, ó sì jẹmọ́ pátápátá sí òtítọ́ náà pé, ní ti tòótọ́, àfikún wp-cli ni. A gbà ọ́ nímọ̀ràn láti fi koodu yìí kún inú plugin rẹ tó ti wà tẹ́lẹ̀ dípò bíi àfikún ọ̀tọ̀. Tí o bá rò pé àṣìṣe ni èyí, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ìdí tí o fi rò pé ó yẹ kí a gbàlejò plugin rẹ níbí. Kí o tó ṣe bẹ́ẹ̀, a rọ̀ ọ́ láti lo àkókò láti ka lẹ́tà sọ̀nrọ̀sọ̀ yìí lẹ́kùn-únrẹ́rẹ́. <strong>Ìdí tí a kò fi gba irú àwọn plugin wọ̀nyí</strong> Àwọn plugin ní láti ní ìbáṣepọ̀ kan pẹ̀lú búlọ́ọ̀gì ní ọ̀nà tí ó jẹ́ aládàáṣiṣẹ́ (f.a. títan plugin náà gbà á láàyè láti ṣiṣẹ́) tàbí ìbánisọ̀rọ̀ (f.a. àjọ̀ ètò). Àwọn plugin ìlà àṣẹ kò bá àwọn ààyè yẹn mu. Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o <strong>má</strong> ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.A ti kọ plugin rẹ nítorí pé a kò gba àwọn plugin irúfẹ́ yìí ní ọ̀pọ̀ ìgbà. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ níbí, a sì rọ̀ ọ́ pé kí o ka lẹ́tà sọ̀nrọ̀sọ̀ yìí dáadáa. O lè fi plugin mìíràn sílẹ̀, ṣùgbọ́n a rò pé èyí jẹ́ yíyàn búburú láti fi sílẹ̀. Bákan náà, àwọn plugin díẹ̀ wà níbẹ̀ tí wọ́n ti n ṣàkóso èyí tẹ́lẹ̀, ó sàn kí o lo àwọn wọ̀nyẹn dípò. Tí o bá ní ìbéèrè kankan, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí. Bí bẹ́ẹ̀ kọ́, ó dára láti kàn máa bá ohun mìíràn lọ. Tí o bá rò pé a ti ṣe ìpinnu yìí ní àṣìṣe, jọ̀wọ́ dáhùn pẹ̀lú ẹ̀dà koodu rẹ tí a so mọ́ kí o sì ṣàlàyé ìdí tí o fi rò pé bẹ́ẹ̀ ni. <strong>Ìdí tí a kò fi gba irú àwọn plugin wọ̀nyí</strong> Àwọn plugin ìfisọfún ìwé àfọwọ́kọ jẹ́ àgbàyanu àti alágbára. Wọ́n tún léwu gan-an, wọ́n sì nílò òye gíga nípa sísọ di mímọ́, àbò, àti lílò. Àwọn òye wọ̀nyí gbà ọdún púpọ̀ láti kọ́. WordPress ní irinṣẹ́ tó díjú gan-an láti fi CSS sí i, ó sì yàn láti má ṣe ṣàkóso javascript nítorí àwọn ewu. PHP tilẹ̀ díjú jù bẹ́ẹ̀ lọ. Yàtọ̀ sí àwọn ọ̀ràn sísọ di mímọ́, gbígba ìfisọfún ìwé àfọwọ́kọ àìtọ́ láàyè máa ń yọrí sí àwọn olùṣamúlò tí wọ́n n fi àwọn ìwé àfọwọ́kọ tó léwu kún láìmọ̀. Àwọn olùṣamúlò yóò fi ohunkóhun sí i, plugin rẹ sì lè di ọ̀nà àìretí fún àwọn ìgbéjàkò. Ìdí nìyí tí WordPress fúnra rẹ̀ fi gbà ọ́ láàyè láti ti àwọn ènìyàn kúrò nínú agbára láti ṣe àtúnṣe àwọn fáìlì àkòrí àti plugin tààrà (nípasẹ̀ DEFINES tí ọ̀pọ̀lọpọ̀ àwọn olùgbàlejò tí a ṣàkóso n lò), ṣùgbọ́n ó tún ní àwọn àyẹ̀wò lẹ́yìn ìṣiṣẹ́ tí wọ́n n fìdí rẹ̀ múlẹ̀ pé ojúlé náà yóò ṣì máa ṣiṣẹ́ lẹ́yìn àwọn àyípadà èyíkéyìí. Nítorí àwọn ìdí wọ̀nyẹn, àyàfi tí ìgbéwọlẹ̀ kan bá fi òye tó dán mọ́rán hàn nípa àwọn ọ̀ràn àbò àti lílò láti ìbẹ̀rẹ̀, a máa ń kọ̀ wọ́n. Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o <strong>má</strong> ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.A ti kọ plugin yìí nítorí pé ó dàbí ẹ̀yà àṣefihàn tàbí ìdánwò ti plugin kan. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ, a sì rọ̀ ọ́ pé kí o ka lẹ́tà sọ̀nrọ̀sọ̀ yìí lẹ́kùn-únrẹ́rẹ́. Tí ó bá jẹ́ pé ní ìparí, o rò pé àṣìṣe ni ìpinnu yìí, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú plugin rẹ tí a so mọ́ bíi zip kí o sì ṣàlàyé ìdí tí o fi rò pé ó yẹ kí a gba plugin rẹ. <strong>Ìdí tí a kò fi gba irú àwọn plugin wọ̀nyí</strong> A nílò pé kí gbogbo àwọn plugin ṣiṣẹ́ ní kíkún kí wọ́n sì ṣe tán fún lílò nígbà tí a bá fi wọ́n sílẹ̀. Nígbà tí ẹnì kan bá fi plugin sílẹ̀ pẹ̀lú readme àkọ́kọ́ àti láìsí koodu tí a ṣe àtúnṣe tàbí tó wúlò, a gbà pé wọ́n ti gbé ẹ̀yà àpẹẹrẹ plugin wọn sí ayélujára ní àìmọ̀ọ́mọ̀, tàbí pé wọ́n n dán ọ̀nà ìgbéwọlẹ̀ sí ayélujára wò. Tí ó bá jẹ́ ti àkọ́kọ́, jọ̀wọ́ ṣàyẹ̀wò zip tí o n gbìyànjú láti gbé sí ayélujára fún àgbéyẹ̀wò lẹ́ẹ̀mejì kí o sì tún un fi sílẹ̀. Tí ó bá jẹ́ ti ìkẹjì, a rọ̀ ọ́ pé kí o má ṣe lo ètò wa fún ìdánwò. Ó ṣe ìpalára fún àwọn olùyọ̀ǹda ara ẹni láti jẹ́ kí wọ́n máa to àwọn plugin gidi tí ó ṣe tán fún àgbéyẹ̀wò. Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o <strong>má</strong> ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.A ti kọ plugin rẹ nítorí pé a ní àwọn àníyàn àbò tó ṣe pàtàkì nípa plugin yìí. <strong>Ohun tó yẹ kí o ṣe</strong> A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ níbí, a sì rọ̀ ọ́ pé kí o ka lẹ́tà sọ̀nrọ̀sọ̀ yìí dáadáa. O lè fi plugin mìíràn sílẹ̀, ṣùgbọ́n a rò pé èyí jẹ́ yíyàn búburú láti fi sílẹ̀. Tí o bá ní ìbéèrè kankan, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí. Bí bẹ́ẹ̀ kọ́, ó dára láti kàn máa bá ohun mìíràn lọ. Tí o bá rò pé a ti ṣe ìpinnu yìí ní àṣìṣe, jọ̀wọ́ dáhùn pẹ̀lú ẹ̀dà koodu rẹ tí a so mọ́ kí o sì ṣàlàyé ìdí tí o fi rò pé bẹ́ẹ̀ ni. <strong>Ìdí tí a kò fi gba irú àwọn plugin wọ̀nyí</strong> Àwọn plugin tó ń ṣẹ̀dá, tó ń so àwọn olùṣamúlò pọ̀, tó ń fi àwọn iṣẹ́ hàn, tó ń gba àtúnṣe láti orí àwọn pẹpẹ ìta àti/tàbí tó ń tan àwọn irúfẹ́ ìgbésẹ̀ ìṣàkóso mìíràn jẹ́ àgbàyanu àti alágbára. Wọ́n tún léwu gan-an, wọ́n sì nílò òye gíga nípa sísọ di mímọ́, àbò, àti lílò. Àwọn òye wọ̀nyí gbà ọdún púpọ̀ láti kọ́. Láti dáàbò bo àbò àgbáyé WordPress, ó dára jùlọ láti fojú sọ́nà fún àti láti dènà àwọn ọ̀nà ìkọlù tí ó ṣeé ṣe tí ó lè pa àwọn olùṣamúlò lára. Nítorí àwọn ìdí wọ̀nyẹn, àyàfi tí ìgbéwọlẹ̀ kan bá fi òye tó dán mọ́rán hàn nípa àwọn ọ̀ràn àbò àti lílò láti ìbẹ̀rẹ̀, a máa ń kọ̀ wọ́n. Tí o bá ti dé ìsàlẹ̀ yìí, tí o sì ṣì rò pé ó yẹ kí á máa gbà ọ́ ní àlejò koodu rẹ, a rọ̀ ọ́ pé kí o <strong>má</strong> ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.
