Repository: w3techy/WordPress-YR
Catalog: meta-plugins-v3-yor.po
Languages: yo_ng

source: Your plugin has been rejected because we do not feel it is adding any new functionality to WordPress. Any time your plugin replicates functionality found in WordPress (i.e. the uploader, jquery) is frowned upon, as it presents a possible security risk. The features in WordPress have been tested by many more people than use most plugins, so the built in tools are less likely to have issues. <strong>What to do next</strong> Please read this email in it's entirety. We know it's hurtful to be told we're not hosting your code, and there is always the possibility that we've made a mistake. If you feel that we have, please reply to this email with your plugin zip attached, explain why, and we will re-review. We ask you <strong>not</strong> resubmit the plugin, and reply to this email instead.
yo_ng: A ti kọ plugin rẹ nítorí pé a kò rò pé ó n fi iṣẹ́ ṣíṣe tuntun kankan kún WordPress. Nígbàkigbà tí plugin rẹ bá n ṣe àfarawé iṣẹ́ ṣíṣe tí a rí nínú WordPress (f.a. olùgbéwọlẹ̀, jquery) a máa ń fojú kúrò nínú rẹ̀, nítorí pé ó lè fa ewu àbò. A ti ṣe àyẹ̀wò àwọn àṣàyàn nínú WordPress láti ọwọ́ ọ̀pọ̀lọpọ̀ ènìyàn ju àwọn tí wọ́n n lo ọ̀pọ̀lọpọ̀ àwọn plugin lọ, nítorí náà àwọn irinṣẹ́ tí ó wà nínú rẹ̀ kéré láti ní ìṣòro. <strong>Ohun tó yẹ kí o ṣe</strong> Jọ̀wọ́ ka lẹ́tà sọ̀nrọ̀sọ̀ yìí lẹ́kùn-únrẹ́rẹ́. A mọ̀ pé ó máa ń dun ni láti gbọ́ pé a kò ní gbà ọ́ ní àlejò koodu rẹ, ó sì ṣeé ṣe nígbà gbogbo pé a ti ṣe àṣìṣe. Tí o bá rò pé a ti ṣe bẹ́ẹ̀, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí pẹ̀lú zip plugin rẹ tí a so mọ́, ṣàlàyé ìdí rẹ̀, a ó sì tún ṣe àgbéyẹ̀wò rẹ̀. A rọ̀ ọ́ pé kí o <strong>má</strong> ṣe tún plugin náà fi sílẹ̀, kí o sì dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí dípò.

source: Congratulations, the plugin hosting request for %1$s has been approved. Within one (1) hour your account (%2$s) will be granted commit access to your Subversion (SVN) repository. * SVN URL: https://plugins.svn.wordpress.org/%3$s * Public URL: https://wordpress.org/plugins/%3$s Once your account access has been activated, you may upload your code using a SVN client of your choice. If you are new to SVN (or the Plugin Directory) make sure to review all the links in this email. To answer some common questions: * You must use SVN to upload your code -- we are unable to do that for you * Your SVN username is `%2$s` and is case sensitive. * You can <strong>set up your SVN credentials</strong> (if you haven't already) in the "Account & Security" section of your [WordPress.org profile](%4$s). * SVN will not accept your email address as a username * Due to the size of the directory, it may take 72 hours before all search results are properly updated To help you get started, here are some links: Using Subversion with the WordPress Plugin Directory:<br> https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/ Generating your SVN Password:<br> https://make.wordpress.org/meta/handbook/tutorials-guides/svn-access/ FAQ about the WordPress Plugin Directory:<br> https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/ WordPress Plugin Directory readme.txt standard:<br> https://wordpress.org/plugins/developers/#readme A readme.txt validator:<br> https://wordpress.org/plugins/developers/readme-validator/ Plugin Assets (header images, etc):<br> https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/ WordPress Plugin Directory Guidelines:<br> https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/ Block Specific Plugin Guidelines:<br> https://developer.wordpress.org/plugins/wordpress-org/block-specific-plugin-guidelines/ If you have issues or questions, please reply to this email and let us know. Enjoy!
yo_ng: Mo kí ọ kú oríire, a ti fọwọ́sí ìbéèrè ìgbàlejò plugin fún %1$s. Láàrin wákàtí kan (1) àkópamọ́ rẹ (%2$s) yóò gba àṣẹ ìtẹ́wọ́gbà sí ibi ìpamọ́ Subversion (SVN) rẹ. * URL SVN: https://plugins.svn.wordpress.org/%3$s * URL Gbogbogbòò: https://wordpress.org/plugins/%3$s Lẹ́yìn tí a bá ti tan àṣẹ àkópamọ́ rẹ, o lè gbé koodu rẹ sí ayélujára nípa lílo oníbàárà SVN tí o yàn. Tí o bá jẹ́ tuntun sí SVN (tàbí Ìwé Àkójọ Plugin) ríi dájú pé o ṣe àgbéyẹ̀wò gbogbo àwọn ìjápọ̀ nínú lẹ́tà sọ̀nrọ̀sọ̀ yìí. Láti dáhùn àwọn ìbéèrè tó wọ́pọ̀ díẹ̀: * O gbọ́dọ̀ lo SVN láti gbé koodu rẹ sí ayélujára -- a kò lè ṣe ìyẹn fún ọ * Orúkọ olùṣamúlò SVN rẹ ni `%2$s` ó sì ṣe pàtàkì sí ìlò àwọn lẹ́tà ńlá àti kékeré. * O lè <strong>ṣètò àwọn ìwọlé SVN rẹ</strong> (tí o kò bá tíì ṣe bẹ́ẹ̀) nínú apá "Àkópamọ́ & Àbò" ti [prófáìlì WordPress.org rẹ](%4$s). * SVN kò ní gba àdírẹ́sì lẹ́tà sọ̀nrọ̀sọ̀ rẹ bíi orúkọ olùṣamúlò * Nítorí ìwọ̀n ìwé àkójọ náà, ó lè gbà tó wákàtí 72 kí gbogbo àwọn àbájáde àwárí tó fi ṣe àtúnṣe dáradára Láti ràn ọ́ lọ́wọ́ láti bẹ̀rẹ̀, èyí ni àwọn ìjápọ̀ díẹ̀: Lílo Subversion pẹ̀lú Ìwé Àkójọ Plugin WordPress:<br> https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/ Ṣíṣẹ̀dá Ọ̀rọ̀ìpamọ́ SVN rẹ:<br> https://make.wordpress.org/meta/handbook/tutorials-guides/svn-access/ FAQ nípa Ìwé Àkójọ Plugin WordPress:<br> https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/ Ìlànà readme.txt Ìwé Àkójọ Plugin WordPress:<br> https://wordpress.org/plugins/developers/#readme Olùṣàyẹ̀wò readme.txt kan:<br> https://wordpress.org/plugins/developers/readme-validator/ Àwọn Ohun ìní Plugin (àwọn àwòrán àkọlé, àti bẹ́ẹ̀ bẹ́ẹ̀ lọ):<br> https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/ Àwọn Ìlànà Ìwé Àkójọ Plugin WordPress:<br> https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/ Àwọn Ìlànà Plugin Pàtó fún Ìdí:<br> https://developer.wordpress.org/plugins/wordpress-org/block-specific-plugin-guidelines/ Tí o bá ní ìṣòro tàbí ìbéèrè, jọ̀wọ́ dáhùn sí lẹ́tà sọ̀nrọ̀sọ̀ yìí kí o sì jẹ́ kí á mọ̀. Gbádùn!

source: Release confirmations can be enabled on the Advanced view of plugin pages. If you need to disable release confirmations for a plugin, please contact %s.
yo_ng: A lè tan àwọn ìfìdíìmúlẹ̀ ìtújáde ní ojú ìwòye Tó Péye ti àwọn ojú ìwé plugin. Tí o bá nílò láti pa àwọn ìfìdíìmúlẹ̀ ìtújáde fún plugin kan, jọ̀wọ́ kàn sí %s.

source: This page is for authorized committers to view and manage releases of their plugins. Plugins with confirmations enabled require an extra action on this page to approve each new release.
yo_ng: Ojú ìwé yìí wà fún àwọn olùfìṣọwọ́sí tí a fún ní àṣẹ láti wo àti láti ṣàkóso àwọn ìtújáde àwọn plugin wọn. Àwọn plugin tí wọ́n ní ìfìdíìmúlẹ̀ tí a ti tan nílò ìgbésẹ̀ àfikún lórí ojú ìwé yìí láti fọwọ́sí ìtújáde tuntun kọ̀ọ̀kan.

source: There is already a plugin with the name %1$s known to exist, though it is not hosted on WordPress.org. This means the permalink %2$s is already in use, and has a significant user base. Were we to accept it as-is, our system would overwrite those other installs and potentially damage any existing users. This is especially true since WordPress 5.5 and up will automatically update plugins and themes. You must rename your plugin by changing the %3$s line in your main plugin file and in your readme. Once you have done so, you may upload it again. If you feel this is an incorrect assessment of the situation, please email <a href="mailto:%4$s">%4$s</a> and explain why so that we may help you.
yo_ng: Plugin kan wà pẹ̀lú orúkọ %1$s tí a mọ̀ pé ó wà tẹ́lẹ̀, bí ó tilẹ̀ jẹ́ pé a kò gbà á ní àlejò lórí WordPress.org. Èyí túmọ̀ sí pé ìjápọ̀ ayérayé %2$s ti wà ní lílò tẹ́lẹ̀, ó sì ní ọ̀pọ̀lọpọ̀ olùṣamúlò. Tí a bá gbà á bíi bẹ́ẹ̀, ètò wa yóò kọ lé àwọn ìgbéwọlẹ̀ mìíràn wọ̀nyẹn lórí, ó sì lè pa àwọn olùṣamúlò tó ti wà tẹ́lẹ̀ lára. Èyí ṣe pàtàkì jùlọ nítorí pé WordPress 5.5 àti àwọn tó tẹ̀le yóò máa ṣe àtúnṣe àwọn plugin àti àwọn àkòrí ládàáṣiṣẹ́. O gbọ́dọ̀ tún plugin rẹ sọ lórúkọ nípa yíyí ìlà %3$s padà nínú fáìlì plugin àkọ́kọ́ rẹ àti nínú readme. Lẹ́yìn tí o bá ti ṣe bẹ́ẹ̀, o lè tún un gbé sí ayélujára. Tí o bá rò pé àyẹ̀wò àìtọ́ ni èyí nípa ipò náà, jọ̀wọ́ fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí <a href="mailto:%4$s">%4$s</a> kí o sì ṣàlàyé ìdí rẹ̀ kí á lè ràn ọ́ lọ́wọ́.

source: URL must end in %s or %s!
yo_ng: URL gbọ́dọ̀ parí pẹ̀lú %s tàbí %s!

source: Warning Flags:
yo_ng: Àwọn Àmì Ìkìlọ̀:

source: <strong>Warning:</strong> Enabling release confirmations is intended to be a <em>permanent</em> action. There is no way to disable this without contacting the plugins team.
yo_ng: <strong>Ìkìlọ̀:</strong> Títan àwọn ìfìdíìmúlẹ̀ ìtújáde jẹ́ ìgbésẹ̀ tí a fẹ́ kó jẹ́ <em>títí láé</em>. Kò sí ọ̀nà láti pa èyí láìkàn sí ẹgbẹ́ àwọn plugin.

source: Confirm
yo_ng: Fìdíìmúlẹ̀

source: Approved by %1$s, %2$s ago.
yo_ng: Fọwọ́sí láti ọwọ́ %1$s, ní %2$s sẹ́yìn.

source: You approved this, %1$s ago.
yo_ng: O fọwọ́sí èyí, ní %1$s sẹ́yìn.

source: %s of %s required confirmations.
yo_ng: %s ti %s àwọn ìfìdíìmúlẹ̀ tí a nílò.

source: Waiting for confirmation.
yo_ng: Ndurodè fún ìfìdíìmúlẹ̀.

source: Release confirmed.
yo_ng: Ìtújáde ti fìdíìmúlẹ̀.

source: Release did not require confirmation.
yo_ng: Ìtújáde kò nílò ìfìdíìmúlẹ̀.

source: No releases.
yo_ng: Kò sí àwọn ìtújáde.

source: The following plugins do not have release confirmations enabled: %s
yo_ng: Àwọn plugin wọ̀nyí kò ní ìfìdíìmúlẹ̀ ìtújáde tí a ti tan: %s

source: Plugin Release Confirmation
yo_ng: Ìfìdíìmúlẹ̀ Ìtújáde Plugin

source: Email sent.
yo_ng: A ti fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́.

source: Blocks should use a namespace that is unique to the plugin or its author. It appears this namespace is already in use by another author. If that&#8217;s not you then please ensure you choose a unique namespace for your blocks. The plugin slug is a good choice.
yo_ng: Àwọn ìdí gbọ́dọ̀ lo orúkọ ààyè tí ó jẹ́ àrà ọ̀tọ̀ sí plugin tàbí òǹkọ̀wé rẹ̀. Ó dàbí pé òǹkọ̀wé mìíràn ti n lo orúkọ ààyè yìí tẹ́lẹ̀. Tí kì í bá ṣe ìwọ, nígbà náà jọ̀wọ́ ríi dájú pé o yan orúkọ ààyè àrà ọ̀tọ̀ fún àwọn ìdí rẹ. Slug plugin jẹ́ yíyàn tó dára.

source: Please use a unique block namespace. Namespace %1$s is already used by %2$s.
yo_ng: Jọ̀wọ́ lo orúkọ ààyè ìdí àrà ọ̀tọ̀. %2$s ti n lo Orúkọ Ààyè %1$s tẹ́lẹ̀.

source: Block plugins should contain a single main block. Any children blocks should use the same namespace prefix as the main block. Please ensure there are no extraneous blocks included by mistake.
yo_ng: Àwọn plugin ìdí gbọ́dọ̀ ní ìdí àkọ́kọ́ kan ṣoṣo. Ìdí ọmọ èyíkéyìí gbọ́dọ̀ lo ìpele orúkọ ààyè kan náà bíi ìdí àkọ́kọ́. Jọ̀wọ́ ríi dájú pé kò sí àwọn ìdí àìní tí a fi kún ní àṣìṣe.

source: Your plugin headers in the main plugin file headers have the same value for both the plugin and author URI (Uniform Resource Identifier). A plugin URI is a webpage that provides details about this specific plugin. An author URI is a webpage that provides information about the author of the plugin. Those two must be different. You are not required to provide both, so pick the one that best applies to your situation.
yo_ng: Àwọn àkọlé plugin rẹ nínú àwọn àkọlé fáìlì plugin àkọ́kọ́ ní ìníyelórí kan náà fún URI plugin àti URI òǹkọ̀wé (Uniform Resource Identifier). URI plugin jẹ́ ojúlé wẹ́ẹ̀bù tí ó n pèsè àlàyé nípa plugin pàtó yìí. URI òǹkọ̀wé jẹ́ ojúlé wẹ́ẹ̀bù tí ó n pèsè ìwífún nípa òǹkọ̀wé plugin náà. Àwọn méjèèjì gbọ́dọ̀ yàtọ̀. A kò nílò kí o pèsè méjèèjì, nítorí náà yan èyí tó bá ipò rẹ mu jùlọ.

source: As requested by %1$s on %2$s, the ownership of %3$s in the WordPress Plugin Directory has been transferred to %4$s. If you believe this to be in error, please contact %5$s immediately.
yo_ng: Gẹ́gẹ́ bí %1$s ṣe béèrè ní %2$s, a ti gbé ohun ìní %3$s nínú Ìwé Àkójọ Plugin WordPress sí %4$s. Tí o bá gbàgbọ́ pé àṣìṣe ni èyí, jọ̀wọ́ kàn sí %5$s lẹ́sẹ̀kẹsẹ̀.

source: %s has been approved!
yo_ng: A ti fọwọ́sí %s!

source: New committer added to %s
yo_ng: A ti fi olùfìṣọwọ́sí tuntun kún %s

source: [WordPress Plugin Directory] %1$s
yo_ng: [Ìwé Àkójọ Plugin WordPress] %1$s

source: Found blocks with %1$d different namespaces: %2$s.
yo_ng: A rí àwọn ìdí pẹ̀lú %1$d àwọn orúkọ ààyè ọ̀tọ̀ọ̀tọ̀: %2$s.

source: Larger plugins will take longer to install. This is more noticeable in the Block Directory, where the user expects blocks to be added immediately. Try reducing your file size by optimizing images & SVGs, only including the assets you need (images, fonts, etc), and using core-provided JavaScript libraries.
yo_ng: Àwọn plugin tó tóbi yóò gbà àkókò púpọ̀ láti fi sílẹ̀. Èyí hàn gbangba jùlọ nínú Ìwé Àkójọ Ìdí, níbi tí olùṣamúlò ti n retí kí a fi àwọn ìdí kún lẹ́sẹ̀kẹsẹ̀. Gbìyànjú láti dín ìwọ̀n fáìlì rẹ kù nípa ṣíṣe àtúnṣe àwọn àwòrán & àwọn SVG, fífi àwọn ohun ìní tí o nílò nìkan kún (àwọn àwòrán, àwọn fọ́ntì, àti bẹ́ẹ̀ bẹ́ẹ̀ lọ), àti lílo àwọn ilé-ìkàwé JavaScript tí kókó pèsè.

source: Plugin size is %s.
yo_ng: Ìwọ̀n Plugin jẹ́ %s.

source: Learn more about licenses.
yo_ng: Kọ́ síwájú sí i nípa àwọn ìwé-àṣẹ.

source: Please log in to use the block plugin checker.
yo_ng: Jọ̀wọ́ wọlé láti lo olùṣàyẹ̀wò plugin ìdí.

source: PHP error %s in %s
yo_ng: Àṣìṣe PHP %s nínú %s

source: Block plugins should use <code>wp_set_script_translations</code> to load translations for each script file. <a href="%s">Learn more about internationalization.</a>
yo_ng: Àwọn plugin ìdí gbọ́dọ̀ lo <code>wp_set_script_translations</code> láti gbé àwọn ìtúmọ̀ fún fáìlì ìwé àfọwọ́kọ kọ̀ọ̀kan. <a href="%s">Kọ́ síwájú sí i nípa ìsọdágbáyé.</a>

source: No translations are loaded for the scripts.
yo_ng: A kò gbé ìtúmọ̀ kankan fún àwọn ìwé àfọwọ́kọ.

source: Found PHP call %s. This may cause problems.
yo_ng: A rí ìpè PHP %s. Èyí lè fa ìṣòro.

source: Block plugins should contain minimal PHP with no UI outside the editor. JavaScript should be used instead of PHP where possible.
yo_ng: Àwọn plugin ìdí gbọ́dọ̀ ní PHP tó kéré pẹ̀lú àìsí UI ní ìta olóòtú. JavaScript ni ó yẹ kí a lò dípò PHP níbi tí ó bá ti ṣeé ṣe.

source: Found PHP call %s. This is likely to prevent your plugin from working as expected.
yo_ng: A rí ìpè PHP %s. Èyí ṣeé ṣe kó dènà plugin rẹ láti ṣiṣẹ́ bí a ṣe retí.

source: Block plugins should contain a single main block, which is added to the editor when the block is installed. If multiple blocks are used (ex: list items in a list block), the list items should set the `parent` property in their `block.json` file.
yo_ng: Àwọn plugin ìdí gbọ́dọ̀ ní ìdí àkọ́kọ́ kan ṣoṣo, èyí tí a fi kún olóòtú nígbà tí a bá fi ìdí náà sílẹ̀. Tí a bá lo ìdí púpọ̀ (f.a.: àwọn ohun kan nínú àtòjọ nínú ìdí àtòjọ), àwọn ohun kan nínú àtòjọ gbọ́dọ̀ ṣètò ohun ìní `parent` nínú fáìlì `block.json` wọn.

source: Learn more about plugin headers.
yo_ng: Kọ́ síwájú sí i nípa àwọn àkọlé plugin.

source: Plugins should include a GPL-compatible license in either readme.txt or the plugin headers.
yo_ng: Àwọn plugin gbọ́dọ̀ ní ìwé-àṣẹ tó bá GPL mu nínú readme.txt tàbí àwọn àkọlé plugin.

source: Learn more about readmes.
yo_ng: Kọ́ síwájú sí i nípa àwọn readme.

source: All plugins need a readme.txt file.
yo_ng: Gbogbo àwọn plugin nílò fáìlì readme.txt.

source: Notes
yo_ng: Àwọn àkíyèsí

source: These are suggestions to improve your block. While they are not required for your block plugin to be added to the Block Directory, addressing them will help people discover and use your block.
yo_ng: Àwọn wọ̀nyí jẹ́ àbá láti mú ìdí rẹ dára sí i. Bí ó tilẹ̀ jẹ́ pé a kò nílò wọn fún fífi plugin ìdí rẹ kún Ìwé Àkójọ Ìdí, yíyanjú wọn yóò ran àwọn ènìyàn lọ́wọ́ láti ṣàwárí àti láti lo ìdí rẹ.

source: Recommendations
yo_ng: Àwọn Ìmọ̀ràn

source: These issues must be fixed before this block can appear in the block directory.
yo_ng: A gbọ́dọ̀ ṣatúnṣe àwọn ọ̀ràn wọ̀nyí kí ìdí yìí tó lè hàn nínú ìwé àkójọ ìdí.

source: Fatal Errors
yo_ng: Àwọn Àṣìṣe Pàtàkì

source: Your plugin passed the checks, but only plugins hosted on WordPress.org can be added to the Block Directory. <a href="%s">Upload your plugin to the WordPress.org repo,</a> then come back here to add it to the Block Directory.
yo_ng: Plugin rẹ kọjá àwọn àyẹ̀wò, ṣùgbọ́n àwọn plugin tí a gbàlejò lórí WordPress.org nìkan ni a lè fi kún Ìwé Àkójọ Ìdí. <a href="%s">Gbé plugin rẹ sí ibi ìpamọ́ WordPress.org,</a> lẹ́yìn náà padà wá síbí láti fi í kún Ìwé Àkójọ Ìdí.

source: No issues were found. You can add your plugin to the Block Directory.
yo_ng: Kò sí àwọn ọ̀ràn kankan tí a rí. O lè fi plugin rẹ kún Ìwé Àkójọ Ìdí.

source: You can add your plugin to the Block Directory.
yo_ng: O lè fi plugin rẹ kún Ìwé Àkójọ Ìdí.

source: This plugin is already in the Block Directory.
yo_ng: Plugin yìí ti wà nínú Ìwé Àkójọ Ìdí tẹ́lẹ̀.

source: Results for %1$s revision %2$s
yo_ng: Àwọn àbájáde fún %1$s àtúnyẹ̀wò %2$s

source: Plugin removed from the block directory.
yo_ng: A ti yọ Plugin kúrò nínú ìwé àkójọ ìdí.

source: Plugin added to the block directory.
yo_ng: A ti fi Plugin kún inú ìwé àkójọ ìdí.

source: Example: <code>my-plugin/my-custom-block</code>
yo_ng: Àpẹẹrẹ: <code>my-plugin/my-custom-block</code>

source: Block names must contain a namespace prefix, include only lowercase alphanumeric characters or dashes, and start with a letter. The namespace should be unique to your block plugin, make sure to change any defaults from block templates like "create-block/" or "cgb/".
yo_ng: Àwọn orúkọ ìdí gbọ́dọ̀ ní ìpele orúkọ ààyè, kí wọ́n ní àwọn lẹ́tà kéékèèké àti nọ́mbà tàbí àwọn ìlà nìkan, kí wọ́n sì bẹ̀rẹ̀ pẹ̀lú lẹ́tà. Orúkọ ààyè gbọ́dọ̀ jẹ́ àrà ọ̀tọ̀ sí plugin ìdí rẹ, ríi dájú pé o yí àwọn àtijọ́ èyíkéyìí padà láti inú àwọn àpẹẹrẹ ìdí bíi "create-block/" tàbí "cgb/".

source: Block %1$s uses namespace %2$s. Please use a unique namespace.
yo_ng: Ìdí %1$s n lo orúkọ ààyè %2$s. Jọ̀wọ́ lo orúkọ ààyè àrà ọ̀tọ̀.

source: Block name %s is invalid. Please use lowercase alphanumeric characters.
yo_ng: Orúkọ ìdí %s kò tọ̀nà. Jọ̀wọ́ lo àwọn lẹ́tà kéékèèké àti nọ́mbà.

source: Block name %1$s already exists in the plugin "%2$s."
yo_ng: Orúkọ ìdí %1$s ti wà tẹ́lẹ̀ nínú plugin "%2$s."

source: Unlike regular blocks, plugins in the block directory cannot use a script handle for these values.
yo_ng: Yàtọ̀ sí àwọn ìdí lásán, àwọn plugin nínú ìwé àkójọ ìdí kò lè lo ìmu ìwé àfọwọ́kọ fún àwọn ìníyelórí wọ̀nyí.

source: The value of <code>script</code>, <code>style</code>, <code>editorScript</code>, <code>editorStyle</code> must be a valid file path. This value was detected, but there is no file at this location in your plugin.
yo_ng: Ìníyelórí <code>script</code>, <code>style</code>, <code>editorScript</code>, <code>editorStyle</code> gbọ́dọ̀ jẹ́ ọ̀nà fáìlì tó tọ̀nà. A rí ìníyelórí yìí, ṣùgbọ́n kò sí fáìlì ní ibí yìí nínú plugin rẹ.

source: Expected %s to be a valid CSS file path.
yo_ng: A retí pé %s yóò jẹ́ ọ̀nà fáìlì CSS tó tọ̀nà.

source: Expected %s to be a valid JavaScript file path.
yo_ng: A retí pé %s yóò jẹ́ ọ̀nà fáìlì JavaScript tó tọ̀nà.

source: Expected %s to be a valid file path.
yo_ng: A retí pé %s yóò jẹ́ ọ̀nà fáìlì tó tọ̀nà.

source: Found file %s.
yo_ng: A rí fáìlì %s.

source: Browse code on trac
yo_ng: Ṣàwárí koodu lórí trac

source: [WordPress Plugin Directory] Added to Block Directory - %s
yo_ng: [Ìwé Àkójọ Plugin WordPress] A Ti Fi Kún Ìwé Àkójọ Ìdí - %s

source: Committer Tools
yo_ng: Àwọn Irinṣẹ́ Olùfìṣọwọ́sí

source: Check Plugin!
yo_ng: Ṣàyẹ̀wò Plugin!

source: Block plugins should keep the PHP code to a minimum. If you need a lot of PHP code, your plugin probably belongs in the main Plugin Directory rather than the Block Directory.
yo_ng: Àwọn plugin ìdí gbọ́dọ̀ jẹ́ kí koodu PHP kéré sí i. Tí o bá nílò ọ̀pọ̀lọpọ̀ koodu PHP, plugin rẹ ṣeé ṣe kó jẹ́ ti Ìwé Àkójọ Plugin àkọ́kọ́ dípò Ìwé Àkójọ Ìdí.

source: This block.json file is invalid. The Block Directory needs to be able to read this file.
yo_ng: Fáìlì block.json yìí kò tọ̀nà. Ìwé Àkójọ Ìdí nílò láti lè ka fáìlì yìí.

source: At least one of your JavaScript files must explicitly call registerBlockType(). Without that call, your block will not work in the editor.
yo_ng: Ó kéré tán ọ̀kan nínú àwọn fáìlì JavaScript rẹ gbọ́dọ̀ pe registerBlockType() ní pàtó. Láìsí ìpè yẹn, ìdí rẹ kò ní ṣiṣẹ́ nínú olóòtú.

source: Your plugin should contain at least one <code>block.json</code> file. This file contains metadata describing the block and its JavaScript and CSS assets. Make sure you include at least one <code>script</code> or <code>editorScript</code> item.
yo_ng: Plugin rẹ gbọ́dọ̀ ní ó kéré tán fáìlì <code>block.json</code> kan. Fáìlì yìí ní àwọn àkójọpọ̀ data tó n ṣàpèjúwe ìdí àti àwọn ohun ìní JavaScript àti CSS rẹ̀. Ríi dájú pé o fi ó kéré tán ohun kan <code>script</code> tàbí <code>editorScript</code> kún un.

source: Learn how to create a block.
yo_ng: Kọ́ bí a ṣe n ṣẹ̀dá ìdí.

source: If your plugin doesn’t register a block, it probably belongs in the main Plugin Directory rather than the Block Directory.
yo_ng: Tí plugin rẹ kò bá forúkọsílẹ̀ ìdí kan, ó ṣeé ṣe kó jẹ́ ti Ìwé Àkójọ Plugin àkọ́kọ́ dípò Ìwé Àkójọ Ìdí.

source: To work in the Block Directory, a plugin must register a block. Generally one per plugin (multiple blocks may be permitted if those blocks are interdependent, such as a list block that contains list item blocks).
yo_ng: Láti ṣiṣẹ́ nínú Ìwé Àkójọ Ìdí, plugin gbọ́dọ̀ forúkọsílẹ̀ ìdí kan. Ní gbogbogbòò, ọ̀kan fún plugin kọ̀ọ̀kan (a lè gba ìdí púpọ̀ láàyè tí àwọn ìdí wọ̀nyẹn bá gbára lé ara wọn, bíi ìdí àtòjọ tó ní àwọn ohun kan nínú ìdí àtòjọ).

source: If this is a different version of your plugin, you can ignore this warning.
yo_ng: Tí èyí bá jẹ́ ẹ̀yà ọ̀tọ̀ ti plugin rẹ, o lè fojú fo ìkìlọ̀ yìí.

source: Block names must be unique, otherwise it can cause problems when using the block. It is recommended to use your plugin's name as the namespace.
yo_ng: Àwọn orúkọ ìdí gbọ́dọ̀ jẹ́ àrà ọ̀tọ̀, bí bẹ́ẹ̀ kọ́ ó lè fa ìṣòro nígbà tí a bá n lo ìdí náà. A gbà ọ́ nímọ̀ràn láti lo orúkọ plugin rẹ bíi orúkọ ààyè.

source: The readme.txt file must contain the tag "block" (singular) for this to be added to the block directory.
yo_ng: Fáìlì readme.txt gbọ́dọ̀ ní àmì "ìdí" (ẹyọ kan) kí á tó lè fi èyí kún inú ìwé àkójọ ìdí.

source: Issues found in block.json file.
yo_ng: Àwọn ọ̀ràn tí a rí nínú fáìlì block.json.

source: More than one top-level block was found: %s
yo_ng: A rí ju ìdí ìpele-òkè kan lọ: %s

source: Found a block.json file for block %s.
yo_ng: A rí fáìlì block.json kan fún ìdí %s.

source: Trac browser
yo_ng: Olùṣàwárí Trac

source: Edit plugin
yo_ng: Ṣe àtúnṣe plugin

source: Add %s to Block Directory
yo_ng: Fi %s kún Ìwé Àkójọ Ìdí

source: Remove %s from Block Directory
yo_ng: Yọ %s kúrò nínú Ìwé Àkójọ Ìdí

source: Found %s of PHP code. Thanks for keeping it minimal!
yo_ng: A rí %s ti koodu PHP. O ṣeun fún mímú un kéré!

source: Found %s of PHP code. This might not be a block plugin.
yo_ng: A rí %s ti koodu PHP. Èyí lè má jẹ́ plugin ìdí.

source: Found %s of PHP code. Please submit PHP plugins to the plugin directory.
yo_ng: A rí %s ti koodu PHP. Jọ̀wọ́ fi àwọn plugin PHP sílẹ̀ sí ìwé àkójọ plugin.

source: Found the "block" tag in readme.txt.
yo_ng: A rí àmì "ìdí" nínú readme.txt.

source: No "block" tag found in readme.txt.
yo_ng: Kò sí àmì "ìdí" tí a rí nínú readme.txt.

source: Missing plugin headers. Is this a WordPress plugin?
yo_ng: Àwọn àkọlé plugin kò sí. Ṣé plugin WordPress ni èyí?

source: Found a license in plugin headers: %s.
yo_ng: A rí ìwé-àṣẹ kan nínú àwọn àkọlé plugin: %s.

source: No plugin license was found.
yo_ng: A kò rí ìwé-àṣẹ plugin kankan.

source: JSON file %s is valid.
yo_ng: Fáìlì JSON %s tọ̀nà.

source: Some problems were found. They need to be addressed for your plugin to be included in the Block Directory.
yo_ng: A rí àwọn ìṣòro díẹ̀. Ó yẹ kí a yanjú wọn kí plugin rẹ tó lè wà nínú Ìwé Àkójọ Ìdí.

source: Plugin repo URL
yo_ng: URL ibi ìpamọ́ Plugin

source: <code>registerBlockType()</code> must be called in a JavaScript file.
yo_ng: <code>registerBlockType()</code> gbọ́dọ̀ jẹ́ pípe nínú fáìlì JavaScript kan.

source: Error attempting to parse json in %1$s: %2$s
yo_ng: Àṣìṣe nígbà tí a n gbìyànjú láti túmọ̀ json nínú %1$s: %2$s
