Repository: w3techy/WordPress-YR
Catalog: meta-plugins-v3-yor.po
Languages: yo_ng

source: No block.json files were found.
yo_ng: Kò sí àwọn fáìlì block.json tí a rí.

source: Found %d block.
yo_ng: A rí ìdí %d.

source: No blocks found in plugin.
yo_ng: Kò sí àwọn ìdí tí a rí nínú plugin.

source: Found a license in readme.txt: %s.
yo_ng: A rí ìwé-àṣẹ kan nínú readme.txt: %s.

source: Missing readme.txt file.
yo_ng: Fáìlì readme.txt kò sí.

source: Error fetching repository %s: %s
yo_ng: Àṣìṣe nígbà gbígba ibi ìpamọ́ %s: %s

source: URL must be a plugin repository: %s
yo_ng: URL gbọ́dọ̀ jẹ́ ibi ìpamọ́ plugin: %s

source: URL must be GitHub or plugins.svn.wordpress.org: %s
yo_ng: URL gbọ́dọ̀ jẹ́ GitHub tàbí plugins.svn.wordpress.org: %s

source: Invalid url: %s
yo_ng: URL tí kò tọ̀nà: %s

source: [WordPress Plugin Directory] %s has been closed
yo_ng: [Ìwé Àkójọ Plugin WordPress] A ti ti %s

source: Error: That plugin name is already in use.
yo_ng: Àṣìṣe: Orúkọ plugin yẹn ti wà ní lílò tẹ́lẹ̀.

source: Your plugin has no license declared. Please update your %1$s with a GPLv2 (or later) compatible license.
yo_ng: Plugin rẹ kò ní ìwé-àṣẹ tí a polongo. Jọ̀wọ́ ṣe àtúnṣe %1$s rẹ pẹ̀lú ìwé-àṣẹ tó bá GPLv2 (tàbí ti ìgbà tó tẹ̀le) mu.

source: Error: No license defined.
yo_ng: Àṣìṣe: Kò sí ìwé-àṣẹ tí a ṣàlàyé.

source: [WordPress Plugin Directory] Closure Notice: %s
yo_ng: [Ìwé Àkójọ Plugin WordPress] Ìfitónilétí Pípa: %s

source: [WordPress Plugin Directory] Closure Notice - %1$s: %2$s
yo_ng: [Ìwé Àkójọ Plugin WordPress] Ìfitónilétí Pípa - %1$s: %2$s

source: Security
yo_ng: Àbò

source: [WordPress Plugin Directory] Review in Progress: %s
yo_ng: [Ìwé Àkójọ Plugin WordPress] Àgbéyẹ̀wò N Lọ lọ́wọ́: %s

source: Note: While the automated plugin scan is based on the Plugin Review Guidelines, it is not a complete review. A successful result from the scan does not guarantee that the plugin will be approved, only that it is sufficient to be reviewed. All submitted plugins are checked manually to ensure they meet security and guideline standards before approval.
yo_ng: Àkíyèsí: Bí ó tilẹ̀ jẹ́ pé àyẹ̀wò plugin aládàáṣiṣẹ́ dá lórí Àwọn Ìlànà Àgbéyẹ̀wò Plugin, kì í ṣe àgbéyẹ̀wò kíkún. Àbájáde àṣeyọrí láti inú àyẹ̀wò náà kò ṣe ìdánilójú pé a ó fọwọ́sí plugin náà, ṣùgbọ́n pé ó tó láti ṣe àgbéyẹ̀wò rẹ̀ nìkan. A máa ń ṣàyẹ̀wò gbogbo àwọn plugin tí a fi sílẹ̀ pẹ̀lú ọwọ́ láti ríi dájú pé wọ́n bá àwọn ìlànà àbò àti ìtọ́nisọ́nà mu kí á tó fọwọ́sí wọn.

source: Due to the large volume of active users, the developers should be warned and their plugin remain open save under extreme circumstances.
yo_ng: Nítorí iye àwọn olùṣamúlò tó ṣiṣẹ́ púpọ̀, ó yẹ kí a kìlọ̀ fún àwọn olùgbéejáde kí plugin wọn sì wà ní ṣíṣí sílẹ̀ àyàfi lábẹ́ àwọn ipò tó lágbára.

source: Notice:
yo_ng: Ìfitónilétí:

source: Your email host has email deliverability problems. Please <a href="%s">Update your email address</a> first.
yo_ng: Olùgbàlejò lẹ́tà sọ̀nrọ̀sọ̀ rẹ ní àwọn ìṣòro ìjẹ́wọ́lẹ́tà sọ̀nrọ̀sọ̀. Jọ̀wọ́ <a href="%s">Ṣe àtúnṣe àdírẹ́sì lẹ́tà sọ̀nrọ̀sọ̀ rẹ</a> ní àkọ́kọ́.

source: You have already submitted a plugin named %1$s. There is no need to resubmit existing plugins, even for new versions. Instead, please update your plugin within the directory via <a href="%2$s">SVN</a>. If you need assistance, email <a href="mailto:%3$s">%3$s</a> and let us know.
yo_ng: O ti fi plugin kan tí orúkọ rẹ̀ n jẹ́ %1$s sílẹ̀ tẹ́lẹ̀. Kò sídìí láti tún àwọn plugin tó ti wà tẹ́lẹ̀ fi sílẹ̀, kódà fún àwọn ẹ̀yà tuntun. Dípò bẹ́ẹ̀, jọ̀wọ́ ṣe àtúnṣe plugin rẹ nínú ìwé àkójọ nípasẹ̀ <a href="%2$s">SVN</a>. Tí o bá nílò ìrànlọ́wọ́, fi lẹ́tà sọ̀nrọ̀sọ̀ ránṣẹ́ sí <a href="mailto:%3$s">%3$s</a> kí o sì jẹ́ kí á mọ̀.

source: Note: Reviews are currently in English only. We apologize for the inconvenience.
yo_ng: Àkíyèsí: Àwọn àgbéyẹ̀wò wà ní èdè Gẹ̀ẹ́sì nìkan lọ́wọ́lọ́wọ́. A tọrọ àforíjì fún ìdààmú náà.

source: We cannot find a version listed in your plugin headers. Please add a %1$s line to your main plugin file and upload the complete plugin again. If you need more information, please review our documentation on <a href="%2$s">Plugin Headers</a>.
yo_ng: A kò rí ẹ̀yà kan tí a ṣe àtòjọ rẹ̀ nínú àwọn àkọlé plugin rẹ. Jọ̀wọ́ fi ìlà %1$s kún fáìlì plugin àkọ́kọ́ rẹ kí o sì tún gbé plugin náà lẹ́ẹ̀kansíi. Tí o bá nílò ìwífún síwájú sí i, jọ̀wọ́ ṣe àgbéyẹ̀wò àwọn àkọsílẹ̀ wa lórí <a href="%2$s">Àwọn Àkọlé Plugin</a>.

source: We cannot find a description in your plugin headers. Please add a %1$s line to your main plugin file and upload the complete plugin again. If you need more information, please review our documentation on <a href="%2$s">Plugin Headers</a>.
yo_ng: A kò rí àpèjúwe kan nínú àwọn àkọlé plugin rẹ. Jọ̀wọ́ fi ìlà %1$s kún fáìlì plugin àkọ́kọ́ rẹ kí o sì tún gbé plugin náà lẹ́ẹ̀kansíi. Tí o bá nílò ìwífún síwájú sí i, jọ̀wọ́ ṣe àgbéyẹ̀wò àwọn àkọsílẹ̀ wa lórí <a href="%2$s">Àwọn Àkọlé Plugin</a>.

source: Your chosen plugin name - %1$s - is not permitted because it is too short. Please change the %2$s line in your main plugin file and readme to a different name. When you have finished, you may upload your plugin again.
yo_ng: Orúkọ plugin tí o yàn - %1$s - kò gbà nítorí pé ó kúrú jù. Jọ̀wọ́ yí ìlà %2$s padà nínú fáìlì plugin àkọ́kọ́ rẹ àti readme sí orúkọ mìíràn. Nígbà tí o bá parí, o lè tún gbé plugin rẹ sí ayélujára.

source: There is already a plugin with the name %1$s in the directory. You must rename your plugin by changing the %2$s line in your main plugin file and in your readme. Once you have done so, you may upload it again.
yo_ng: Plugin kan wà pẹ̀lú orúkọ %1$s nínú ìwé àkójọ tẹ́lẹ̀. O gbọ́dọ̀ tún plugin rẹ sọ lórúkọ nípa yíyí ìlà %2$s padà nínú fáìlì plugin àkọ́kọ́ rẹ àti nínú readme. Lẹ́yìn tí o bá ti ṣe bẹ́ẹ̀, o lè tún un gbé sí ayélujára.

source: Error: The plugin slug is too short.
yo_ng: Àṣìṣe: Slug plugin kúrú jù.

source: Your chosen plugin name - %1$s - has been reserved or otherwise restricted from use entirely. Please change the %2$s line in your main plugin file and readme, then you may upload it again.
yo_ng: Orúkọ plugin tí o yàn - %1$s - ti wà ní pípamọ́ tàbí tí a ti fi òfin dè é láti lò pátápátá. Jọ̀wọ́ yí ìlà %2$s padà nínú fáìlì plugin àkọ́kọ́ rẹ àti readme, lẹ́yìn náà o lè tún un gbé sí ayélujára.

source: The %s field is missing. It should be defined here, or in your main plugin file.
yo_ng: Ààyè %s kò sí. Ó yẹ kí a ṣàlàyé rẹ̀ níbí, tàbí nínú fáìlì plugin àkọ́kọ́ rẹ.

source: Click to search Help Scout for mentions of this plugin
yo_ng: Tẹ láti ṣàwárí Help Scout fún àwọn àpèjúwe plugin yìí

source: Click to search Help Scout for emails sent to/from this email address
yo_ng: Tẹ láti ṣàwárí Help Scout fún àwọn lẹ́tà sọ̀nrọ̀sọ̀ tí a fi ránṣẹ́ sí/láti àdírẹ́sì lẹ́tà sọ̀nrọ̀sọ̀ yìí

source: Click to search Help Scout for mentions of this author
yo_ng: Tẹ láti ṣàwárí Help Scout fún àwọn àpèjúwe òǹkọ̀wé yìí
